const QUESTIONS = [
  {
      id: 1,
      category: "生産性向上とコラボレーション",
      source: "tysonblog 第1問",
      question: "Cloud Kicks社にはプロダクトオーナーのチームがあり、プロダクトチームだけでフィードバックやアイデアを共有するスペースが必要です。チームのコラボレーションを支援するために、管理者はSalesforceをどのように活用すべきでしょうか。",
      choices: ["クイックアクションを使用してコミュニケーションを記録する。","Chatter公開グループを設定する。","Chatter非公開グループを作成する。","活動履歴を追加して、Todoを文書化する。"],
      answers: [2],
      explanation: `Chatterの非公開グループは、グループメンバーのみが参加できる設定になっており、プロダクトチームがフィードバックやアイデアを非公開に共有し合うのに適した環境を提供します。これはチームのコラボレーションを支援するための最適な選択です。
        ※ クイックアクションは主にレコードの作成または更新、メールの送信を行うことができますが、チームメンバー間でのアイデアやフィードバックの共有に特化した機能ではありません。プロダクトチームのコラボレーションを支援する要件には合致しません。
        ※ Chatter公開グループは組織内の全メンバーがアクセス可能であり、限定的なチーム内での非公開なコミュニケーションには適していません。プロダクトチーム専用のコラボレーションスペースとしては、プライバシーの要件を満たせません。
        ※ 活動履歴はTodoの記録には有効ですが、インタラクティブなコミュニケーションやアイデアの共有を促進するための機能ではありません。この機能はチーム間のコラボレーションを直接的に支援するものではなく、要件には合致しません。`
    },
  {
      id: 2,
      category: "セールス&マーケティングアプリケーション",
      source: "tysonblog 第2問",
      question: "営業マネージャーは、商談のフェーズに応じた重要な値を表示するために何が実装できるかを知りたがっています。この要件を満たすために、管理者はどのツールを使用すべきでしょうか。",
      choices: ["商談セールスプロセス","動的フォーム","パスの重要な項目","Lightningアプリケーションビルダーのカスタムコンポーネント"],
      answers: [2],
      explanation: `パスの重要な項目は、商談の各フェーズに特有の情報を提供する機能であり、ユーザーが各フェーズでどのようなアクションを取るべきか、どの情報に注意を払うべきかを指南します。商談のフェーズに応じて重要な値やガイダンスを提供するのに適しています。
        ※ 商談セールスプロセスは、商談の進行に伴うフェーズを定義するためのもので、特定のフェーズに応じた重要な値を表示する機能は提供しません。セールスプロセスは、主にフェーズの管理や設定に関するものです。
        ※ 動的フォームは、レコードビューをカスタマイズし、ユーザーの入力やレコードの状態に基づいて項目やセクションを表示または非表示にするために使用されます。商談のフェーズに応じた重要な情報を表示するために特化した機能ではありません。
        ※ ワークフロールールは、特定の条件を満たした際に自動化されたアクションをトリガーするものです。商談のフェーズに応じた情報を直接表示する機能は持っていません。商談の各フェーズで必要とされる情報を提供するためには、このツールは適していません。`
    },
  {
      id: 3,
      category: "設定とセットアップ",
      source: "tysonblog 第3問",
      question: "Northern Trail Outfitters社では、Salesforceの取引先に安全で適切なパスワードを選択するよう従業員に奨励したいと考えています。管理者が設定できるパスワードポリシーはどれですか。3つ選びなさい。",
      choices: ["最大ログイン試行回数","パスワードマネージャーアプリの使用を必須とすること","有効期限までの日数","パスワードの複雑さの要件","パスワードの禁止値"],
      answers: [0,2,3],
      explanation: `具体的には以下の項目が設定でき、今回の選択肢との関連性は以下の通りとなります。 ログイン失敗によりロックするまでの回数:今回の選択肢の[最大ログイン試行回数]に該当します。パスワードの有効期間:今回の選択肢の[有効期限までの日数]に該当します。パスワード文字列の制限:今回の選択肢の[パスワードの複雑さの要件]に該当します。`
    },
  {
      id: 4,
      category: "設定とセットアップ",
      source: "tysonblog 第4問",
      question: "Universal Containers社の管理者が、同社のSalesforceの現在のセキュリティ設定を見直しています。Salesforceへの不正アクセスを防ぐために、管理者は何をすべきでしょうか。",
      choices: ["セッションのTLS要件を無効にする。","組織全体のデフォルトをカスタマイズする。","ログインページでキャッシングとオートコンプリート機能を有効にする。","多要素認証を有効にする。"],
      answers: [3],
      explanation: `多要素認証(MFA)は、Salesforceアカウントにアクセスする際に追加の認証ステップを必要とします。これにより、パスワードが漏洩した場合でも、追加の認証手段(例：モバイルデバイスでの認証コード)を求めることで不正アクセスを防止できます。MFAはセキュリティの強化に非常に効果的な手段です。
        ※ SalesforceではTLS(Transport Layer Security)を意図的に無効にする選択肢は提供されておらず、TLSは通信のセキュリティを確保するために不可欠です。TLSを無効にすると、データ通信が暗号化されず、不正アクセスやデータの盗聴リスクが高まります。
        ※ 組織全体のデフォルトは、レコードのアクセス権を管理するための設定です。これはデータの可視性と共有に関連しており、直接的にはログインセキュリティや不正アクセスの防止には寄与しません。
        ※ ログイン情報のキャッシングやオートコンプリート機能を有効にすると、ユーザー名やパスワードがブラウザに保存され、利便性は向上しますが、共用コンピューターなどでは不正アクセスのリスクが高まります。セキュリティを強化する観点からは、これらの機能を無効にする方が望ましいです。`
    },
  {
      id: 5,
      category: "生産性向上とコラボレーション",
      source: "tysonblog 第5問",
      question: "Universal Containers社の管理者は、Salesforceでブランディング(ブランド設定)したいと考えています。 管理者が留意すべき考慮事項はどれですか。2つ選びなさい。",
      choices: ["テーマは、Salesforce ClassicとSalesforceモバイルアプリに適用されます。","Chatter 外部ユーザーには、組み込みのLightning ブルーテーマのみが表示されます。","テーマは組織全体に適用されます。","最大150個のカスタムテーマを作成、変更、または組み込みテーマからクローンできます。"],
      answers: [1,2],
      explanation: `Chatterの外部ユーザーはカスタムテーマの適用を受けず、デフォルトのLightning ブルーテーマのみが利用されます。外部ユーザー向けのUIの一貫性を保つためにこの制限が設けられています。
        カスタムテーマは組織レベルで適用され、変更は全ユーザーに影響します。これにより、組織全体で統一されたブランディングを確立することができます。
        ※ テーマとブランディングの設定はLightning Experience専用であり、Salesforce ClassicやSalesforceモバイルアプリには適用されません。
        ※ ユーザーは最大300個のカスタムテーマを作成できます。また、Salesforceが提供する組み込みテーマを修正することはできず、これらのテーマはカスタムテーマの作成時のテンプレートとしてのみ使用可能です。`
    },
  {
      id: 6,
      category: "セールス&マーケティングアプリケーション",
      source: "tysonblog 第6問",
      question: "Universal Containers社は、組織で[データ保護とプライバシー]を有効にしています。データプライバシー情報を追跡するための個人項目を使用できるページレイアウトはどれですか。",
      choices: ["ケース、商談","個人、ユーザー、取引先","取引先責任者、リード、個人取引先","取引先、ユーザー"],
      answers: [2],
      explanation: `組織で[データ保護とプライバシー]を有効化すると、管理者はリード、取引先責任者、および個人取引先レコードに「個人」項目を追加し、顧客のデータプライバシー設定を管理・追跡できます。この項目は、顧客のプライバシー関連の同意情報を明確に表示し、適切に調整可能にします。`
    },
  {
      id: 7,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第7問",
      question: "Cloud Kicks社(CK)のサポート担当者が、ケースを閉じようとすると、ケースの状況項目の選択リストに「Closed」オプションが見つからないと報告しています。CKは管理者に解決策を見つけるよう依頼しています。なぜサポート担当者は、指定された選択リストに「Closed」オプションが表示されないのでしょうか。",
      choices: ["ケースレコードタイプに、選択リスト値としてClosedがない。","ケースを閉じるには、[Close Case page Layout]というページレイアウトを使用する必要がある。","[クローズケースの状況項目を表示]チェックボックスがデフォルトでオフに設定されている。","使用しているサポートプロセスの状況項目に「Closed」が省略されている。"],
      answers: [2],
      explanation: `Salesforceのサポート設定にある「クローズケースの状況項目を表示」オプションが無効に設定されていると、エージェントは状況選択リストでクローズ状況を見ることができません。この設定を有効にすると、クローズ関連の状況が選択リストに表示されるようになります。
        ※ 状況選択リストの値「Closed」はレコードタイプではなく、サポートプロセスで管理されます。ケースの「状況」項目は、レコードタイプとは独立しており、サポートプロセスによって異なる状況値を持つことができます。したがって、レコードタイプで「Closed」が表示されるかどうかを決定するわけではありません。
        ※ ページレイアウトはユーザーインターフェイスの配置を定義しますが、状況選択リストの利用可能な値はページレイアウトではなく、サポートプロセスやレコードタイプによって決定されます。
        ※ 「Closed」はケースの状況項目において特別な意味を持つ選択リスト値であり、サポートプロセスで「Closed」を省略することはできません。Salesforce では、少なくとも1つの完了フラグが設定された状況を要求します。`
    },
  {
      id: 8,
      category: "自動化",
      source: "tysonblog 第8問",
      question: "Universal Containers社の金庫担当副社長は、営業チームのメンバーが商談の完了予定日(CloseDate)を過去の日付に変更できないようにしたいと考えています。 管理者は、この要件を満たすために何を構成する必要がありますか。",
      choices: ["割り当てルール","承認プロセス","項目レベルセキュリティ","入力規則"],
      answers: [3],
      explanation: `入力規則を使用すると、ユーザーが項目に入力するデータが特定の条件を満たすことを要求できます。このケースでは、管理者は入力規則を構成して、商談の日付項目が現在の日付より前に設定されることを禁止する規則を設定できます。このルールにより、ユーザーが過去の日付を入力しようとした場合にエラーメッセージが表示され、保存がブロックされます。
        ※ 割り当てルールは、リードやケースなどのレコードをユーザーやキューに自動的に割り当てるために使用されます。これは日付の変更を制限する目的には適していません。
        ※ 承認プロセスは、レコードが特定の基準を満たした場合に承認を必要とするプロセスを定義します。これは特定の項目の値を条件に設定できますが、商談の日付を過去に変更する操作そのものを直接防ぐものではありません。
        ※ 項目レベルセキュリティは、特定の項目へのアクセスを制御しますが、項目の値が過去の日付に設定されること自体を防ぐものではありません。アクセス制御を提供するだけで、値の変更ロジックを定義するものではありません。`
    },
  {
      id: 9,
      category: "セールス&マーケティングアプリケーション",
      source: "tysonblog 第9問",
      question: "Universal Containers社のユーザーは、商談ページで販売フェーズを視覚的に確認したいと考えています。管理者は商談にパスを設定しています。パスの構成で重要な考慮事項はどれですか。",
      choices: ["所有者項目は[重要な項目]パネルで編集できます。","[お祝い]はパスに追加できません。","パスのKanban ビューは手動で設定する必要があります。","パスは各フェーズの[ガイダンス]と[重要な項目]を含むことができます。"],
      answers: [3],
      explanation: `パス機能を使用すると、管理者は各フェーズに具体的なガイダンスを提供し、それに加えて重要な項目をハイライト表示できます。これにより、ユーザーがプロセスの各段階で何をすべきかを明確に理解でき、効率的に業務を進めることができます。
        ※ [重要な項目]パネルでは、一般的な項目の情報を編集できますが、所有者項目やレコードタイプのような特定のシステム項目は編集できません。
        ※ Salesforce Lightning Experienceでは、特定のフェーズが完了した際に表示されるお祝いのアニメーションをパスに追加することができます。これはユーザーにとって肯定的なフィードバックを提供し、モチベーション向上につながります。
        ※ パスはプロセスガイダンスを提供し、Kanban ビューはレコードの視覚的整理に使われます。[重要な項目]と[ガイダンス]およびお祝いはKanban ビューにも表示されるため、手動で設定する必要はありません。`
    },
  {
      id: 10,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第10問",
      question: "Cloud Kicks社の管理者は、ユーザーが1つのレコードで複数のスタイルを選択できないように、会社の靴スタイル項目のデータ型を変更するよう依頼されました。これを達成するために管理者が行うべき手順はどれですか。2つ選びなさい。",
      choices: ["項目のデータ型を変更した後、適切な靴スタイルの値を再度有効にする。","[選択リスト]項目で[値を1つだけ選択する]チェックボックスをオンにする。","既存のレコードの靴スタイル値をバックアップする。","項目のデータ型を選択リスト (複数選択)項目から選択リスト項目に変更する。"],
      answers: [2,3],
      explanation: `データ型を変更する前に、既存のレコードデータをバックアップすることは、万が一のデータ損失に備えて重要です。特に、複数選択リストから単一選択リストへの変更では、データが失われる可能性があるためバックアップは必須です。
        ユーザーが1つのレコードで複数のスタイルを選択できないようにするには、項目のデータ型を「選択リスト (複数選択)」から単一の「選択リスト」に変更する必要があります。これにより、ユーザーはリストから1つの値のみ選択可能になります。
        ※ カスタム項目に「有効」という属性は存在しません。データ型を変更する際には、新しいデータ型に合わせて適切な値を設定する必要がありますが、これは値の再設定や更新というべきであり、項目自体を有効化するわけではありません。
        ※ Salesforceで選択リスト項目に「値を1つだけ選択する」チェックボックスは存在しません。ユーザーが1つの値のみ選択できるように制限するには、単一選択の選択リスト項目を使用する必要があり、これはデータ型を「選択リスト (複数選択)」から単一の「選択リスト」に変更することで実現できます。`
    },
  {
      id: 11,
      category: "自動化",
      source: "tysonblog 第11問",
      question: "Ursa Major Solar社は、取引先をシルバー、ゴールド、プラチナレベルに分類しています。シルバーまたはゴールドの取引先に新しいケースが作成されると、通常のサポートキューに入ります。取引先がプラチナレベルの場合、自動的に優先サポートキューに入ります。管理者はこれを実現するために何を使用すべきでしょうか。",
      choices: ["割り当てルール","ケースルール","エスカレーションルール","フロービルダー"],
      answers: [0],
      explanation: `割り当てルールを使用すると、特定の条件に基づいてケースを自動的に適切なキューに割り当てることができます。このシナリオでは、取引先のレベルに応じて、ケースを通常のサポートキューか優先サポートキューに振り分けるためにケースの割り当てルールが適用されます。
        ※ 「ケースルール」という機能はSalesforceには存在しません。ケースの割り当てや管理には割り当てルールやエスカレーションルールが利用されますが、「ケースルール」という名前の機能はありません。
        ※ エスカレーションルールは、特定の時間内に解決されないケースをエスカレートする(未対応のケースを事前に割り当てられた別のチームまたは個人へ自動的に通知を送り、対応を促す)ために使用され、ケースの初期割り当てプロセスとは異なります。
        ※ ワークフロールールは条件が満たされた際に自動的なアクションを実行するために使用されますが、ケースの自動割り当てには適していません。このシナリオで必要なのは、条件に基づいてケースを特定のキューに直接割り当てる機能であり、ワークフロールールではこれを実現できません。`
    },
  {
      id: 12,
      category: "設定とセットアップ",
      source: "tysonblog 第12問",
      question: "ユーザーがUI(ユーザーインターフェース)を介してSalesforceにログインするとき、システムが認証のためにチェックする設定はどれですか。2つ選びなさい。",
      choices: ["ユーザーの[ユーザーインターフェースログインの多要素認証]権限","ユーザーの[API ログインの多要素認証]権限","ロールの[ログイン IP アドレスの制限]権限","ユーザーの[ログイン時間帯の制限]権限"],
      answers: [0,3],
      explanation: `ユーザーがUIを介してSalesforceにログインする際に多要素認証(MFA)を要求するものです。Salesforceは、すべてのユーザーに対してMFAの使用を義務付けており、この権限が有効化されている場合、ユーザーは標準のユーザー名とパスワード認証に加えて、認証アプリやセキュリティキーを使用した二次認証が必要となります。これにより、アカウントのセキュリティが強化されます。
        ユーザーのプロファイル設定における[ログイン時間帯の制限]は、ユーザーが特定の時間帯内でのみSalesforceにログインできるように制限します。これにより、設定された時間外のアクセスを防ぎ、セキュリティを強化します。ユーザーが設定された時間外にログインしようとすると、アクセスが拒否されます。
        ※ この権限はAPI経由でのログインに関係しており、ユーザーがUIを通じてSalesforceにログインする際の認証プロセスとは無関係です。UIログインとAPIログインは異なる認証プロセスであり、この権限はAPIを介したアクセスのセキュリティを強化するものです。
        ※ Salesforceでは、ログインIPアドレスの制限はプロファイルレベルで設定されます。ロールはユーザーのレコードアクセス権やレポートの可視性など、データアクセスの階層構造に影響を与える機能であり、ログインのIPアドレス制限とは関連がありません。`
    },
  {
      id: 13,
      category: "サービス&サポートアプリケーション",
      source: "tysonblog 第13問",
      question: "Cloud Kicks社のユーザーは、ケースページで自分のロールに役立つ情報を見たいと思っています。管理者はページをより動的に、より使いやすくするにはどうすればよいでしょうか。",
      choices: ["[レコードの詳細]コンポーネントから項目を削除する。","フィルタ付きの[タブ]コンポーネントを増やす。","ページから余分なコンポーネントを削除する。","コンポーネントで[コンポーネントの表示を設定]を設定する。"],
      answers: [3],
      explanation: `[コンポーネントの表示を設定]を設定することは、ユーザーのロールやプロファイルに基づいて特定の情報を動的に表示するための最適な方法です。この機能を使うことで、特定のユーザーに対して適切な情報を表示し、不要な情報を非表示にすることができます。これにより、ページはより動的かつ使いやすくなります。
        ※ [レコードの詳細]コンポーネントから項目を削除することは、ページをシンプルにすることはできますが、ユーザーのロールに役立つ情報を動的に表示するための方法ではありません。これにより、必要な情報が欠落する可能性があり、使いやすさが損なわれることもあります。
        ※ [タブ]コンポーネント自体には、直接フィルタを適用する機能はありません。[タブ]コンポーネントは、異なるページセクションやコンポーネントを整理しユーザーに表示するために使用されますが、そのタブ内のコンテンツをロールに基づいて動的に絞り込むわけではありません。
        ※ ページから余分なコンポーネントを削除することは、ページをシンプルにし、使いやすくする手段ですが、ユーザーのロールに応じた情報の動的な表示には直接関係しません。シンプルさは重要ですが、動的な表示設定を行うことが求められます。`
    },
  {
      id: 14,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第14問",
      question: "Cloud Kicks社では、リードソースが選択されている場合にのみ、商談が成立(Closed Won)したフェーズを選択できるようにしたいと考えています。管理者はこの目標をどのように達成すべきですか。",
      choices: ["連動選択リストを設定し、リードソース項目をフェーズ項目の連動項目に設定する。","フェーズがClosed Wonに設定されている場合のみ、リードソースを要求する入力規則を設定する。","ページレイアウトでフェーズ項目を読み取り専用に変更する。","連動選択リストを設定し、フェーズ項目をリードソース項目の連動項目に設定する。"],
      answers: [1],
      explanation: `入力規則を使用して、商談のフェーズが「Closed Won」に設定される条件下でリードソースが入力されていなければエラーを表示するように設定できます。これにより、リードソースが未入力の場合は商談を「Closed Won」に更新できないように制約を設けることができます。
        ※ フェーズとリードソースは標準選択リスト項目であり、標準選択リスト項目は連動項目に設定することはできません。そのため、この方法では要件を満たすことはできません。
        ※ ページレイアウトでフェーズ項目を読み取り専用にすると、ユーザーはその項目を編集できなくなり、フェーズの変更自体ができなくなります。この設定では、特定の条件下でフェーズを変更できるようにする要件を満たせません。
        ※ フェーズとリードソースは標準選択リスト項目であり、標準選択リスト項目は連動項目に設定することはできません。そのため、この方法では要件を満たすことはできません。`
    },
  {
      id: 15,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第15問",
      question: "Cloud Kicks社のマーケティングチームは、キャンペーンを使用して商品への関心を喚起しています。現在、管理者に値の追加や削除を依頼していますが、これには非常に時間がかかります。マーケティングチームがキャンペーンメンバーの状況項目の選択リスト値を自分でカスタマイズできるようにするには、どのユーザー権限を設定すればよいですか。2つ選びなさい。",
      choices: ["[キャンペーン]オブジェクトの編集権限","[マーケティングユーザー]機能ライセンス","[アプリケーションのカスタマイズ]権限","[キャンペーンメンバー]オブジェクトの作成と編集権限"],
      answers: [0,1],
      explanation: `キャンペーンメンバーの状況を作成、編集、削除するためには、キャンペーンオブジェクトに対する「参照」および「編集」権限が必要です。これにより、キャンペーンメンバーの状況選択リスト値を管理できます。
        [マーケティングユーザー]機能ライセンスを持つユーザーは、キャンペーンメンバーの状況選択リストを編集できるようになります。このライセンスは、キャンペーンに関連するさまざまな管理機能を提供します。
        ※ [アプリケーションのカスタマイズ]権限は広範なカスタマイズを可能にしますが、キャンペーンメンバーの状況項目の選択リスト値をカスタマイズするために必要ではありません。
        ※ キャンペーンメンバーオブジェクトに個別の権限は存在せず、キャンペーンメンバーの権限はキャンペーンオブジェクトの権限で管理されます。`
    },
  {
      id: 16,
      category: "セールス&マーケティングアプリケーション",
      source: "tysonblog 第16問",
      question: "Cloud Kicks社のサポートユーザーチームは、内部営業担当者がオンラインから関心を示した見込み客にフォローアップ電話をかけるのを支援しています。現在、チームはリードオブジェクトにアクセスできません。管理者はどのように適切なアクセスを提供すべきですか。",
      choices: ["新しいプロファイルを作成する。","新しいロールを割り当てる。","手動共有を設定する。","権限セットを設定する。"],
      answers: [3],
      explanation: `権限セットを使用すると、既存のプロファイルに追加のアクセス権限を付与できます。これにより、サポートユーザーチームがリードオブジェクトにアクセスできるようにするための権限を簡単に追加することができます。権限セットは柔軟で、特定のユーザーグループに対して追加の権限を付与するために適しています。
        ※ 新しいプロファイルを作成することでリードオブジェクトへのアクセスを提供できますが、既存のプロファイルを変更することでも同じ結果を得られるため、新しいプロファイルを作成する必要はありません。プロファイルの作成は手間がかかり、管理が煩雑になる可能性があります。
        ※ ロールはレコードレベルのアクセス制御に使用されますが、オブジェクトレベルのアクセス権限を付与するものではありません。
        ※ 手動共有は特定のレコードを個別に共有するためのものであり、リードオブジェクト全体へのアクセスを提供するのには適していません。`
    },
  {
      id: 17,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第17問",
      question: "Cloud Kicks社は、靴のデザインを商品ごとに追跡したいと考えています。靴のデザインは削除できないようにする必要があり、さまざまな段階にわたって1つの商品に複数のデザインが存在する可能性があります。この要件を満たすために、管理者はどのステップを構成する必要がありますか。2つ選びなさい。",
      choices: ["靴のデザインオブジェクトに商品へのカスタム参照関係項目を作成する。","靴のデザインオブジェクトに商品へのカスタム主従関係項目を作成する。","標準オブジェクトをデザイン用のオブジェクトに使用する。","靴のデザイン用のカスタムオブジェクトを作成する。"],
      answers: [0,3],
      explanation: `カスタム参照関係を使用して、1つの商品に対して複数のデザインを関連付けます。参照関係では親レコード(商品)が削除されても子レコード(靴のデザイン)は削除されないため、デザインレコードの不必要な削除を防げます。さらに、プロファイルや権限セットで削除権限を制限し、削除制限の入力規則を設定することで、デザインレコードの意図しない削除を防ぐことができます。
        靴のデザインを商品ごとに追跡し、削除を防ぐためには、靴のデザイン用のカスタムオブジェクトを作成する必要があります。カスタムオブジェクトにより、デザインに関する特定の項目や関連を定義し、複数のデザインを効果的に管理できます。
        ※ 主従関係では、親オブジェクト(商品)が削除されると子オブジェクト(靴のデザイン)も削除されてしまいます。これにより、デザインが削除できないようにするという要件を満たせません。
        ※ 標準オブジェクトは特定の目的のために設計されているため、デザイン追跡には適していません。デザイン追跡には、カスタムオブジェクトを使用することで、必要な属性や関連性を正確に定義できます。`
    },
  {
      id: 18,
      category: "設定とセットアップ",
      source: "tysonblog 第18問",
      question: "Universal Containers社は、より厳密なユーザーパスワードを要求することで、組織のセキュリティを向上させたいと考えています。管理者は、次のうちどれを設定する必要がありますか。2つ選びなさい。",
      choices: ["ユーザー名と異なるパスワード","一般的な単語の禁止","パスワードの複雑さ","パスワードの最低限の長さ"],
      answers: [2,3],
      explanation: `具体的には以下の項目が設定でき、今回の選択肢との関連性は以下の通りとなります。 パスワード文字列の制限:今回の選択肢の[パスワードの複雑さ]に該当します。最小パスワード長:今回の選択肢の[パスワードの最低限の長さ]に該当します。`
    },
  {
      id: 19,
      category: "サービス&サポートアプリケーション",
      source: "tysonblog 第19問",
      question: "DreamHouse Realty社(DR)の管理者は、[メールを送信]クイックアクションをケースページのレイアウトに追加しました。クイックアクションが期待通りに表示されるようにするには、どの機能を有効にする必要がありますか。",
      choices: ["メール通知","メール-to-ケース","メールアラート","メールテンプレート"],
      answers: [1],
      explanation: `メール-to-ケースを有効にすることで、ケースオブジェクトで「メールを送信」クイックアクションが使用可能になります。これにより、エージェントはケースフィードから直接メールを送信できるようになります。
        ※ Salesforceには「メール通知」という具体的な機能は存在しません。
        ※ メールアラートは、ワークフローやプロセスビルダーを使用して、特定の条件が満たされたときに通知メールを送信する機能です。クイックアクションとしてのメール機能を追加するための設定には関係ありません。
        ※ メールテンプレートは、統一された内容のメールを送信するために使用されますが、クイックアクションとしてメール機能を追加するための前提条件ではありません。`
    },
  {
      id: 20,
      category: "サービス&サポートアプリケーション",
      source: "tysonblog 第20問",
      question: "Cloud Kicks社(CK)には新しい管理者がおり、今後のライセンス購入の予算を立てるため、Salesforceの使用状況の詳細をメモにまとめるよう求められています。管理者は、CKが購入したライセンスの種類と使用可能数を確認するには、どこに行けばよいでしょうか。",
      choices: ["[設定]でライセンスの種類を検索する。","[組織情報]の[ユーザーライセンス]リスト","[組織情報]の[使用量ベースのエンタイトルメント]リスト","[設定]の[ユーザー管理設定]"],
      answers: [1],
      explanation: `[組織情報]の[ユーザーライセンス]リストでは、組織が購入したSalesforceのライセンスの種類とそれぞれのライセンスの利用可能数や使用中の数を確認できます。これにより、管理者は現在のライセンス使用状況を把握し、将来の購入計画に必要な情報を得ることができます。
        ※ [設定]ではライセンスの種類を直接検索する機能は提供されておらず、具体的なライセンスの種類や数量に関する情報を直接見ることはできません。
        ※ [使用量ベースのエンタイトルメント]リストは、会社で利用できるリソース情報を提供しますが、これはライセンスの総数や種類に関する直接的な情報源ではありません。
        ※ [ユーザー管理設定]では、ユーザーアカウントの設定やポリシーのカスタマイズなどが行えますが、これは組織が購入したライセンスの種類や利用可能数を確認する場所ではありません。`
    },
  {
      id: 21,
      category: "サービス&サポートアプリケーション",
      source: "tysonblog 第21問",
      question: "Cloud Kicks社の管理者は、サポートケースの作成方法に関係なく、ケースの優先順位に基づいてサポートケースを自動的にキューに割り当てる必要があります。管理者はどのツールを使用すべきですか。",
      choices: ["メール-to-ケース","Web-to-ケース","自動レスポンスルール","割り当てルール"],
      answers: [3],
      explanation: `割り当てルールは、定義された基準(この場合はケースの優先順位)に基づいて、サポートケースを自動的に適切なキューやユーザーに割り当てるために使用します。この機能により、管理者はケースの優先順位に基づいて自動的にキューにケースを割り当てることができます。
        ※ メール-to-ケースは、メールを通じてサポートケースを自動的に生成するための機能です。これはケースの作成を自動化しますが、作成されたケースの優先順位に基づいてキューに割り当てる機能は含まれていません。
        ※ Web-to-ケースは、ウェブサイト経由で受け取ったフォームの情報からサポートケースを自動的に生成するための機能です。この機能もケースの自動作成には役立ちますが、優先順位に基づいてキューに割り当てる機能は提供しません。
        ※ 自動レスポンスルールは、ケースやリードが生成された際に自動的に応答メールを送信するための機能です。この機能は顧客への初期応答を自動化するためのものであり、ケースの優先順位に基づいてキューに割り当てるためのものではありません。`
    },
  {
      id: 22,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第22問",
      question: "管理者が取引先オブジェクトにカスタムテキストエリア項目を作成し、サービスチームのページレイアウトに追加しました。サービスチームのマネージャーはこの項目の追加を気に入り、サービス担当者が取引先ページですぐに見つけられるように強調表示パネルに表示させたいと考えています。 管理者はこれをどのように実現すればよいでしょうか。",
      choices: ["ページレイアウトエディターから、項目を強調表示パネルにドラッグする。","新しいページレイアウトを作成し、強調表示パネルというタイトルの新しいセクションを作成する。","項目を必須にし、ページの一番上に移動する。","取引先のオブジェクトマネージャーで、カスタムコンパクトレイアウトを作成する。"],
      answers: [3],
      explanation: `強調表示パネルに表示される項目は、コンパクトレイアウトによって管理されます。取引先のオブジェクトマネージャーでカスタムコンパクトレイアウトを作成し、必要な項目を追加することで、その項目を強調表示パネルに表示させることができます。
        ※ 強調表示パネルに項目をドラッグする機能はありません。強調表示パネルに表示される項目は、コンパクトレイアウトで設定されます。この方法では、項目を強調表示パネルに表示させることはできません。
        ※ 新しいセクションを作成しても、それは通常のページレイアウトの一部となり、強調表示パネルとして機能しません。強調表示パネルは、コンパクトレイアウトによって制御されるため、カスタムセクションを作成しても代替にはなりません。
        ※ 項目を必須にしてページの一番上に移動しても、強調表示パネルには表示されません。これは、ユーザーが項目を見つけやすくする手段としては有効ですが、強調表示パネルの設定とは関係ありません。`
    },
  {
      id: 23,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第23問",
      question: "Universal Containers社の管理者は、2つの既存のカスタムオブジェクト間に多対多のリレーションシップを作成するように求められました。多対多のリレーションを有効にするとき、管理者が取るべき手順はどれですか。2つ選びなさい。",
      choices: ["新しいオブジェクトに2つの主従関係を作成する。","カスタムオブジェクトにURL項目を作成する。","カスタムオブジェクトで連結オブジェクトを作成する。","新しいオブジェクトに2つの参照関係を作成する。"],
      answers: [0,2],
      explanation: `Salesforceで多対多のリレーションシップを作成するためには、連結オブジェクトを作成し、その連結オブジェクトに対して2つの主従関係を設定します。これにより、両方のオブジェクトから連結オブジェクトを通じて多対多の関係を管理できます。
        多対多のリレーションシップを実現するためには、まず連結オブジェクトを作成する必要があります。この連結オブジェクトは、2つの主オブジェクトを関連付けるための中間オブジェクトとして機能します。
        ※ URL項目は特定のURLを保存するための項目であり、多対多のリレーションシップを作成するためには関係がありません。URL項目を作成しても、オブジェクト間のリレーションシップは確立されません。
        ※ Salesforceが定義する多対多リレーションシップは、連結オブジェクトと2つの主従関係を用います。２つの参照関係でも似たような構造になり得ますが、Salesforceが定義する連結オブジェクトではありません。`
    },
  {
      id: 24,
      category: "設定とセットアップ",
      source: "tysonblog 第24問",
      question: "Northern Trail Outfitters社は、取引先責任者を表示するために、組織で取引先責任者階層を使用したいと考えています。管理者は取引先責任者階層に関して何を考慮すべきですか。",
      choices: ["取引先責任者階層に表示される取引先責任者は、ユーザーによるレコードレベルのアクセスに制限されます。","階層の列をカスタマイズすると、[最近表示した取引先責任者]リストビューが変更されます。","共有設定は、取引先責任者階層に表示される取引先責任者では適用されません。","取引先責任者階層が一度に表示できる取引先責任者は3,000件までです。"],
      answers: [0],
      explanation: `取引先責任者階層に表示される取引先責任者のレコードは、ユーザーのレコードレベルのアクセス権に基づいて制限されます。ユーザーがアクセス権を持っていない取引先責任者は、階層に表示されません。
        ※ 取引先責任者階層の列をカスタマイズしても、[最近表示した取引先責任者]リストビューには影響しません。階層のカスタマイズは、階層ビュー自体にのみ影響を与えます。
        ※ 取引先責任者階層にも共有設定が適用されます。共有設定は、ユーザーがアクセス権を持つレコードのみに適用され、アクセス権のない取引先責任者は階層に表示されません。
        ※ Lightning Experience では、取引先責任者階層ページに最大2,000件の取引先が表示されます。3,000件という制限は誤りです。`
    },
  {
      id: 25,
      category: "サービス&サポートアプリケーション",
      source: "tysonblog 第25問",
      question: "DreamHouse Realty社(DR)の管理者は、エージェントの能力とスキルセットに基づいてケースを割り当てる簡単な方法を求めています。この要件を満たすために、管理者はどの機能を有効にする必要がありますか。",
      choices: ["エスカレーションルール","オムニチャネル","テリトリー管理","ナレッジマネジメント"],
      answers: [1],
      explanation: `オムニチャネルは、エージェントのスキルセットや能力に基づいてケースを自動的に割り当てる機能です。オムニチャネルを使用すると、エージェントの現在の作業負荷やスキルに応じてリアルタイムでケースを適切なエージェントに割り当てることができます。これにより、エージェントのスキルや能力に応じた最適なケース割り当てが実現されます。
        ※ エスカレーションルールは、特定の時間が経過した後に解決されていないケースをエスカレートするために使用されます。エージェントの能力やスキルセットに基づいてケースを割り当てる機能はありません。
        ※ セールスチームが地理的エリアや市場セグメントに基づいて取引先やリードを管理するための機能です。これは、エージェントのスキルセットに基づいたケース割り当てには直接関係しません。
        ※ Salesforceに「ナレッジマネジメント」という機能はなく、「Lightning Knowledge」が正しい名称です。Essentials Edition および Unlimited Editionで使用でき、知識ベース管理を提供します。`
    },
  {
      id: 26,
      category: "データ管理&分析",
      source: "tysonblog 第26問",
      question: "Northern Trail Outfitters社ではケースオブジェクトを非公開に設定しています。サポートマネジャーは、担当者が予想以上に幅広い参照権限を持ち、グループのダッシュボード上のすべてのケースを見ることができるという懸念を示しました。担当者がダッシュボードのデータに不適切にアクセスできる原因は何でしょうか。",
      choices: ["ダッシュボードのフィルター","ダッシュボードの登録","ダッシュボードの実行ユーザー","公開ダッシュボード"],
      answers: [2],
      explanation: `ダッシュボードの実行ユーザーは、そのダッシュボードを見る際に、どのユーザーのセキュリティ設定を使ってデータにアクセスするかを決定します。実行ユーザーに広範なアクセス権限がある場合、ダッシュボードはその権限に基づいてデータを表示し、担当者が見るべきではないデータも表示される可能性があります。
        ※ ダッシュボードのフィルターは、既存のダッシュボードのデータを限定するために使われます。フィルターを通じてユーザーが見れる範囲を絞ることができますが、担当者により多くのデータへのアクセスを与えるわけではありません。
        ※ ダッシュボードの登録は、ダッシュボードの自動更新をユーザーが受け取る機能です。これはユーザーが見ることができるデータの範囲を拡大するものではなく、アクセスできるデータに基づいて通知を受け取るためのものです。
        ※ 公開ダッシュボードは組織内の全ユーザーがダッシュボードを見ることを可能にしますが、それ自体がケースの各データへのアクセス権を変更するものではありません。ユーザーが見ることができるデータは実行ユーザーのセキュリティ設定に依存します。`
    },
  {
      id: 27,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第27問",
      question: "Cloud Kicks社の管理者は、ユーザーがSalesforceに定期的なToDoを追加できないということを報告されました。ユーザーが定期的なToDoを追加できるようにするために、管理者が使用するソリューションはどれですか。2つ選びなさい。",
      choices: ["[活動設定]で[定期的な ToDo の作成の有効化]をオンにする。","[Shared Activities]を無効にする。","ページレイアウトに[定期的なToDoを作成]項目を追加する。","[ToDo 通知]を有効化する。"],
      answers: [0,2],
      explanation: `Salesforceでは、[活動設定]内の[定期的な ToDo の作成の有効化]オプションをオンにすることで、ユーザーが繰り返し発生するToDoを作成できるようになります。
        [定期的な ToDo を作成]項目をToDoのページレイアウトの[ToDo の詳細]セクションに追加する必要があります。これにより、ユーザーが定期的なToDoを作成できるオプションが提供されます。
        ※ [Shared Activities]は、複数の取引先責任者とToDoを関連付けることを可能にする機能です。これを無効にしても、ユーザーが定期的なToDoを作成できるようにはなりません。
        ※ ToDoの通知を有効にすることは、ユーザーがToDoに関する通知を受け取ることを可能にしますが、これは定期的なToDoを作成する機能とは直接関連していません。`
    },
  {
      id: 28,
      category: "データ管理&分析",
      source: "tysonblog 第28問",
      question: "Cloud Kicks社は、契約金額項目にある金額に基づいて、取引先を小、中、大に分類するレポートを作成したいと考えています。この要求を満たすために、管理者はどの機能を使用する必要がありますか。",
      choices: ["検索条件ロジック","詳細行","グループ化","バケット列"],
      answers: [3],
      explanation: `バケット列は、数式やカスタム項目を作成せずにレポートのデータをカテゴリ別にグループ化するための機能です。契約金額に基づいて取引先を小、中、大に分類する場合、バケット列を使用して、金額の範囲ごとに取引先を自動的にグループ化できます。バケット列を作成する際に、異なる金額範囲に対応する複数のバケットを定義し、それぞれに該当する取引先をグループ化できます。
        ※ 検索条件ロジックは、レポートで複数の検索条件を組み合わせて使用するためのものです。条件を組み合わせて特定のレコードを絞り込む際に使いますが、契約金額に基づいて取引先を分類するための機能ではありません。
        ※ 詳細行はレポートの各レコードに関する詳細情報を表示するためのものです。契約金額に基づいて取引先を分類する機能ではありません。
        ※ グループ化はレポートのデータを特定の項目でまとめるためのものですが、契約金額に基づいて取引先を小、中、大に分類するためには適していません。`
    },
  {
      id: 29,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第29問",
      question: "DreamHouse Realty社(DR)のブローカーは、取引先責任者のレコードを参照する際に、1つまたは複数のケースに関する特定の情報を確認する必要があります。このレコードのケース名、ケースID、顧客名、原因、状況、オープン日時です。管理者が設定で行うべき変更はどれですか。2つ選びなさい。",
      choices: ["ページレイアウトエディターを使用して、関連リスト種別を拡張リストに変更する。","[Lightning アプリケーションビルダー]で関連リストコンポーネントを編集し、関連リスト種別として[基本リスト]を選択する。","[Lightning アプリケーションビルダー]で関連リストコンポーネントを編集し、関連リスト種別として[拡張リスト]を選択する。","ページレイアウトエディターを使用して、ケースの関連リストに適切な列を含める。"],
      answers: [2,3],
      explanation: `Lightning アプリケーションビルダー内で関連リストコンポーネントを編集し、拡張リストを選択することで、10行までと、基本リストよりも多くの列を表示させることができます。これにより、標準のリストビューで表示される情報を超えて、ブローカーが必要とする項目を含む関連リストを取引先責任者レコードページ上で提供できます。
        ページレイアウトエディターを使用してケース関連リストをカスタマイズすることで、ブローカーが見たいと考えている特定の項目を関連リストに追加できます。この作業を行うことで、ケース名、ケースID、顧客名、原因、状況、オープン日時などの情報をリスト内に表示することが可能になります。
        ※ ページレイアウトエディターでは、関連リストに表示する列を選択することはできますが、関連リストの「種別」を「拡張リスト」に変更するというオプションは存在しません。
        ※ ブローカーが必要とする特定の情報が多数含まれているため、基本リストではなく拡張リストを使用する必要があります。基本リストでは表示できるは4つまでと情報が限られており、必要なすべての項目を表示するには不十分です。`
    },
  {
      id: 30,
      category: "データ管理&分析",
      source: "tysonblog 第30問",
      question: "Cloud Kicks社のマーケティングユーザーは、変換したリードを表示および編集できる必要があります。管理者は彼らに「取引開始済みのリードを表示および編集」権限を割り当てました。今、マーケティングユーザーが編集のために変換したリードにアクセスする方法はどれですか。2つ選びなさい。",
      choices: ["グローバル検索結果から見つける。","ホームページの最近のレコードコンポーネントを検索する。","リードの状況が[Qualified]であるリストビューを利用する。","データインポートウィザードを使用する。"],
      answers: [0,1],
      explanation: `グローバル検索を使用すると、変換されたリードも含めてSalesforce内のすべてのレコードを検索できます。ユーザーが「取引開始済みのリードを表示および編集」権限を持っている場合、グローバル検索結果から変換されたリードを見つけてアクセスすることができます。
        ホームページの[最近のレコード]コンポーネントには、取引開始済みで取引先、取引先責任者、商談に変換済みのリードも表示されます。これにより、ユーザーは変換されたリードを見つけてアクセスすることができます。
        ※ リードが変換されると、取引先、取引先責任者、商談などに変換されるため、リードのリストビューには表示されません。リストビューを利用して変換されたリードを表示することはできません。
        ※ データインポートウィザードは、Salesforce オブジェクトのデータのインポートを行うツールであり、既存のレコードを検索してアクセスするためのものではありません。`
    },
  {
      id: 31,
      category: "自動化",
      source: "tysonblog 第31問",
      question: "AW Computing社 は、リードオブジェクトにMarket Segmentという新しいカスタムテキスト項目を追加しました。リードが変換されるとき、新しい項目が取引先レコードにコピーされません。リードのMarket Segment項目が、変換された取引先レコードにコピーされるようにするには、管理者はどうすればよいですか。",
      choices: ["リードのMarket Segment項目が取引先の正しい項目に対応付けされていることを確認する。","取引先に、新しいリード項目とまったく同じ名前の項目があることを確認する。","取引先にその項目の値があることを確認する入力規則を作成する。","カスタム項目をリードから取引先にコピーするレコードトリガフローを作成する。"],
      answers: [0],
      explanation: `リードのカスタム項目を取引開始後の取引先、取引先責任者、または商談のカスタム項目に対応付けすることで、リードが変換された際にこれらの情報が適切なレコードにコピーされます。このプロセスは、リードのオブジェクト管理設定内、[項目とリレーション]の[リードの項目の対応付け]セクションで行うことができます。
        ※ リードと取引先(または取引先責任者、商談)の間で項目を対応付ける際、項目の名前が同じである必要はありません。重要なのは、リードのカスタム項目を適切な取引先のカスタム項目に対応付けることです。名前の一致ではなく、対応付けが正しく設定されているかがポイントです。
        ※ リードが変換される際に特定のカスタム項目の値を取引先レコードにコピーするために入力規則を作成する必要はありません。この要件はリードのカスタム項目と取引先のカスタム項目の対応付けによって管理されます。
        ※ リードのカスタム項目を取引先にコピーするためにフローを作成する必要はありません。Salesforceでは、リードのカスタム項目と取引先(または取引先責任者、商談)のカスタム項目を対応付ける機能が既に用意されており、この機能を使用することでリード変換時に情報が適切に移行されます。`
    },
  {
      id: 32,
      category: "データ管理&分析",
      source: "tysonblog 第32問",
      question: "モバイルナビゲーションメニューで利用可能なナビゲーション項目はどれですか。3つ選びなさい。",
      choices: ["Chatter","ユーティリティバー","Lightning ホームページ","ダッシュボード","Lightning アプリケーションページ"],
      answers: [0,3,4],
      explanation: `モバイルナビゲーションメニューで利用可能なナビゲーション項目はChatter、ダッシュボード、Lightning アプリケーションページ(Lightning ページ)です。ユーティリティバーはデスクトップのLightning Experience専用であり、モバイルアプリケーションには表示されないため不正解です。また、Lightning ホームページはモバイルアプリケーションで直接ナビゲーションメニュー項目として利用する設定の選択肢には含まれていないため不正解です。`
    },
  {
      id: 33,
      category: "セールス&マーケティングアプリケーション",
      source: "tysonblog 第33問",
      question: "Ursa Major Solar社の営業担当者は、案件の管理に苦労しています。リーダーシップチームは、営業担当者が優先順位をつけ、より多くの案件を獲得できるよう、管理者に依頼しました。管理者は何をすればより多くの案件を獲得できるでしょうか。",
      choices: ["Einstein 活動キャプチャ","Einstein Searchのパーソナライゼーション","Einstein リードスコアリング","Einstein 商談スコアリング"],
      answers: [3],
      explanation: `Einstein 商談スコアリングは、商談の成功確率を評価し、どの商談に重点を置くべきかを営業担当者に示す機能です。これにより、営業担当者は高確率で成立する商談に集中でき、効果的に優先順位をつけることができます。これが営業担当者がより多くの案件を獲得するために役立ちます。
        ※ Einstein 活動キャプチャは、Salesforceとメールやカレンダーアプリケーション間のデータを同期し、生産性を向上させるツールです。これにより、メール、行動、取引先責任者のデータが自動的に最新の状態に保たれますが、案件の優先順位付けや獲得には直接関与しません。
        ※ Einstein Searchのパーソナライゼーションは、検索結果を個々のユーザーに対して最適化し、作業時間を短縮する機能です。しかし、案件の管理や優先順位付けには直接役立ちません。
        ※ Einstein リードスコアリングは、リードの品質を評価し、高品質なリードに優先順位をつけるための機能です。リードの管理には役立ちますが、案件(商談)の管理には直接役立ちません。`
    },
  {
      id: 34,
      category: "設定とセットアップ",
      source: "tysonblog 第34問",
      question: "潜在的なセッションの脆弱性を特定し、修正するために管理者が使用すべきツールはどれですか。",
      choices: ["セキュリティ状態チェック","項目監査履歴","設定変更履歴の参照","組織全体のデフォルト"],
      answers: [0],
      explanation: `セキュリティ状態チェックは、Salesforce組織のセキュリティ設定を評価し、脆弱性を特定するためのツールです。セッション設定やパスワードポリシー、ネットワークアクセス設定など、組織のセキュリティ状態を総合的に評価し、改善点を提案します。これにより、潜在的なセッションの脆弱性を特定し、修正することができます。
        ※ 項目監査履歴は、特定の項目の変更履歴を追跡するためのツールです。セッションの脆弱性とは直接関係がありません。
        ※ 設定変更履歴の参照は、Salesforce組織内で行われた設定変更の履歴を確認するためのツールです。セッションの脆弱性の特定や修正には直接関与しません。
        ※ 組織全体のデフォルトは、オブジェクトのレコードに対するデフォルトの共有設定を管理するための機能です。これもセッションの脆弱性の特定や修正には直接関与しません。`
    },
  {
      id: 35,
      category: "自動化",
      source: "tysonblog 第35問",
      question: "Northern Trail Outfitters社は、カスタムオブジェクトのInvoiceを使用して、外部の請求システムから顧客の支払い情報を収集します。すべてのInvoiceレコードにBilling System項目が必要です。管理者は、この要件をどのように満たす必要がありますか。",
      choices: ["この項目を必須項目にする。","この項目を設定するレコードトリガーフローを作成する。","この項目を設定する承認プロセスを作成する。","レコードタイプに項目を設定する。"],
      answers: [0],
      explanation: `必須項目に設定することで、すべてのInvoiceレコードにおいてBilling System項目が必ず入力されるようになります。これにより、管理者はBilling System項目が必須であるという要件を満たすことができます。
        ※ プロセスビルダーは特定の条件が満たされたときに自動アクションを実行するツールです。しかし、Billing System項目を必須とするためにはプロセスビルダーではなく、項目自体を必須に設定する必要があります。
        ※ 承認プロセスは、レコードが特定の条件を満たしたときに承認を必要とするワークフローです。Billing System項目を必須にするために承認プロセスを作成するのは適切ではありません。
        ※ レコードタイプは異なるビジネスプロセスやページレイアウトをサポートするために使用されます。Billing System項目を必須にするためには、レコードタイプを設定するのではなく、項目自体を必須に設定する必要があります。`
    },
  {
      id: 36,
      category: "データ管理&分析",
      source: "tysonblog 第36問",
      question: "Ursa Major Solar社のコールセンターマネージャーは、ケースの発生源、状況、所有者別に掘り下げて表示できるケースダッシュボードをエージェントに提供したいと考えています。この要求を満たすために、管理者はダッシュボードに何を追加する必要がありますか。",
      choices: ["ダッシュボードフィルター","ダッシュボードコンポーネント","バケット列","組み合わせグラフ"],
      answers: [0],
      explanation: `ダッシュボードフィルターは、ダッシュボード全体に適用できるフィルターで、特定の条件に基づいてデータを絞り込むことができます。これにより、エージェントはケースの発生源、状況、所有者別に簡単にデータをフィルタリングして掘り下げることができます。複数のフィルターを設定することで、エージェントは必要な情報に迅速にアクセスできるようになります。
        ※ ダッシュボードコンポーネントは、ダッシュボードの各種グラフやチャート、テーブルなどの表示要素ですが、個々のデータ表示には役立ちますが、フィルタリング機能を提供するものではありません。ケースの発生源、状況、所有者別に掘り下げるためには、フィルター機能が必要です。
        ※ バケット列は、レポート内で特定の条件に基づいてデータをグループ化する機能ですが、ダッシュボード自体に直接追加する要素ではありません。バケット列を用いてデータを整理したレポートはダッシュボードコンポーネントとして組み込むことができますが、バケット列自体をダッシュボードに追加することはできません。
        ※ 組み合わせグラフは、レポートのデータを視覚的に表現するためのツールで、複数のデータセットを一つのグラフ上に表示し、比較することができます。例えば、縦棒グラフに折れ線グラフを追加して、異なる種類のデータを一緒に表示することができます。`
    },
  {
      id: 37,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第37問",
      question: "Cloud Kicks社では、セールスユーザーとマーケティングユーザーで異なる選択リストの値を表示できる必要があります。この要件を満たすオプションはどれですか。2つ選びなさい。",
      choices: ["1つのページレイアウト、2つのレコードタイプ、1つの選択リスト","2つのページレイアウト、1つのレコードタイプ、2つの選択リスト","2つの権限セット、1つのレコードタイプ、1つの選択リスト","1つのレコードタイプ、2つのプロファイル、1つの選択リスト"],
      answers: [0,1],
      explanation: `レコードタイプを使用することで、同一オブジェクト内で異なる選択リストの値を定義できます。この場合、セールスユーザーとマーケティングユーザーがアクセスするそれぞれのレコードタイプで、同一の選択リストを使用しつつも異なる選択リストの値を提示することが可能になります。
        異なるページレイアウトを設定し、それぞれに異なる選択リストを追加することで、ユーザーによって異なる選択肢を提供することができます。ただし、この方法は管理の複雑性が増し、データの一貫性を維持する上で課題が伴う可能性があるため、推奨されるベストプラクティスではありません。
        ※ 権限セットはユーザーに追加の権限やアクセス権を提供するためのものであり、選択リストの値を制御するためには使用できません。
        ※ プロファイルはユーザーのアクセス権を定義するもので、直接的には選択リストの値をユーザーグループ別に制御するためには使用されません。`
    },
  {
      id: 38,
      category: "生産性向上とコラボレーション",
      source: "tysonblog 第38問",
      question: "可視性がSalesforceモバイルアプリに限定されているLightningアプリで利用できるナビゲーション項目はどれですか。",
      choices: ["ホームページ","Today","お気に入り","ユーティリティバー"],
      answers: [1],
      explanation: `モバイルナビゲーションメニューで利用可能なナビゲーション項目はTodayです。Todayは、モバイルカレンダーの行動、ToDo、取引先、取引先責任者を統合し、1日のスケジュール管理をサポートします。ユーザーはカンファレンスコールやメモの記録が簡単に行えます。他の選択肢の項目はモバイルアプリケーションで直接ナビゲーションメニュー項目として利用する設定の選択肢には含まれていないため不正解です。`
    },
  {
      id: 39,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第39問",
      question: "Cloud Kicks社には出荷というカスタムオブジェクトがあります。この会社は取引先ページからすべての出荷アイテムを見たいのです。取引先が削除されても、出荷情報は残っていなければなりません。管理者は、出荷と取引先との間にどのようなリレーションを作成する必要がありますか。",
      choices: ["出荷には、取引先に対する主従関係が必要です。","取引先には、出荷に対する参照関係が必要です。","取引先には、出荷に対する主従関係が必要です。","出荷には、取引先に対する参照関係が必要です。"],
      answers: [3],
      explanation: `参照関係では、親レコードが削除されても子レコード(この場合は出荷情報)は残ります。このシナリオで要求される条件を満たすためには、出荷オブジェクトに取引先オブジェクトへの参照関係を設定する必要があります。これにより、取引先ページから関連するすべての出荷アイテムを見ることができ、取引先が削除されても出荷情報は保持されます。
        ※ 主従関係では、主レコード(この場合は取引先)が削除されると従レコード(出荷)も自動的に削除されます。このシナリオでは、取引先が削除されても出荷情報が残る必要があるため、このリレーションシップは要件に合いません。
        ※ この表現はやや誤解を招く可能性がありますが、リレーションシップの設定方法としては不正確です。参照関係を作成する場合は、子側から行う必要があるため、親オブジェクト(取引先)から参照関係を作成するこの記載は適切ではありません。
        ※ このオプションも主従関係を指しており、主レコードが削除された場合に従レコードも削除されるため、要件に反します。また、取引先のような標準オブジェクトは従側になることはできません。さらに、1つの取引先に紐づく多数の出荷情報を持つリレーションシップの方向も間違っています。`
    },
  {
      id: 40,
      category: "自動化",
      source: "tysonblog 第40問",
      question: "管理者は、取引先責任者を更新するレコードトリガフローを作成しました。管理者は、フローが実行されているアクティブレコードの値をどのように参照すればよいですか。",
      choices: ["{!Contact.Id}グローバル変数を使用する。","{!Account.Id}レコード変数を使用する。","[レコードを取得]要素を使用してIdを検索する。","$Recordグローバル変数を使用する。"],
      answers: [3],
      explanation: `レコードトリガフローにおいて、フローがトリガーされた際にアクティブなレコードの値にアクセスするには$Recordグローバル変数を使用します。この変数は、フローが実行されているレコードのコンテキストを提供し、そのフィールドの値に直接アクセスすることを可能にします。
        ※ Salesforceのフロー内で{!Contact.Id}のような表現を使うことはできますが、これは特定のレコード変数を指しており、「グローバル変数」としては分類されません。
        ※ この変数はフローで定義された特定のレコード変数を指し、レコードトリガーフローで自動的に現在のレコードコンテキストを提供するものではありません。
        ※ レコードトリガフローでは、トリガーされたレコードの値に直接アクセスできるため、[レコードを取得]要素を使用する必要はありません。`
    },
  {
      id: 41,
      category: "自動化",
      source: "tysonblog 第41問",
      question: "管理者は、取引先の簡単な項目更新を自動化するよう依頼されました。サポートエージェントが取引先のステータス項目を「監査済み」に変更した場合、取引先の監査日項目を今日の日付で自動的に更新してほしいとのことです。この自動化を完了するために、管理者はどのツールを使用すべきでしょうか。",
      choices: ["フロービルダー","承認プロセス","数式項目","入力規則"],
      answers: [0],
      explanation: `フロービルダーを使用すると、条件に基づいてレコードを自動的に更新することができます。この場合、取引先のステータスが「監査済み」に変更されたときに、監査日項目を今日の日付で自動更新するためのフローを作成できます。フロービルダーは、Salesforceの自動化ツールとして強力で柔軟性があります。
        ※ 承認プロセスは、レコードが特定の基準を満たしたときに、一連の承認手順を要求するために使用されます。取引先のステータスが「監査済み」に変更されたときに自動的に監査日項目を更新するという要件には適していません。
        ※ 数式項目は、レコードの他の項目の値に基づいて計算された値を表示するために使用されます。数式項目は読み取り専用であり、値を動的に更新することはできません。この場合、監査日項目を今日の日付で自動的に更新するためには適していません。
        ※ 入力規則は、レコードの保存時に特定の条件が満たされることを強制するために使用されます。入力規則は値の設定や更新を行うものではなく、特定の条件が満たされない場合にエラーメッセージを表示して保存を防ぐためのものです。`
    },
  {
      id: 42,
      category: "データ管理&分析",
      source: "tysonblog 第42問",
      question: "ダッシュボードのレポートをクリックしてレポートの詳細を表示すると、レポートの値とダッシュボードに表示される値が異なることにユーザーが気づきました。このような現象が発生する理由は何でしょうか。2つ選びなさい。",
      choices: ["レポートを更新する必要がある。","ダッシュボードを更新する必要がある。","現在のユーザーはレポートフォルダにアクセスできない。","ダッシュボードの実行ユーザーと閲覧者の権限が異なる。"],
      answers: [1,3],
      explanation: `ダッシュボードは一定の時間ごとにキャッシュされたデータを表示します。レポートのデータが最新であっても、ダッシュボードが古いデータを表示している場合があります。ダッシュボードを手動で更新することで、最新のデータが表示されるようになります。
        ダッシュボードの実行ユーザーの設定により、ダッシュボードのデータは実行ユーザーの権限に基づいて表示されます。一方、レポートの詳細を表示するユーザーの権限により、表示されるデータが異なる場合があります。この権限の違いにより、レポートとダッシュボードの値が異なることがあります。
        ※ ダッシュボードはレポートのデータを基にして表示されますが、キャッシュされたデータを使用するため、レポートのデータが最新であるにもかかわらず、ダッシュボードが古いデータを表示することがあります。逆に、レポートのデータが古く、ダッシュボードが最新であるケースは論理的にあり得ません。
        ※ ユーザーがレポートフォルダにアクセスできない場合、そもそもレポートの詳細を表示することができません。このシナリオでは、ユーザーがレポートの詳細を表示できているため、この選択肢は当てはまりません。`
    },
  {
      id: 43,
      category: "データ管理&分析",
      source: "tysonblog 第43問",
      question: "Cloud Kicks社は、靴オブジェクトの組織全体のデフォルトを非公開に設定しています。営業マネージャーは、チーム内の営業担当者全員の靴のレコードを含むレポートを表示できる必要があります。レポートへの適切なアクセスを提供するために、管理者が構成すべき項目はどれですか。3つ選びなさい。",
      choices: ["フォルダアクセス","項目レベルセキュリティ","レポートの登録","カスタムレポートタイプ","ロール階層"],
      answers: [0,3,4],
      explanation: `レポートフォルダのアクセス権を管理することで、特定のユーザーやグループにレポートへのアクセスを許可することができます。営業マネージャーがレポートを見るためには、そのレポートが格納されているフォルダにアクセス権がある必要があります。
        カスタムレポートタイプを作成することで、管理者は営業担当者がアクセスできるレコードを基にしたレポートを定義できます。カスタムレポートタイプ自体はアクセス権を拡張するものではありませんが、既存のアクセス権に基づいたレポートを作成するためのツールを提供します。これにより、営業マネージャーが必要な情報を包括的にレポートで表示できます。
        Salesforceにおけるロール階層を使用すると、それぞれのロールに割り当てられたユーザーは、自分のロールの下に位置するユーザーのデータにアクセスできます。これにより、営業マネージャーは、自分が管轄する営業担当者が持つ「非公開」の靴オブジェクトのレコードを見ることが可能になり、必要なレポートに対して適切なレベルのデータアクセスを確保できます。
        ※ 項目レベルセキュリティは、個々の項目へのアクセスを制御しますが、レポートが表示するレコード自体のアクセスを直接制御するものではありません。このシナリオでは、営業マネージャーが全員のレコードを見る必要があるため、レコードレベルでの共有設定を検討する必要があります。
        ※ レポートの登録は、レポートを特定のユーザーやグループに定期的に送信するための機能であり、レポートへのアクセス権を管理するものではありません。レポートのデータを定期的に受け取るためのスケジュールや通知を設定するために使用されます。レポートの登録は、レポート自体の閲覧権限の設定には関与しません。`
    },
  {
      id: 44,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第44問",
      question: "Ursa Major Solar社のサポートチームは、ケースのホームページで分割ビューを使用することを望んでいます。時々、チームは別のサポートアプリケーションから出荷情報を表示する場合があります。チームが分割リストビューを使用できるようにするには、管理者は何を設定すればよいですか。",
      choices: ["アプリのナビゲーションバーに「出荷」タブを追加する。","サポートユーザーにリストビューの管理権限を追加する。","分割ビューは標準オブジェクトでのみ使用できる。","リストビューで単一の出荷レコードタイプで絞り込む。"],
      answers: [0],
      explanation: `分割ビューを使用するためには、該当オブジェクト(この場合は「出荷」)がナビゲーションバーに追加されている必要があります。ナビゲーションバーに「出荷」タブを追加することで、ユーザーは分割ビューを使用して出荷情報を表示できます。
        ※ リストビューの管理権限を持つことでリストビューの作成や編集は可能になりますが、分割ビューの使用自体を制御するものではありません。分割ビューはリストビューの表示形式の一つであり、特定の権限を持つ必要はありません。
        ※ 分割ビューは標準オブジェクトだけでなく、カスタムオブジェクトにも使用できます。したがって、出荷情報がカスタムオブジェクトであっても分割ビューは利用可能です。
        ※ リストビューを特定のレコードタイプで絞り込むことは、分割ビューの使用を制御するものではありません。`
    },
  {
      id: 45,
      category: "データ管理&分析",
      source: "tysonblog 第45問",
      question: "DreamHouse Realty社(DR)のユーザーは、自分が所有する商談しか見ることができません。経営陣は、パイプラインにあるすべてのオープンな商談を全社的なダッシュボードに表示し、ユーザーが会社の業績をいつでも確認できるようにしたいと考えています。管理者は、共有設定を変更せずに、どのようにダッシュボードを作成すればよいでしょうか。",
      choices: ["すべての商談を見ることができるユーザーとして、実行中のユーザーを設定してダッシュボードを作成する。","ダッシュボードのフォルダー設定を営業担当者のロールのマネージャーに更新する。","ダッシュボードにフィルターを追加し、所有者のロールで商談をフィルターする。","企業の結果を表示する必要があるプロファイル用に個別のダッシュボードを作成する。"],
      answers: [0],
      explanation: `実行中のユーザーをすべての商談を見ることができるユーザーに設定することで、そのユーザーの権限に基づいてダッシュボードが表示されます。これにより、他のユーザーが自分の権限では見えない商談データもダッシュボードを通じて閲覧することができます。共有設定を変更する必要がありません。
        ※ フォルダーのアクセス権を更新することは、ダッシュボードに表示されるデータの可視性には直接影響しません。フォルダの設定は、どのユーザーがダッシュボードを見ることができるかを決定しますが、ダッシュボードが表示するデータ自体の可視性を変更するものではありません。
        ※ ダッシュボードにフィルターを追加することは、特定の基準に基づいて表示データを絞り込む有効な手段ですが、ユーザーが元々アクセス権を持っていないデータにアクセスできるようはなり得ません。この方法では、元の共有設定に従ってアクセスできるデータのみが表示の対象となります。
        ※ プロファイルごとに個別のダッシュボードを作成することで、特定のグループに合わせた表示が可能になりますが、これはユーザーが他のユーザーのデータにアクセスできるようにはなりません。この方法では、依然として各ユーザーは自分が所有する商談のデータしか見ることができません。`
    },
  {
      id: 46,
      category: "設定とセットアップ",
      source: "tysonblog 第46問",
      question: "Cloud Kicks社(CK)は新しい販売アプリケーションを必要としています。管理者はAppExchangeにアプリケーションパッケージがあり、サンドボックスでテストを開始して、それがCKのニーズに対応しているかどうかを確認したいと考えています。管理パッケージをサンドボックスにインストールする際に考慮すべき点は何ですか。2つ選びなさい。",
      choices: ["パッケージのメタデータを変更した場合は、本番環境で再作成する必要がある。","インストールリンクをtest.salesforce.comに変更する必要がある。","[管理者のみのインストール]は、利用可能な唯一のインストールオプションです。","サンドボックスが更新されるたびにパッケージが削除される。"],
      answers: [1,3],
      explanation: `サンドボックス環境にパッケージをインストールする際には、インストールリンクをtest.salesforce.comに変更する必要があります。これにより、インストールがサンドボックス環境で正しく行われるようになります。
        サンドボックスの更新を行うと、サンドボックス内のAppExchangeパッケージは削除されます。これは、サンドボックスが本番環境からの新しいコピーで更新される際に、以前のサンドボックス環境の状態やデータがリセットされるためです。
        ※ 管理パッケージのメタデータは、パッケージの作成者によって制御されます。インストールされた管理パッケージ内のコンポーネントは、変更することはできません。
        ※ 「管理者のみのインストール」は一つのオプションに過ぎず、他にもインストールオプションが存在します。サンドボックスへのインストールにおいて、インストールオプションはパッケージによって異なりますが、一般的には管理者だけではなく、他のユーザーやプロファイルに対してもインストールオプションを選択できます。`
    },
  {
      id: 47,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第47問",
      question: "DreamHouse Realty社(DR)では、戸建てとコンドミニアムの両方の販売のために、定期的にオープンハウス(現地見学会)を開催しています。コンドミニアムのオープンハウスの場合、いくつか特別な手続きが必要です。代理店はリクエストを提出し、自治会から承認を受ける必要があります。管理者は、コンドミニアムのオープンハウス用レコードを作成するときにのみ、これらの追加の工程が表示されるようにするにはどうすればよいでしょうか。",
      choices: ["ページレイアウトを1つにする。>レコードタイプを使用して、適切なステータスの選択リスト値が表示されるようにする。","2ページレイアウトを作成する。>ビジネスプロセスとレコードタイプを使用して、適切な選択リスト値を表示する。","1つのページレイアウトを作成する。>ビジネスプロセスを使用して、適切なステータス選択リスト値が表示されるようにする。","2つのページレイアウトを作成する。>1つはハウスステータス項目で、もう1つはコンドミニアムステータス項目の２項目を作成する。"],
      answers: [1],
      explanation: `2つのページレイアウトを作成し、ビジネスプロセスとレコードタイプを使用して特定の選択リスト値を表示することで、コンドミニアムのオープンハウスと戸建てのオープンハウスの手続きを分けることができます。これにより、コンドミニアムのオープンハウス用レコード作成時にのみ特別な手続きが表示されます。
        ※ ページレイアウトが1つだけでは、コンドミニアムのオープンハウスの特別な手続きと戸建てのオープンハウスの手続きを区別して表示することができません。レコードタイプを使用しても、ページレイアウトが1つだと項目の表示を変えることができません。
        ※ 1つのページレイアウトでは、コンドミニアムと戸建ての手続きを適切に分けて表示することはできません。ビジネスプロセスはステータスの選択リスト値を制御しますが、特定の項目の表示を制御するものではありません。
        ※ 2つのページレイアウトを作成する点は正しいですが、単に項目を分けるだけでは特定のレコードタイプに応じた特別な手続きの表示は達成できません。ビジネスプロセスとレコードタイプを使用して適切に設定する必要があります。`
    },
  {
      id: 48,
      category: "自動化",
      source: "tysonblog 第48問",
      question: "Northern Trail Outfitters社は、各マーケティングキャンペーンでどれだけの収益が発生したかを計算したいと考えています。管理者はこの情報をどのように提供すればよいでしょうか。",
      choices: ["キャンペーンレコードを更新するために定期的にデータジョブを実行する。","キャンペーンに合計値項目を追加し、商談獲得時に値を更新するレコードトリガーフローを作成する。","標準のキャンペーンレポートを設計し、[キャンペーンの成立商談金額]項目を追加する。","商談からキャンペーンへの積み上げ集計項目を作成する。"],
      answers: [2],
      explanation: `Salesforceにおいて、標準のキャンペーンレポートにはすでに[キャンペーンの成立商談金額]という項目が含まれています。この項目を利用することで、キャンペーンに紐づいた商談の成立金額を効率的に集計し、キャンペーンのパフォーマンスと収益性を把握することが可能になります。このアプローチでは、追加の設定やカスタマイズを必要とせず、直接、キャンペーンに関連する重要な財務指標を確認することができるため、マーケティングの成果測定に役立ちます。
        ※ データジョブを定期的に実行してキャンペーンレコードを更新する方法は手動作業や外部ツールの使用を伴い、自動化の利便性に欠けます。この方法ではリアルタイムのデータ更新が難しく、管理の手間も増えるため、効率的なソリューションとは言えません。
        ※ Salesforceの標準設定では、キャンペーンオブジェクトと商談オブジェクトは参照関係にあります。そのため、主従関係のみに作成できる積み上げ集計項目をキャンペーンオブジェクトに設定して商談の合計値を動的に更新することはできません。
        ※ 商談とキャンペーンは参照関係にあるため、Salesforceの標準機能では、商談からキャンペーンへの積み上げ集計項目を直接作成することはできません。積み上げ集計項目は主従関係にあるオブジェクト間でのみ作成可能であり、参照関係では使用できません。`
    },
  {
      id: 49,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第50問",
      question: "Salesforceのオブジェクトを操作する際に、管理者が留意すべき点は何ですか。2つ選びなさい。",
      choices: ["新しい標準オブジェクトを作成できます。","標準オブジェクトは Salesforceに標準で組み込まれています。","標準オブジェクトのみが主従関係をサポートします。","カスタムオブジェクトと標準オブジェクトには標準項目があります。"],
      answers: [1,3],
      explanation: `標準オブジェクトは、Salesforceにあらかじめ組み込まれているオブジェクトで、取引先、取引先責任者、商談、ケースなどが含まれます。これらは基本的なCRM機能を提供するために使用されます。
        標準オブジェクトにはSalesforceにあらかじめ定義された標準項目が含まれており、カスタムオブジェクトにもSalesforceが自動的に作成する標準項目(例：作成者、最終更新者など)が含まれます。
        ※ Salesforceでは、新しい標準オブジェクトを作成することはできません。標準オブジェクトはSalesforceにあらかじめ用意されているものであり、カスタマイズは可能ですが、新たに作成することはできません。新しいオブジェクトを作成したい場合は、カスタムオブジェクトを使用します。
        ※ これは誤りです。主従関係は、標準オブジェクトとカスタムオブジェクトの両方でサポートされています。主従関係は2つのオブジェクト間で強い関連を作成し、集計項目(積み上げ集計)などの高度な機能を利用できるようにします。`
    },
  {
      id: 50,
      category: "設定とセットアップ",
      source: "tysonblog 第51問",
      question: "管理者が、Universal Containers社の新入社員10名分の新規ユーザーを作成しました。これらのユーザーがSalesforce組織の取引先オブジェクトにアクセスできないのはなぜですか。",
      choices: ["組織全体のデフォルトが非公開に設定されている。","ユーザーのプロファイルには、取引先の共有ルールが必要です。","ユーザーのプロファイルには、取引先オブジェクトへの権限が必要です。","ユーザーのロールがロール階層の下位にある。"],
      answers: [2],
      explanation: `Salesforceでは、ユーザーが特定のオブジェクトにアクセスできるかどうかは、そのユーザーのプロファイルに設定された権限によって決定されます。プロファイルに取引先オブジェクトへのアクセス権限が含まれていない場合、ユーザーはそのオブジェクトにアクセスできません。
        ※ 組織全体のデフォルト設定はレコードレベルのアクセス制御に関わりますが、問題はユーザーが取引先オブジェクト自体にアクセスできないことを指しています。オブジェクト自体へのアクセスは、ユーザーのプロファイルに設定されたオブジェクト権限によって制御されます。
        ※ 共有ルールはレコードの可視性を拡張するために使用されますが、プロファイルには設定されません。プロファイルはオブジェクトレベルのアクセス権限を管理しますが、共有ルールはレコードレベルのアクセスを管理します。
        ※ ロール階層はレコードのアクセス権を管理するために使用されますが、オブジェクトレベルのアクセスには影響を与えません。ユーザーが特定のオブジェクトにアクセスできるかどうかはプロファイルに設定された権限によって決まります。`
    },
  {
      id: 51,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第52問",
      question: "Cloud Kicks社の管理者が、新しいクラウドシューズの返品を追跡するための新しい項目を作成しました。あるユーザーが、新しい項目が利用できない旨のケースを管理者に提出しました。この問題をトラブルシューティングするために管理者が行うべきステップはどれですか。2つ選びなさい。",
      choices: ["ユーザーのプロファイルのページレイアウトが更新されていることを確認する。","組織の[設定変更履歴の参照]を確認する。","オブジェクトの組織全体のデフォルトを更新する。","ユーザーのプロファイルにおいて項目レベルセキュリティを確認する。"],
      answers: [0,3],
      explanation: `新しい項目がページレイアウトに追加されていない場合、ユーザーはその項目を表示できません。ページレイアウトを更新して新しい項目が表示されるようにすることは、一般的なトラブルシューティングのステップです。
        項目レベルセキュリティを確認し、新しい項目がユーザーのプロファイルで適切に設定されていることを確認することは重要です。項目レベルセキュリティが正しく設定されていない場合、ユーザーは項目を表示または編集することができません。
        ※ [設定変更履歴の参照]は、組織内で行われた設定変更を確認するためのツールですが、具体的な項目の表示問題のトラブルシューティングには直接関係ありません。
        ※ 組織全体のデフォルト設定は、レコードのアクセスレベルを制御するものであり、特定の項目が表示されない問題には直接影響しません。`
    },
  {
      id: 52,
      category: "自動化",
      source: "tysonblog 第53問",
      question: "Universal Containers社(UC)には、各取引先に関連付けられているオープンケースの数をカウントし、毎週金曜日の夕方にこの値で取引先を更新したいと考えています。UCには、常に数百件のオープンケースがあります。管理者は、この要求を完了するために何を使用する必要がありますか。",
      choices: ["積み上げ集計項目を使用する。","スケジュール済みプロセスを使用する。","レコードトリガフローを使用する。","スケジュールトリガーフローを使用する。"],
      answers: [3],
      explanation: `スケジュールトリガーフローは、特定の日時や定期的なスケジュールに基づいて自動的に実行されるフローです。この機能を使用することで、管理者は毎週金曜日の夕方に取引先レコードを更新するフローを設定できます。これにより、各取引先に関連付けられたオープンケースの数をカウントして取引先レコードを更新するという要求を満たすことができます。
        ※ 積み上げ集計項目は、主従関係にあるオブジェクト間で数値の集計をリアルタイムで行うのに適しています。取引先とケースは参照関係であるため、積み上げ集計項目を直接使用することはできません。また、特定の時点(毎週金曜日の夕方など)にのみ更新を行う要件には対応していません。
        ※ プロセスビルダーは、レコードの作成、更新、または他のイベントに応じて特定のアクションを自動化するために使用されますが、特定の時間に基づいてアクションを実行する機能はありません。この要求には、定期的な時間に基づいて自動的に実行される機能が必要です。
        ※ レコードトリガフローは、レコードの作成、更新、削除などのイベントに基づいてフローをトリガーするものです。しかし、時間ベースのスケジュールに従って自動的に実行されるわけではありません。このケースでは、特定の日時(毎週金曜日の夕方)に基づいて取引先レコードを更新する必要があります。`
    },
  {
      id: 53,
      category: "セールス&マーケティングアプリケーション",
      source: "tysonblog 第54問",
      question: "Cloud Kicks社の役員は、商談オブジェクトの期待収益項目が正しくない値を表示していることに気づきました。管理者はどのようにこれを修正する必要がありますか。",
      choices: ["フェーズに関連付けられている[期待収益]項目を更新する。","フェーズに関連付けられている[売上予測分類]項目を調整する。","フェーズに関連付けられている[確度 (%)]項目を変更する。","フェーズに関連付けられているClosed Wonの値を変更する。"],
      answers: [2],
      explanation: `期待収益の計算は、商談の金額とその商談のフェーズに関連する確度 (%)に基づいています。フェーズに関連する確度のパーセンテージを変更することで、期待収益の計算に影響を与え、不正確な値を修正することができます。
        ※ 期待収益は、商談の金額と確度を基に自動計算される項目です。この値は直接更新はできません。
        ※ [売上予測分類]項目は、商談がどの予測カテゴリに属するかを決定し、レポート、商談の詳細および編集のページ、商談の検索、商談リストビューに表示されますが、[期待収益]の値には直接影響を与えません。
        ※ Closed Wonの値は、商談が成功したことを示すフェーズですが、期待収益の計算には直接関与しません。期待収益は、商談がまだクローズされていない段階での確度に基づく金額の算出に関連しているため、この値を変更しても期待収益の計算には影響しません。`
    },
  {
      id: 54,
      category: "自動化",
      source: "tysonblog 第55問",
      question: "Cloud Kicks社のユーザーは、2週間ごとに繰り返すToDoを作成できるようにしたいと考えています。この要求を満たすために、管理者は何をすべきでしょうか。",
      choices: ["繰り返しToDoの作成を有効にする。","繰り返しToDoを作成するフローを作成する。","スケジュールトリガーフローで繰り返しToDoを自動作成する。","定期的な活動を有効にする。"],
      answers: [0],
      explanation: `Salesforceには繰り返しToDoの機能があり、これを有効にすることでユーザーは特定の頻度で繰り返されるToDoを作成できます。2週間ごとに繰り返すToDoもこの機能を使用して設定することができます。
        ※ フローを使用して繰り返しToDoを作成することはできますが、Salesforceの標準機能である繰り返しToDoを有効にする方が簡単かつ効率的です。
        ※ ワークフロールールは自動化されたアクションをトリガーするために使用されますが、繰り返しToDoを直接作成するための機能は提供していません。
        ※ 定期的な行動は、Salesforce Classicで行動(イベントや会議)の繰り返しを設定するもので、ToDo(タスク)には適用されません。今回の要件はToDoの繰り返しであり、この設定では実現できません。`
    },
  {
      id: 55,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第56問",
      question: "Northern Trail Outfitters社の人事部では、Salesforceのカスタムオブジェクトを使用して、マネージャーに関するフィードバックを従業員に提供したいと考えています。マネージャーは、部下からのフィードバックレコードを見ることができないようにすることが重要です。この要件を満たすために、管理者はカスタムオブジェクトをどのように設定すればよいでしょうか。",
      choices: ["デフォルトの外部アクセス権を非公開に設定する。","条件に基づく共有ルールを設定する。","[階層を使用したアクセス許可]のチェックを外す。","レコード所有者に基づく共有ルールを設定する。"],
      answers: [2],
      explanation: `[階層を使用したアクセス許可]のオプションを無効にすることで、ロール階層を通じて上位のユーザー(この場合はマネージャー)が下位のユーザー(部下)のデータにアクセスできなくなります。これにより、マネージャーが部下からのフィードバックレコードを見ることを防ぐことができます。
        ※ この選択肢は外部ユーザーやコミュニティメンバー向けのアクセス制御に関連しており、内部従業員間での情報共有の制御には適用されません。今回の要件は、内部のマネージャーと部下間でのフィードバックレコードの可視性を制御することであり、外部アクセス設定はこのシナリオには関連しません。
        ※ 条件に基づく共有ルールは、特定の条件を満たすレコードを特定のユーザーやグループと共有するために使用されます。このシナリオでは、マネージャーにレコードアクセスを制限することが目的であるため、共有権を拡張するアプローチは今回の要件を満たしません。
        ※ レコード所有者に基づく共有ルールは、レコードの所有者が特定のユーザーやグループとそのレコードを共有するために使用されます。このシナリオでは、マネージャーにレコードアクセスを制限することが目的であるため、共有権を拡張するアプローチは今回の要件を満たしません。`
    },
  {
      id: 56,
      category: "設定とセットアップ",
      source: "tysonblog 第57問",
      question: "管理者が人事部から、あるユーザーのSaiesforceへのアクセス権を直ちに削除するよう急遽要請を受けました。このユーザーは、Direct Managerという階層項目に属するユーザーです。管理者はこの要求を満たすために何をすべきですか。",
      choices: ["ユーザーのプロファイルを読み取り専用に変更し、Direct Manager項目で参照されないようにする。","ユーザーを凍結してログインできないようにし、Direct Manager項目で参照されないようにする。","ユーザーを削除して、Direct Manager項目で参照されているすべてのレコードを変更せずに残す。","ユーザーを無効化して、そのユーザーがDirect Manager項目で参照されているすべてのレコードを削除する。"],
      answers: [1],
      explanation: `ユーザーを凍結することで、そのユーザーはSalesforceにログインできなくなります。これにより、ユーザーのアクセスを直ちに停止する要請に対応できます。ユーザーのデータや階層関係は保持されるため、将来的にアクセス権を再度有効化する選択肢が残ります。
        ※ Salesforceにはプロファイルを「読み取り専用」に変更する標準機能はありません。プロファイル設定でアクセス権限を制限することはできますが、ユーザーのログインを無効化するためにはプロファイル変更ではなく、ユーザーを凍結または無効化する必要があります。
        ※ Salesforceでは、一度作成されたユーザーを完全に削除することはできません。ユーザーを無効化することは可能ですが、削除はできません。また、ユーザーを無効化しても、Direct Manager項目でそのユーザーが参照されているレコードの参照は自動的には変更されません。
        ※ ユーザーを無効化することで、そのユーザーはSalesforceにアクセスできなくなりますが、関連レコードを削除する必要はありません。無効化されたユーザーは自動的にアクセス権を失うため、レコードを削除するのは不要です。`
    },
  {
      id: 57,
      category: "Agentforce",
      source: "tysonblog 第58問",
      question: "Ursa Major Solar社は、ケース上にパスを持っています。同社は、ユーザーがパス上のステータス値に従うことを要求したいと考えています。エージェントは、ケースを以前のステータスに戻すことを禁止する必要があります。この要求を満たすために、管理者が使用すべき機能はどれですか。",
      choices: ["グローバル選択リスト値セット","定義済み項目値","入力規則","連動選択リスト"],
      answers: [2],
      explanation: `入力規則を使用すると、ユーザーが特定の条件を満たさない場合にレコードの保存を防ぐことができます。この機能を利用して、ケースのステータスが以前の値に戻ることを禁止するルールを作成することで、エージェントがパス上のステータス値に従うように強制できます。
        ※ グローバル選択リスト値セットは、複数のオブジェクトや項目で一貫した選択リスト値を使用するためのツールです。これは選択リストの値を定義および共有するためのものであり、ステータスを以前の値に戻すことを禁止する機能はありません。
        ※ 定義済み項目値は、クイックアクションや他のアクションによってレコードが作成されたときに、特定の項目に自動的に値を割り当てるために使用されます。しかし、ユーザーがレコードを更新する際に特定の選択肢を選ぶことを強制したり、以前のステータスに戻すことを防ぐ機能はありません。
        ※ 連動選択リストは、ある選択リストの選択に基づいて別の選択リストの値を絞り込むために使用されます。これは、項目値の依存関係を作成する際に有用ですが、過去のステータスへの変更を制限する直接的な方法ではありません。`
    },
  {
      id: 58,
      category: "自動化",
      source: "tysonblog 第59問",
      question: "Cloud Kicks社の管理者が、退社したユーザーを無効化したいと考えています。ユーザーを無効化できない理由は何ですか。2つ選びなさい。",
      choices: ["ユーザーがテリトリー階層の一部である。","ユーザーがカスタム階層項目で選択されている。","ユーザーがワークフローのメールアラートに割り当てられている。","ユーザーがロール階層の最上位ロールである。"],
      answers: [1,2],
      explanation: `カスタム階層項目で選択されているユーザーを無効化するためには、その項目からユーザーを削除する必要があります。カスタム階層項目で選択され続けている限り、ユーザーを無効化することはできません。
        ユーザーがワークフローメールアラートの唯一の受信者として指定されている場合、そのユーザーを無効化することはできません。まずは、メールアラートの受信者を更新する必要があります。
        ※ Salesforceの文書によれば、ユーザーがテリトリー階層の一部であること自体がユーザーを無効化できない直接の理由ではありません。ただし、ユーザーを無効化する前に、テリトリーからの割り当てを解除することが推奨されます。
        ※ ユーザーがロール階層の最上位ロールにある場合、そのユーザーを無効化することが直接的に禁止されているわけではありません。しかし、組織のロール階層に大きな影響を与える可能性があるため、慎重に処理する必要があります。`
    },
  {
      id: 59,
      category: "自動化",
      source: "tysonblog 第60問",
      question: "Cloud Kicks社の管理者は、休暇申請の承認プロセスを作成しました。承認プロセスの一部として追加可能な自動アクションはどれですか。2つ選びなさい。",
      choices: ["項目自動更新","Chatter 投稿","自動起動フロー","メールアラート"],
      answers: [0,3],
      explanation: `承認プロセスに追加可能なアクションはToDo、メールアラート、項目自動更新、送信メッセージの4つです。よって今回の正解は項目自動更新とメールアラートです。その他の選択肢は承認プロセスに追加可能なアクションではありません。`
    },
  {
      id: 60,
      category: "設定とセットアップ",
      source: "tysonblog 第61問",
      question: "管理者が重要な更新プログラムを確認しました。管理者は、重要な更新プログラムの有効化をどのように進めるべきですか。",
      choices: ["運用環境で重要な更新プログラムを有効化する。","サンドボックスで重要な更新プログラムを有効化する。","サンドボックスで重要な更新プログラムが自動的に有効化する。","重要な更新プログラムが自動的に有効化する。"],
      answers: [1],
      explanation: `サンドボックス環境で重要な更新プログラムを最初に有効化することは、新しい機能や変更が組織のカスタマイズや既存のプロセスにどのような影響を与えるかを安全にテストするためのベストプラクティスです。問題を特定し、本番環境に導入する前に修正する機会を提供します。
        ※ 重要な更新プログラムを直接本番環境で有効にすることはリスクが高いです。まずサンドボックスでテストし、システムやユーザーへの影響を評価した後、本番環境への適用を検討するべきです。
        ※ 重要な更新プログラムがサンドボックスで自動的に有効になることはありません。管理者は手動でこれらの更新を確認し、テスト環境で意図的に有効化する必要があります。
        ※ 重要な更新プログラムが本番環境で自動的に有効になることはありません。管理者は手動でこれらの更新を確認し、テスト環境で意図的に有効化する必要があります。`
    },
  {
      id: 61,
      category: "設定とセットアップ",
      source: "tysonblog 第62問",
      question: "Cloud Kicks社はデータエクスポートサービスを利用してバックアップでデータを保護しようとしています。管理者がエクスポートのスケジュールを立てる際に覚えておくべき考慮事項はどれですか。2つ選びなさい。",
      choices: ["メタデータのバックアップは別のプロセスで実行する必要があります。","メタデータのバックアップは、Sandboxの更新間隔に制限されています。","データエクスポートサービスはサンドボックスから実行する必要があります。","データのバックアップは毎週または毎月の間隔に制限されます。"],
      answers: [0,3],
      explanation: `データエクスポートサービスはデータのバックアップに特化しており、メタデータのバックアップには対応していません。メタデータのバックアップは未管理パッケージの作成や、メタデータAPIを使用して実行する必要があります。
        Salesforceのデータエクスポートサービスは、エクスポートのスケジュールを毎週または毎月に設定することができます。エクスポートの頻度は、ユーザーの選択に基づいて設定されます。
        ※ メタデータのバックアップはSandboxの更新間隔には影響されません。メタデータのバックアップはいつでも実行可能です。
        ※ データエクスポートサービスは本番環境で使用されることを想定しています。サンドボックス環境からのエクスポートはサポートされていません。`
    },
  {
      id: 62,
      category: "自動化",
      source: "tysonblog 第63問",
      question: "Cloud Kicks社の管理者は、メールまたはWeb経由で作成されたすべてのケースを自動ケースキューに送信する割り当てルールを作成しています。手動で作成されたケースは、作成したエージェントが所有するはずですが、手動で作成されたケースの所有者が管理者になっています。この問題のトラブルシューティングで、管理者はどう対応すればよいでしょうか。",
      choices: ["エスカレーションルールが、ケース作成時にケースの所有者を変更しています。","割り当てルールのチェックボックスがデフォルトで選択されている。","別の割り当てルールが管理者に所有権を与えている。","Webフォームとメールテンプレートに所有者項目がありません。"],
      answers: [1],
      explanation: `手動でケースを作成する際に、割り当てルールを適用するチェックボックスがデフォルトで選択されていると、割り当てルールが適用され、結果としてケースの所有者が管理者になる可能性があります。チェックボックスがデフォルトでオンになっている場合は、オフにすることで割り当てルールを上書きし、作成者を所有者として割り当てることができます。
        ※ エスカレーションルールは、特定の条件(通常は時間経過に関連する条件)が満たされた場合に、ケースの優先順位をエスカレートするために使用されます。これはケースの所有権の初期割り当てには直接影響しません。
        ※ Salesforceでは、一度に有効にできる割り当てルールは一つです。したがって、複数の割り当てルールが同時に影響を与えることはありません。
        ※ Webフォームやメールテンプレートに所有者項目が含まれていないことは、手動で作成されたケースの所有者が管理者になっている問題とは直接関係がありません。`
    },
  {
      id: 63,
      category: "Agentforce",
      source: "tysonblog 第64問",
      question: "Northern Trail Outfitters社は、Salesforceから外部の人事システムに経費報告を開始したいと考えています。このプロセスは、マネージャーとディレクターによるレビューが必要です。管理者はどのツールを設定する必要がありますか。2つ選びなさい。",
      choices: ["クイックアクション","アウトバウンドメッセージ","承認プロセス","メールアラートアクション"],
      answers: [1,2],
      explanation: `アウトバウンドメッセージは、Salesforceから外部システムに情報を送信するための機能です。承認プロセスの一部として設定できる自動アクションに含まれており、経費報告を外部の人事システムに送信するために適しています。
        承認プロセスは、経費報告をマネージャーとディレクターによるレビューに通すために使用されます。承認プロセスは、特定の条件を満たしたレコードを順次承認者に送信し、レビューおよび承認を自動化するための強力なツールです。
        ※ クイックアクションは、レコードの作成や更新などを迅速に実行するための機能です。しかし、マネージャーとディレクターによるレビューのプロセスには直接関与しません。承認プロセスや外部システムへの連携には適していません。
        ※ メールアラートは、特定の条件が満たされたときに通知メールを送信するためのツールです。承認プロセスのレビュー通知に使用できますが、経費報告を外部システムに送信する機能はありません。`
    },
  {
      id: 64,
      category: "Agentforce",
      source: "tysonblog 第65問",
      question: "Universal Containers社は、月初に新しい求人広告を作成しました。その求人がまだ募集中で、ステータスが”面接中”でない場合、30日後に副社長にChatterの投稿を送信するプロセススケジュールアクションが発生しました。その月の10日に、応募者が面接し、求人広告のステータスが”面接中”に更新されました。この場合、Chatter 投稿はどうなりますか。",
      choices: ["保留中のChatter 投稿は30日後に送信される。","保留中のChatter 投稿はキャンセルされる。","保留中のChatter 投稿は一時停止される。","保留中のChatter 投稿は、その月の10日に送信される。"],
      answers: [1],
      explanation: `スケジュールされたアクションは、条件が満たされなくなった場合、自動的にキャンセルされます。ステータスが「面接中」に更新されると、元の条件(ステータスが「面接中」でない)が満たされなくなるため、Chatter投稿はキャンセルされます。
        ※ プロセススケジュールアクションの条件が変更されると、そのアクションは再評価されます。今回の場合、ステータスが「面接中」に更新されたため、条件に一致しなくなります。
        ※ スケジュールアクションは一時停止されることはなく、条件が満たされなくなった場合はキャンセルされます。
        ※ スケジュールアクションは、指定された条件が満たされない限り実行されません。10日に条件が変更されているため、投稿は送信されません。`
    },
  {
      id: 65,
      category: "セールス&マーケティングアプリケーション",
      source: "tysonblog 第66問",
      question: "Northern Trail Outfitters社は、すべてのマーケティングユーザーに1つのプロファイルを使用し、キャンペーンオブジェクトへの読み取り専用アクセスを提供しています。現在、数名のマーケティングユーザーがキャンペーンの包括的な編集アクセス権を必要としています。管理者はどのようにこの要求を満たすべきでしょうか。",
      choices: ["マーケティングユーザーのチェックボックス","組織全体のデフォルト","権限セット","項目レベルセキュリティ"],
      answers: [2],
      explanation: `権限セットは、特定のユーザーやグループに対して追加の権限を付与するためのツールです。既存のプロファイルを変更することなく、数名のマーケティングユーザーにキャンペーンオブジェクトの包括的な編集アクセス権を追加で付与できます。これにより、他のマーケティングユーザーは読み取り専用アクセスを維持しつつ、必要なユーザーに対してのみ編集権限を与えることができます。
        ※ マーケティングユーザーのチェックボックスは、ユーザーにマーケティング機能を有効にするためのものですが、特定のオブジェクトに対する読み取り専用や編集権限を設定するものではありません。
        ※ 組織全体のデフォルトは、オブジェクトのレコードに対するデフォルトのアクセス権を設定しますが、特定のユーザーやグループに対して異なる権限を付与するためのものではありません。今回の要件では、特定のユーザーに対してのみ包括的な編集権限を与える必要があります。
        ※ 項目レベルセキュリティは、オブジェクト内の特定の項目に対するアクセス権を制御するものですが、オブジェクト全体に対する編集権限を付与するためのものではありません。今回の要件では、キャンペーンオブジェクト全体に対して包括的な編集権限が必要です。`
    },
  {
      id: 66,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第67問",
      question: "Cloud Kicks社はカスタム項目を削除することにしました。削除された場合、項目のデータはどうなりますか。",
      choices: ["項目のデータは20日間保存されます。","データは永久に削除されます。","項目に関連付けられたデータは削除されます。","データはごみ箱から復元可能です。"],
      answers: [2],
      explanation: `削除されたカスタム項目に関連付けられたデータ(履歴データなど)は、項目の削除と同時に削除されます。ただし、削除後15日間はデータが保存され、その間に復元することで元に戻すことが可能です。15日が経過するとデータは完全に削除されます。
        ※ 削除されたカスタム項目のデータは、Salesforceによって15日間保存されます。この期間中はデータを復元することが可能です。20日間ではなく、正しくは15日間です。
        ※ 削除されたカスタム項目とそのデータは15日間保存され、その後に完全に削除されます。したがって、削除後すぐに永久に削除されるわけではありません。
        ※ 削除されたカスタム項目とそのデータは、ごみ箱を経由して復元されるわけではありません。[オブジェクトマネージャー]>[任意のオブジェクト]>[項目とリレーション]>[削除済み項目]から復元することができます。`
    },
  {
      id: 67,
      category: "設定とセットアップ",
      source: "tysonblog 第68問",
      question: "Universal Containers社の管理者は、ユーザーがネットワーク外からSalesforceにアクセスできないようにするよう求められました。この構成で考慮すべきことは何ですか。2つ選びなさい。",
      choices: ["IPアドレスの制限を、プロファイルまたは組織全体に対して設定する。","シングルサインオンを権限セットに割り当て、ネットワーク外からのログインを許可する。","IP 制限を適用するために、[すべての要求でログイン IP アドレスの制限を適用] を選択する必要がある。","ログイン時間を強制するために、ユーザーのプロファイルでU2Fセキュリティキーを制限する。"],
      answers: [0,2],
      explanation: `IPアドレスの制限をプロファイルまたは組織全体に設定することで、指定されたIPアドレス範囲からのみSalesforceにアクセスできるように制限できます。これにより、ネットワーク外からの不正なアクセスを防ぐことができます。
        Salesforceでは「セッションの設定」内に「すべての要求でログイン IP アドレスの制限を適用」というオプションがあります。このオプションを選択することで、すべてのログイン要求に対してIPアドレスの制限が適用されます。これにより、指定されたIPアドレス範囲外からのアクセスを完全に防ぐことができます。
        ※ シングルサインオン(SSO)は、ユーザーが一度のログインで複数のシステムにアクセスできるようにするための機能です。ネットワーク外からのログインを制限するためのものではなく、むしろSSOを使用してネットワーク外からのアクセスを許可する方向になるため、今回の要件には適していません。
        ※ U2Fセキュリティキーは二要素認証の一種であり、ログイン時間やIPアドレスの制限とは関係ありません。ネットワーク外からのアクセス制限には直接関係がないため、今回の要件には適していません。`
    },
  {
      id: 68,
      category: "データ管理&分析",
      source: "tysonblog 第69問",
      question: "Cloud Kicks社は、2月1日に始まり12ヶ月を有する会計年度をレポートに表示させたいと考えています。管理者はこの要件にどのように対処すべきでしょうか。",
      choices: ["会計年度を[標準]に設定し、期間を12ヶ月に設定する。","会計年度を[カスタム]に設定し、期間を4四半期に設定する。","会計年度を[標準]に設定し、開始月を2月に設定する。","会計年度を[カスタム]に設定し、開始月を2月に設定する。"],
      answers: [2],
      explanation: `標準会計年度では、開始月を任意の月に設定することができます。開始月を2月に設定することで、2月1日から始まる会計年度を設定でき、Cloud Kicks社の要件を満たすことができます。
        ※ 標準会計年度では開始月を変更することはできますが、期間を12ヶ月に設定するというオプションはありません。
        ※ カスタム会計年度は柔軟な設定が可能ですが、標準会計年度で開始月を2月に設定できるため、複雑なカスタム会計年度を設定する必要はありません。また、カスタム会計年度は一度有効にすると無効にできないため、標準で設定できる場合には不要です。
        ※ カスタム会計年度は標準会計年度で開始月を2月に設定できる場合には不要です。さらに、カスタム会計年度は一度有効にすると無効にできないため、標準会計年度で対応できるならカスタム会計年度を使用する必要はありません。`
    },
  {
      id: 69,
      category: "自動化",
      source: "tysonblog 第70問",
      question: "Universal Containers社では、リードに商品カテゴリというカスタム項目があります。管理者は、リードの変換時にこの情報を商談の一部にしたいと考えています。この要求を満たすために、管理者はどのようなアクションを取るべきですか。",
      choices: ["リードのカスタム項目を商品の商品カテゴリ項目に対応付けする。","リードに基づいて商談の項目を更新するレコードトリガーフローを作成する。","商談にカスタム項目を作成し、2つの項目を対応付けする。","商品の商品カテゴリ選択リスト項目を構成する。"],
      answers: [2],
      explanation: `リードのカスタム項目「商品カテゴリ」を商談の項目に引き継ぎたい場合、まず商談にカスタム項目を作成し、その後リード変換の対応付け設定でリードの「商品カテゴリ」項目を商談のカスタム項目に対応付けします。これにより、リード変換時に「商品カテゴリ」の情報が商談に引き継がれます。
        ※ リードのカスタム項目を商品カテゴリ項目に対応付けするのは、商品に対する設定であり、商談に対する設定ではありません。リード変換時に商談の項目として情報を引き継ぐためには、この方法は適していません。
        ※ リード変換時にワークフロールールを使用して商談の項目を更新するのは標準的な方法ではありません。リード変換の際に直接対応付けする方法が推奨されます。
        ※ この選択肢は商品の設定に関するものであり、リードから商談への変換には関係がありません。リード変換時に商品カテゴリの情報を商談に引き継ぐためには、この方法は適していません。`
    },
  {
      id: 70,
      category: "Agentforce",
      source: "tysonblog 第71問",
      question: "Ursa Major Solar社の管理者は、商談が終了するたびに外部の会計システムに情報を送信する必要があります。管理者は、これを達成するためにどのようなワークフローアクションを使用する必要がありますか。",
      choices: ["アウトバウンドメッセージ","レコードの作成","ToDoの割り当て","カスタム通知"],
      answers: [0],
      explanation: `アウトバウンドメッセージは、Salesforceから外部システムに情報を送信するためのワークフローアクションです。特定の条件が満たされたときに、外部のエンドポイントにSOAPメッセージを送信することができます。商談が終了したときに、会計システムに情報を送信する要件を満たすために最適なアクションです。
        ※ レコードの作成はSalesforce内で新しいレコードを自動的に作成するアクションです。外部システムへの情報送信には関与しません。さらに、これはワークフロールールのアクションではなく、主にプロセスビルダーやフローで使用されるアクションです。
        ※ Salesforceの自動化ツールに追加できるアクションの中に[ToDoの割り当て]は存在しません。
        ※ カスタム通知は、Salesforce内のユーザーに通知を送信するための機能です。外部システムに情報を送信するためのものではありません。また、これはワークフロールールのアクションではなく、主にプロセスビルダーやフローで使用されるアクションです。`
    },
  {
      id: 71,
      category: "設定とセットアップ",
      source: "tysonblog 第72問",
      question: "AW Computing(AWC)社は、独立した請負業者と仕事をすることがあり、その請負業者はSalesforceの取引先責任者として保存されます。 契約業者はしばしば代理店を変更し、 AWCはレコードの履歴の正確性を維持したいと考えています。AWCは取引先責任者の追跡に何を使用すべきでしょうか。",
      choices: ["取引先責任者を追跡するためにパートナーコミュニティを使用する。","取引先責任者ごとに新しい取引先責任者レコードを作成する。","多対多の関係を追跡するために、連結オブジェクトを作成する。","取引先責任者が複数の取引先に持つことができるようにする。"],
      answers: [3],
      explanation: `取引先責任者-to-複数取引先の機能を使用することで、1つの取引先責任者を複数の取引先に関連付けることができます。この機能により、重複レコードを作成することなく、取引先責任者と複数の取引先間のリレーションを管理できます。また、取引先責任者が異なる取引先に関連する履歴を正確に維持することができます。
        ※ パートナーコミュニティは、外部のパートナーや顧客と情報を共有し、コラボレーションするためのプラットフォームであり、取引先責任者の履歴を追跡する目的には適していません。
        ※ 取引先責任者ごとに新しいレコードを作成すると、データの重複が発生し、管理が複雑になります。正確な履歴を維持するためには、1つの取引先責任者レコードを複数の取引先に関連付ける方法が望ましいです。
        ※ Salesforceには取引先責任者を複数の取引先に関連付ける機能が標準で備わっており、連結オブジェクトを作成する必要はありません。取引先責任者-to-複数取引先の機能を使用することで、同様の目的を達成できます。`
    },
  {
      id: 72,
      category: "サービス&サポートアプリケーション",
      source: "tysonblog 第73問",
      question: "Ursa Major Solar社には、サポートキューに転送されるサービスレベルアグリーメント(SLA)がある。24時間のSLAを満たすケースは、自動的に次の層のキューに再割り当てされる必要があります。この要件を満たすには、どの機能を使用する必要がありますか。",
      choices: ["Einstein ケース分類の割り当てルール","ケースの割り当てルール","ケースのエスカレーションルール","自動レスポンスルール"],
      answers: [2],
      explanation: `ケースのエスカレーションルールは、特定の条件を満たしたケースを自動的にエスカレートし、それを別のユーザーやキューに再割り当てする機能です。この要件には、特定の時間(この場合は24時間のSLA)が経過したケースを次の層のキューに自動的に再割り当てする必要があるため、ケースのエスカレーションルールが最も適しています。
        ※ Einstein ケース分類の割り当てルールは、ケースの内容を分析して自動的に予測項目値を設定し、それに基づいてケースを適切なエージェントに転送する機能です。今回の要件である24時間のSLAを満たすケースの再割り当てには適していません。
        ※ ケースの割り当てルールは、ケースが作成される際に特定のユーザーやキューにケースを自動的に割り当てるために使用されます。割り当てルールはケースの初期割り当てに有用ですが、SLAの満了に基づく自動的な再割り当てプロセスには適していません。
        ※ 自動レスポンスルールは、ケースやリードが作成された際に自動的に応答メールを送信するために使用されます。この機能は顧客への初期応答の自動化に役立ちますが、SLAの基準に基づいてケースを再割り当てするプロセスには適していません。`
    },
  {
      id: 73,
      category: "セールス&マーケティングアプリケーション",
      source: "tysonblog 第74問",
      question: "Cloud Kicks社の営業担当副社長が、商談を保存できないエラーメッセージを受け取っています。管理者は同じように商談を編集してみましたが、エラーが発生しませんでした。管理者はユーザーが受け取っているエラーを、どのように検証すればよいですか。",
      choices: ["設定変更履歴の参照を確認する。","ユーザーとしてログインする。","デバッグログを有効にして確認する。","ユーザーのプロファイルを確認する。"],
      answers: [1],
      explanation: `※ ユーザーとしてログインする機能を使用すると、管理者はそのユーザーの視点からSalesforceにログインし、ユーザーが遭遇しているエラーを直接的に再現および検証することができます。`
    },
  {
      id: 74,
      category: "サービス&サポートアプリケーション",
      source: "tysonblog 第75問",
      question: "DreamHouse Realty社(DR)では、定期的に顧客からの保証作業依頼を処理しており、顧客にケースを作成するためのセルフサービスオプションを提供したいと考えています。この要求を満たすために、管理者はどのソリューションを使用する必要がありますか。2つ選びなさい。",
      choices: ["ケースキュー","Web-to-ケース","メール-to-ケース","ケースのエスカレーション"],
      answers: [1,2],
      explanation: `Web-to-ケースは、顧客がウェブフォームを使用して直接ケースを作成できるようにする機能です。これにより、顧客は自分の情報や問題をオンラインで入力し、Salesforceに自動的にケースを作成することができます。セルフサービスの要件を満たすために適しています。
        メール-to-ケースは、顧客がメールを送信することで自動的にケースが作成される機能です。顧客は指定されたメールアドレスにメールを送信するだけで、Salesforceにケースが作成されます。これもセルフサービスの要件を満たすために適しています。
        ※ ケースキューは、ケースを特定のグループやチームに割り当てるためのものであり、セルフサービスオプションとして顧客が直接ケースを作成するための機能ではありません。ケースキューは主に内部でのケース管理に使用されます。
        ※ ケースのエスカレーションは、特定の条件が満たされた場合にケースを次のサポートレベルに自動的に転送するための機能です。顧客がセルフサービスでケースを作成するための機能ではなく、内部プロセスを管理するためのものです。`
    },
  {
      id: 75,
      category: "自動化",
      source: "tysonblog 第76問",
      question: "Cloud Kicks社の管理者は、顧客が電話で問題を問い合わせたときにサービス担当者が同じ質問をするのに役立つ画面フローを作成しました。この画面はケースから見えるようにする必要があります。画面フローはどのように配置する必要がありますか。",
      choices: ["Lightning ページ","ページレイアウト","ホームページ","コンポーネントの表示を設定"],
      answers: [0],
      explanation: `Lightning ページに画面フローを配置することで、ケースレコードページにフローを表示できます。Lightning アプリケーションビルダーを使用して、フローコンポーネントをケースレコードページに追加することができます。これにより、サービス担当者はケース詳細ページから直接画面フローを利用することができます。
        ※ ページレイアウトは、レコードページ上の項目や関連リストの表示を制御するためのもので、画面フローを直接追加することはできません。
        ※ ホームページに画面フローを配置すると、Salesforceのホームページ上にフローが表示されますが、特定のケースレコードと関連付けられたフローを表示するには適していません。ケースに関連した操作を行うためには、ケースレコードページにフローを配置する必要があります。
        ※ コンポーネントの表示を設定することは、コンポーネントの表示条件を設定するためのもので、画面フローをどこに配置するかを決定するものではありません。`
    },
  {
      id: 76,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第77問",
      question: "Cloud Kicks社の管理者は、カスタム項目を持つ新しいカスタムオブジェクトへのアクセス権を複数のユーザーに与える必要があります。この要件を満たすために管理者が使用すべきオプションはどれですか。2つ選びなさい。",
      choices: ["権限セットグループをユーザーに割り当てる。","組織全体のデフォルトを編集する。","権限セットを作成する。","手動共有リストに追加する。"],
      answers: [0,2],
      explanation: `権限セットグループは、複数の権限セットをまとめてユーザーに割り当てることができる機能です。カスタムオブジェクトへのアクセス権を含む権限セットを権限セットグループに追加し、そのグループをユーザーに割り当てることで、簡単にアクセス権を管理できます。
        権限セットを作成し、その中に新しいカスタムオブジェクトへのアクセス権を定義することで、特定のユーザーに対してカスタムオブジェクトへのアクセス権を付与することができます。その後、この権限セットを対象ユーザーに割り当てることで、アクセス権を提供できます。
        ※ 組織全体のデフォルトは、オブジェクトのレコードに対するデフォルトのアクセス権を制御する設定です。全ユーザーに対するレコードのアクセス権を一括で設定するものであり、特定のユーザーやグループに対して個別にアクセス権を与えるためのものではありません。
        ※ 手動共有は特定のレコードを特定のユーザーやグループと共有するための機能です。カスタムオブジェクト全体へのアクセス権を付与する目的には適していません。また、手動共有したレコードをリスト化したものはSalesforceには存在しません。`
    },
  {
      id: 77,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第78問",
      question: "オブジェクトマネージャーで項目を必須としてマークする際に、考慮する機能はどれですか。2つ選びなさい。",
      choices: ["項目は、そのオブジェクトのAPIを介してレコードを保存するために必要ではありません。","項目は、そのオブジェクトのレコードを保存するために常に必要です。","項目は、そのオブジェクトのすべてのページレイアウトに追加されます。","Web-to-リードおよびWeb-to-ケースでレコードを保存する場合、この項目はオプションです。"],
      answers: [1,2],
      explanation: `必須項目に設定された場合、その項目はすべてのレコードタイプおよびページレイアウトで必ず入力が必要となります。必須項目は、レコードの保存時に常に値が必要です。
        項目が必須に設定されると、その項目はページレイアウトから削除できず、自動的にすべてのページレイアウトに追加されます。ページレイアウトに存在しない場合は、最初のセクションの終わりに自動的に追加されます。
        ※ 必須項目は、SalesforceのAPIを使用してレコードを保存する際にも値が必要です。APIを介してレコードを保存する場合でも、必須項目に対する値を提供する必要があります。
        ※ Web-to-リードおよびWeb-to-ケースでも、必須項目は必須となります。これらの自動化プロセスを介してレコードを保存する場合でも、必須項目に対する値が必要です。`
    },
  {
      id: 78,
      category: "自動化",
      source: "tysonblog 第79問",
      question: "Universal Containers社(UC)の顧客から、サポートケースの対応が十分でないというフィードバックがありました。UCは、2時間以上開いているすべての未割り当てのケースを緊急ケースキューに送り、サポートマネージャーに警告を出したいと考えています。この要件を満たすために管理者が設定すべき機能はどれですか。",
      choices: ["ケースのダッシュボードの更新","ケースの割り当てルール","ケースのスケジュールレポート","ケースのエスカレーションルール"],
      answers: [3],
      explanation: `ケースのエスカレーションルールは、特定の条件を満たすケースに自動的にアクションを適用する機能です。このシナリオでは、開いてから2時間以上経過し、未割り当てのケースを緊急ケースキューに自動的に移動させ、サポートマネージャーに警告するためにエスカレーションルールを使用できます。これにより、顧客サービスの改善と迅速な対応が実現します。
        ※ ダッシュボードの更新は、最新のデータを表示するための操作です。ダッシュボードを更新することで、最新データが表示されますが、未割り当てのケースを自動的にキューに転送したり、警告を出す機能はありません。
        ※ ケースの割り当てルールは、ケースが作成されたときに特定の条件に基づいてケースを自動的に特定のユーザーやキューに割り当てるためのものです。しかし、既に作成されて2時間以上経過している未割り当てのケースを管理するための機能ではありません。
        ※ スケジュールレポートは、定期的にレポートを自動生成してメールで送信する機能です。これにより、ケースの状況を定期的に把握することはできますが、未割り当てのケースを自動的にキューに転送したり、警告を出したりする機能はありません。`
    },
  {
      id: 79,
      category: "データ管理&分析",
      source: "tysonblog 第80問",
      question: "Cloud Kicks社の管理者が、過去90日間のクローズした商談のファイルをエクスポートする必要があります。このファイルには、商談名、ID、完了予定日、および金額が含まれている必要があります。管理者はこのファイルをどのようにエクスポートしますか。",
      choices: ["データインポートウィザード","データローダー","データエクスポートウィザード","マンスリーエクスポートサービス"],
      answers: [1],
      explanation: `データローダーは特定のクエリ条件に基づいてSalesforceからデータをエクスポートするために適したツールです。管理者は過去90日間にクローズした商談のような特定のデータセットを選択し、必要な項目(商談名、ID、完了予定日、金額)を含むファイルをエクスポートできます。
        ※ データインポートウィザードは、データをSalesforceにインポートするためのツールであり、エクスポート機能は提供していません。
        ※ Salesforceには[データエクスポートウィザード]という名称の機能は存在しません。
        ※ マンスリーエクスポートサービスは組織データの定期的なバックアップを提供しますが、特定の商談データを条件付きでエクスポートする機能はありません。`
    },
  {
      id: 80,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第81問",
      question: "カスタム項目のデータ型をテキストから選択リストに変更する場合、管理者はどのようなデータ損失を考慮する必要がありますか。2つ選びなさい。",
      choices: ["グローバル値セットの使用によるデータ損失はありません。","割り当てルールとエスカレーションルールは影響を受ける可能性があります。","データ損失を防ぐために、Visualforce参照が自動更新されます。","カスタム項目に基づくリストビューはすべて削除されます。"],
      answers: [1,3],
      explanation: `カスタム項目のデータ型をテキストから選択リストに変更すると、その項目を条件として使用している割り当てルールやエスカレーションルールに影響を及ぼす可能性があります。これは、選択リストにはテキスト項目とは異なり、事前に定義された選択肢があるため、ルールの条件が満たされなくなる可能性があるためです。
        カスタム項目のデータ型変更により、既存のリストビューが正しく機能しなくなる可能性があります。特にテキストデータから選択リストに変更した場合、既存データが新しい選択肢に一致しないことから、データが損失する可能性があります。データ損失した場合、そのカスタム項目に基づくリストビューは削除されます。
        ※ テキストから選択リストにデータ型を変更する場合、「グローバル選択リスト値セットを使用」ボタンは現れません。したがって、データ型の変更時にグローバル選択リスト値セットを使用することはできないため、このシチュエーションはあり得ません。
        ※ Visualforceページ、Apexコード、プロセス、フローなどで参照されているカスタム項目のデータ型は変更できません。つまり、これらが参照している場合、データ型の変更そのものができないため、自動更新されることもありません。`
    },
  {
      id: 81,
      category: "サービス&サポートアプリケーション",
      source: "tysonblog 第82問",
      question: "Cloud Kicks社のサポートエージェントは、顧客のケースを解決するためのリソースを探すのに多くの時間を費やしています。エージェントは、ケースページのレイアウトからドキュメントや類似のケースを見つける、より効率的な方法を必要としています。管理者はどのようにこの要件を満たすべきでしょうか。",
      choices: ["記事とデータカテゴリでナレッジを構成する。","人気のあるケースの解決策を取得するカスタムオブジェクトを作成する。","インタビューフローを使用して、ケースの詳細を取得する。","ユーザーをグローバル検索に誘導し、類似のケースを検索する。"],
      answers: [0],
      explanation: `ナレッジ(Knowledge)を使用することで、エージェントは簡単にドキュメントや解決策にアクセスできます。データカテゴリでナレッジ記事を分類し、検索を容易にします。また、記事へのアクセス制御も可能です。ケースページに統合することで、迅速に必要な情報を提供できます。
        ※ カスタムオブジェクトを作成して解決策を管理することも可能ですが、ナレッジのような高度な検索機能やカテゴリ分けの機能がありません。エージェントが必要な情報に迅速にアクセスするのが難しくなるため、効率的ではありません。
        ※ インタビュー形式の画面フローは、ケースの詳細情報を収集するためには有効ですが、エージェントが既存のドキュメントや類似のケースを見つけるためには適していません。この方法では、ケース解決に必要なリソースを迅速に見つけることができません。
        ※ グローバル検索を使用することは可能ですが、結果が広範であり、エージェントが必要な情報を迅速に見つけるのが難しい場合があります。ナレッジのような構造化された検索機能がないため、効率的ではありません。`
    },
  {
      id: 82,
      category: "自動化",
      source: "tysonblog 第83問",
      question: "Clod Kicks社には同じ画面に2つの質問が表示される画面フローがありますが、一度に必要なのは1つだけです。管理者は、必要な質問のみを表示するように求められています。管理者はこれをどのように完了させるべきでしょうか。",
      choices: ["[コンポーネントの表示を設定]を使用して、不要な質問を非表示にする。","シナリオごとに新しいバージョンのフローを使用する。","フロー画面で分岐を使用して、適切なシナリオを表示する。","適切な質問を表示するために、決定要素と新しい画面を使用する。"],
      answers: [0],
      explanation: `フローの画面コンポーネントで[コンポーネントの表示を設定]を使用することで、条件に基づいて特定の質問を表示または非表示にすることができます。これにより、必要な質問のみを表示し、一度に1つの質問だけを効率的に管理することができます。
        ※ シナリオごとに新しいフローバージョンを作成すると、管理が複雑になり、メンテナンスが難しくなります。また、同じフローの複数バージョンを使用するのは効率的ではありません。
        ※ フロー画面で決定要素を使用することにより、分岐処理をすることは可能ですが、条件付き表示を利用するほうが、画面要素の数を減らし、メンテナンスを簡単にするために効果的です。
        ※ 新しい画面を作成する必要はありません。既存の画面内で条件付き表示を設定することで、必要な質問のみを表示することが可能です。`
    },
  {
      id: 83,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第84問",
      question: "Cloud Kicks社(CK)は、特定の顧客に関する情報を取引先責任者に、靴やアクセサリーに関する情報をカスタム商品オブジェクトに保存します。CKの管理者は、取引先責任者が複数の商品に興味があることを表すために何を使用すべきでしょうか。",
      choices: ["ロール","ルックアップ検索条件項目","連結オブジェクト","数式項目"],
      answers: [2],
      explanation: `連結オブジェクトは、多対多の関係を管理するために使用されます。取引先責任者と商品が多対多の関係にある場合、連結オブジェクトを使用することで、取引先責任者が複数の商品に興味を持つことも、1つの商品に複数の取引先責任者が興味を持つことも可能になります。これにより、取引先責任者と商品の関係を適切に管理できます。
        ※ ロールはSalesforce内のユーザーの階層構造を管理するためのものであり、取引先責任者と商品の関係を表現するためには使用されません。
        ※ ルックアップ検索条件項目は、ルックアップ項目での検索時に条件をカスタマイズしてデータを絞り込むために使用されます。これは関連レコードの選択をサポートしますが、取引先責任者が複数の商品に興味を持つことを表現するためには直接的に関連しません。
        ※ 数式項目は、他の項目の値を基に計算された結果を表示するためのものであり、データの関係を表現するためには使用されません。取引先責任者と商品の多対多の関係を示すためには適していません。`
    },
  {
      id: 84,
      category: "自動化",
      source: "tysonblog 第85問",
      question: "Northern Trail Outfitters社では、新規取引先が作成されたときに自動的に項目値を設定する新しいフローがあります。このフローはプロセスによって起動されますが、フローが正しく動作しません。問題を特定するために、管理者は何をすべきでしょうか。",
      choices: ["フロービルダーのデフォルトのデバッグ機能を使用する。","ログインレベルでデバッグログを確認する。","[設定変更履歴の参照]を表示し、エラーを確認する。","[メールログ]を設定し、送信エラーログを確認する。"],
      answers: [0],
      explanation: `フロービルダーのデバッグ機能を使用することで、フローの実行中に発生する問題を直接確認できます。この機能はフローのステップごとに実行状況を追跡し、問題のある箇所を特定するのに非常に役立ちます。特に入力変数の設定や処理の詳細をリアルタイムに確認できるため、失敗したフローのトラブルシューティングに最適です。
        ※ デバッグログは主にユーザー、Apexクラス、およびApexトリガーに関連するイベントの監視に使用されます。デバッグログではフローの問題を特定することはできません。
        ※ 設定変更履歴は、組織内で行われた設定変更を追跡するためのものであり、フローの実行中に発生したエラーや問題を特定することはできません。
        ※ メールログはSalesforceから送信されたメールのログを記録するものであり、フローやプロセスの実行に関連するエラーや問題の特定には使用できません。メールの送信に関する情報のみを提供します。`
    },
  {
      id: 85,
      category: "セールス&マーケティングアプリケーション",
      source: "tysonblog 第86問",
      question: "Ursa Major Solar社は、クロスセルの商談タイプの案件が減少していることに気づいており、組織内の専門家チームとすべてのクロスセル商談を共有したいと考えています。会社にはさまざまなロールがあり、商談の組織全体のデフォルトは非公開に設定されています。管理者はこれをどのように実現すればよいですか。",
      choices: ["専門家チームを公開グループに追加し、[条件に基づく共有ルール]でレコードへのアクセス権を付与する。","商談の組織全体のデフォルトを[非公開]から[公開/参照・更新可能]に変更し、専門家チームのアクセス権を開放する。","テリトリー管理を有効にし、専門家チームを同じテリトリーに割り当て、手動共有でレコードにアクセスできるようにする。","専門家チームに新しいロールを作成し、[レコード所有者に基づく共有ルール]でレコードへのアクセス権を付与する。"],
      answers: [0],
      explanation: `専門家チームを公開グループに追加し、条件に基づく共有ルールを使用することで、特定の条件(この場合はクロスセル商談タイプ)に一致するレコードを共有できます。これにより、商談の組織全体のデフォルトを変更することなく、必要な商談のみを専門家チームと共有できます。
        ※ 商談の組織全体のデフォルトを変更すると、専門家チームだけでなく、組織内のすべてのユーザーがすべての商談にアクセスできるようになります。これでは、非公開にしたい他の商談のデータも公開されてしまうため、セキュリティ上のリスクがあります。
        ※ テリトリー管理は、特定の地域や市場に基づいて取引先と商談を管理するためのもので、特定の商談タイプ(クロスセル商談)の共有には適していません。
        ※ レコード所有者に基づく共有ルールは、特定のレコード所有者が持つすべてのレコードを共有するためのものであり、特定の商談タイプ(クロスセル商談)のみを共有するためには適していません。また、新しいロールを作成することも複雑すぎます。`
    },
  {
      id: 86,
      category: "設定とセットアップ",
      source: "tysonblog 第87問",
      question: "AW Computing社の管理者は、Salesforceにログインできないユーザーと作業しています。ユーザーがログインできない原因を特定するために、管理者は何をすべきでしょうか。",
      choices: ["セキュリティトークンを確認する。","パスワード履歴を確認する。","パスワードポリシーを確認する。","ログイン履歴を確認する。"],
      answers: [3],
      explanation: `ログイン履歴は、ユーザーがログインを試みた日時、使用したIPアドレス、ログインの成否、ログイン失敗の理由などを含む詳細情報を提供します。この情報を調べることで、管理者はユーザーがログインできない具体的な理由(例えば、パスワードが間違っている、アカウントがロックされている、IPアドレスが制限されているなど)を特定し、適切な対策を講じることができます。
        ※ セキュリティトークンは、Salesforceに外部アプリケーションからアクセスする際に必要なものであり、直接ログインの問題には関係ありません。
        ※ パスワード履歴は、過去に使用されたパスワードを保存しておくことで、新しいパスワード設定時に再利用を防ぐための機能です。しかし、管理者が具体的な過去のパスワードを直接確認することはできません。したがって、ユーザーがログインできない問題の原因を特定するには役立ちません。
        ※ パスワードポリシーは、パスワードの複雑さや有効期限、履歴などの要件を設定するもので、セキュリティを強化するためのものです。ユーザーがログインできない原因を特定するための手段にはなりません。`
    },
  {
      id: 87,
      category: "サービス&サポートアプリケーション",
      source: "tysonblog 第88問",
      question: "Cloud Kicks社では、公開されているホームページにアクセスしながら、顧客が自分のケースを作成できるようにしたいと考えています。管理者は何を推奨すべきでしょうか。",
      choices: ["SMS 送信","Web-to-ケース","メール-to-ケース","オムニチャネル"],
      answers: [1],
      explanation: `Web-to-ケースは、顧客がWebフォームを通じてケースを作成できるSalesforceの機能です。公開されているホームページにWeb-to-ケースフォームを設置することで、顧客は直接自分のケースを作成することができます。この方法は、簡単に設定でき、顧客が自分の問題や問い合わせを簡単に報告できるようにするために最適です。
        ※ SMS送信は顧客へのメッセージングツールであり、ホームページから顧客が自分でケースを作成する機能ではありません。SMSは主に顧客とのコミュニケーションやマーケティングキャンペーンに使用され、ケース作成には関係しません。
        ※ メール-to-ケースは、顧客がメールを送信することでケースを作成する機能です。この機能は、顧客がホームページ上で直接ケースを作成する方法としては適していません。
        ※ オムニチャネルは、エージェントに作業項目を自動で割り当てるSalesforceの機能です。直接的にホームページ上でケースを作成する機能ではありません。`
    },
  {
      id: 88,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第89問",
      question: "Ursa Major Solar社の管理者は、作業項目とプロジェクトというカスタムオブジェクトのリレーションシップを主従関係から参照関係に変更するよう求められました。管理者がこの要件を満たすことを妨げる可能性のあるシナリオはどれですか。",
      choices: ["レコードの保存するために参照関係が必要です。","主オブジェクトに積み上げ集計項目が含まれている。","結合オブジェクトは参照関係を作成するために必要です。","すべてのレコードの参照関係に値が含まれている必要がある。"],
      answers: [1],
      explanation: `積み上げ集計項目は、主従関係においてのみ利用可能です。もし主オブジェクトに積み上げ集計項目が存在する場合、リレーションシップを参照関係に変更することはできません。したがって、積み上げ集計項目があることが、リレーションシップの変更を妨げる可能性があります。
        ※ レコード保存時の制約は今回のシナリオと関係ありません。また、リレーションシップを変更するために参照関係ではありません。
        ※ 結合オブジェクトは、多対多のリレーションシップを作成するために使用されますが、参照関係のリレーションシップを作成するためには必要ありません。このシナリオはリレーションシップの変更に影響を与えません。
        ※ 参照関係から主従関係へのリレーションの変更には、すべてのレコードの参照項目に値が含まれている必要がありますが、主従関係から参照関係へのリレーションの変更の場合には、必要ではありません。`
    },
  {
      id: 89,
      category: "設定とセットアップ",
      source: "tysonblog 第90問",
      question: "Cloud Kicks社は、AppExchangeからアプリケーションを試して、そのアプリケーションがニーズに合っていることを確認したいと考えています。管理者が提案すべきのオプションはどれですか。2つ選びなさい。",
      choices: ["本番環境でテスト運用する。","Trailhead Playgroundにダウンロードする。","Sandboxにインストールする。","エディションの互換性をチェックする。"],
      answers: [2,3],
      explanation: `Sandbox環境でアプリをインストールすることで、アプリケーションの機能を本番環境に影響を与えることなく安全にテストすることができます。これは、新しいアプリやアップデートが組織内の既存のプロセスやカスタマイズとどのように連携するかを確認する最適な方法です。
        アプリケーションがCloud Kicks社が使用しているSalesforceのエディションと互換性があるかどうかを確認することは重要です。これにより、インストール後にアプリケーションが正常に機能するかどうかを保証します。
        ※ AppExchangeのアプリケーションは通常、本番環境で直接テストすることは推奨されません。本番環境で直接テストを行うと、未テストのアプリが既存のデータやプロセスに不具合を引き起こす可能性があります。
        ※ Trailhead Playgroundは学習と試験目的に特化した環境であり、商業的なビジネスアプリケーションの完全なテストには適していません。本格的なビジネス環境のシミュレーションにはSandboxの使用が適しています。`
    },
  {
      id: 90,
      category: "自動化",
      source: "tysonblog 第91問",
      question: "Cloud Kicks社の管理者が、特定の条件を満たすレコードを検索し、それらのレコードの値を後でフローで使用するために変数に格納する必要があるフローを構築しています。管理者はどのフロー要素を追加すべきですか。",
      choices: ["割り当て","レコードを取得","レコードを作成","レコードを更新"],
      answers: [1],
      explanation: `この要素は条件に基づいてレコードを検索し、その結果を変数に保存するために使用されます。これにより、後続のフロー部分でそのデータを参照または操作できるようになります。
        ※ 割り当て要素は、変数やコレクション変数に値を設定するために使用されますが、レコードの検索や値の取得には使われません。
        ※ レコードを作成する要素は、新しいレコードをSalesforceに作成する際に使用され、既存のレコードを検索するためのものではありません。
        ※ レコードを更新する要素は、既存のレコードの項目を変更する際に使用されます。この要素は、レコードの検索やそのデータを変数に保存するためには使われません。`
    },
  {
      id: 91,
      category: "サービス&サポートアプリケーション",
      source: "tysonblog 第92問",
      question: "Cloud Kicks社のカスタマーサクセス担当者が休暇に入り、複数のケースの所有者を変更する必要があります。この要求を満たすことができるのはどのユーザーですか。2つ選びなさい。",
      choices: ["取引先に参照権限を持つユーザー","担当者より上のマネージャーロールを持つユーザー","システム管理者プロファイルを持つユーザー","ケースの管理権限を持つユーザー"],
      answers: [1,2],
      explanation: `ロール階層で担当者より上位に位置するユーザーは、レコードの所有権を変更する権限を持っています。取引先所有者より上位に位置するユーザーには、取引先や関連するケースの所有権を変更する権限があります。
        システム管理者は全組織にわたる全てのレコードにアクセスできる最高権限を持っており、どのレコードの所有者でも変更することができます。
        ※ 参照権限のみでは、レコードの所有権を変更することはできません。所有権の変更には、さらに高いレベルの権限が必要です。
        ※ ケースの管理権限を持つユーザーは、ケースの参照、作成、編集、削除が可能ですが、所有権の変更を行うためには、取引先に対する「すべて変更」権限や、取引先所有者より上位のロールにいることが必要です。`
    },
  {
      id: 92,
      category: "データ管理&分析",
      source: "tysonblog 第93問",
      question: "Northern Trail Outfitters社の管理者は、割り当てられたライセンスと権限セットを追跡するためにスプレッドシートを使用しています。Salesforceでこれを追跡するには、どのような機能を使用すれはよいですか。",
      choices: ["ログイン履歴","Lightning 利用状況","ユーザーレポート","権限セットグループ"],
      answers: [1],
      explanation: `Lightning 利用状況には「有効ライセンス数」タブが含まれており、これを使用して有効ライセンス、割り当て済みライセンス、未割り当てのライセンスを監視できます。これにより、管理者はスプレッドシートを使用せずにライセンスの状態を効率的に追跡できます。
        ※ ログイン履歴はユーザーのログイン試行と成功を記録する機能であり、ライセンスや権限セットの追跡には利用できません。この機能はセキュリティとアクセス監視のために使用されます。
        ※ Salesforceには「ユーザーレポート」という特定の機能は存在しません。
        ※ 権限セットグループは複数の権限セットをグループ化し、ユーザーに一括で割り当てるための機能です。これにより、権限セットの管理が簡素化されますが、割り当てられたライセンスや権限セットの追跡には直接役立ちません。`
    },
  {
      id: 93,
      category: "自動化",
      source: "tysonblog 第94問",
      question: "Ursa Major Solar社は、経費報告書の提出、振り分け、承認を簡素化するために、ユーザーを支援するガイド付き経費報告書プロセスを作りたいと考えています。このソリューションを構築するために、管理者はどのツールを使用する必要がありますか。2つ選びなさい。",
      choices: ["入力規則","フロービルダー","承認プロセス","クイックアクション"],
      answers: [1,2],
      explanation: `フロービルダーを使用すると、複雑なビジネスプロセスを自動化し、ユーザーをステップバイステップでガイドするインタラクティブな画面フローを作成できます。ガイド付き経費報告書プロセスを構築するために最適なツールです。
        承認プロセスは、レコードが承認されるまでのステップを自動化するために使用されます。経費報告書の提出から承認までのフローを管理し、効率化することができます。
        ※ 入力規則は、ユーザーがレコードにデータを入力する際に適用されるルールであり、データの一貫性と正確性を確保するためのものです。ガイド付きプロセスの構築には直接関与しません。
        ※ クイックアクションは、ユーザーが特定のアクションを迅速に実行できるようにするためのショートカットです。特定のアクションを実行するのには便利ですが、ガイド付きプロセスの全体を構築するためのツールではありません。`
    },
  {
      id: 94,
      category: "自動化",
      source: "tysonblog 第95問",
      question: "管理者が、最近のアップデートの一環として作成されたフローを更新するよう求められました。管理者が編集のためにフローを開くと、フロービルダーのツールボックスには4つの要素しか表示されません。割り当て要素、決定要素、レコードを取得要素、ループ要素です。この原因は何でしょうか。",
      choices: ["フローは画面フローである。","フローが保存前更新を実行するフローである。","フローバージョンが無効である。","フローバージョンが有効である。"],
      answers: [1],
      explanation: `保存前更新フローは、レコードの保存直前に特定の項目の更新を行うために使用されるため、使用できる要素が限定されています。具体的には、割り当て要素、決定要素、レコードを取得要素、ループ要素のみが使用可能です。これにより、データベースへの追加の保存操作を避け、処理速度を高めることができます。このフローの特徴は、レコードが保存される前にのみアクセスできる項目を更新するため、他のアクションや関連レコードの更新は行いません。
        ※ 画面フローでは、ユーザーとの対話をサポートするために多様なビジュアルと非ビジュアルの要素を使用できます。これには画面、割り当て、決定、レコードの取得、ループなどが含まれますが、それ以外にも多くの機能的要素が利用可能です。
        ※ フローバージョンが無効である場合、そのフローは実行されないだけであり、ツールボックスに表示される要素数には影響しません。無効なフローでも、フロービルダーで編集は可能であり、ツールボックスに表示される要素の数は変わりません。
        ※ フローバージョンが有効であること自体は、ツールボックスに表示される要素数に影響を与えません。フローが有効であっても、他の要素が制限される理由にはなりません。`
    },
  {
      id: 95,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第96問",
      question: "Cloud Kicks社には靴という名前のカスタムオブジェクトがあります。管理者は、取引先と靴の間にリレーションシップが作成されたときに、靴のレコードが孤立しないようにすることを求められています。この要件を満たすために、管理者は何をすべきでしょうか。",
      choices: ["間接参照関係を作成する。","カスタム暗号化項目を作成する。","取引先階層を作成する。","主従関係を作成する。"],
      answers: [3],
      explanation: `主従関係は、親オブジェクト(取引先)と子オブジェクト(靴)との間に強いリンクを作成します。この関係では、親レコードが削除されると、関連する子レコードも自動的に削除されます。これにより、靴のレコードが孤立することを防ぎ、このシナリオの要件を満たします。
        ※ 間接参照関係は、外部オブジェクトを親の標準またはカスタムオブジェクトに結び付けるために使用され、通常、Salesforce外のデータを参照するために使用されます。このシナリオでは、取引先と靴の間のリレーションシップを作成するためには適していません。
        ※ カスタム項目のデータ型である[テキスト (暗号化)]は、データのセキュリティとプライバシーを強化するために使用されますが、リレーションシップの管理やレコードが孤立するのを防ぐための機能は提供しません。取引先と靴の間のリレーションシップを保つためには適していません。
        ※ 取引先階層は、取引先レコード間での階層的な関係を構築するもので、主に親会社と子会社の関係を表します。靴というカスタムオブジェクトとの直接的な関連付けには使用されません。`
    },
  {
      id: 96,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第97問",
      question: "Ursa Major Solar社では、取引先レコードに2つの異なるページレイアウトを使用しています。1つのページレイアウトは顧客取引先に関する項目を反映し、もう1つのページレイアウトはパートナー取引先に関する項目を含んでいます。 管理者は、顧客取引先ページレイアウトを営業およびサポートユーザーに割り当て、パートナー取引先ページレイアウトをパートナー管理チームに割り当てました。この要件を満たすために、管理者は何を構成すべきでしょうか。",
      choices: ["公開グループと[条件に基づくの共有ルール]を使用して、顧客取引先をパートナーチームと共有する。","パートナー管理チームのメンバーを、顧客取引先のデフォルトの取引先チームに追加する。","パートナーチームのプロファイルで、顧客取引先の作成、参照、編集、および削除のアクセス権を付与する。","顧客取引先とパートナー取引先のレコードタイプを1つずつ作成する。"],
      answers: [3],
      explanation: `レコードタイプを作成することで、異なるページレイアウトを特定のユーザーに割り当てることができます。顧客取引先とパートナー取引先に対してそれぞれのレコードタイプを作成し、それに基づいてページレイアウトを割り当てることで、営業およびサポートユーザーには顧客取引先ページレイアウトを、パートナー管理チームにはパートナー取引先ページレイアウトを適切に表示させることができます。
        ※ 共有ルールや公開グループはレコードのアクセス権を管理するためのもので、ページレイアウトの割り当てには直接関係ありません。このシナリオでは、ページレイアウトの割り当て方法が問題ですので、この選択肢は適していません。
        ※ 取引先チームは特定の取引先レコードに対するアクセス権を設定するために使用されますが、ページレイアウトの割り当てには関係しません。このシナリオでは、ユーザーのプロファイルやレコードタイプを使用してページレイアウトを割り当てる必要があります。
        ※ プロファイルの権限設定は、ユーザーが取引先に対してどの操作を行えるかを制御しますが、ページレイアウトの割り当てには直接関係しません。この要件では、異なるページレイアウトをユーザーに割り当てる方法が必要です。`
    },
  {
      id: 97,
      category: "セールス&マーケティングアプリケーション",
      source: "tysonblog 第98問",
      question: "セールスフェーズの設定フローでカスタマイズ可能なオブジェクトはどれですか。2つ選びなさい。",
      choices: ["リード","キャンペーン","商談","キャンペーンメンバー"],
      answers: [0,2],
      explanation: `セールスフェーズの設定フローでカスタマイズ可能なオブジェクトはリードと商談です。このフローでは、リードの状況と商談のフェーズをカスタマイズして、セールスプロセス全体を管理しやすくします。リードがどのように商談に変換されるかを把握し、各フェーズに適したカスタマイズを行うことが可能です。`
    },
  {
      id: 98,
      category: "セールス&マーケティングアプリケーション",
      source: "tysonblog 第99問",
      question: "Universal Containers社の管理者は、商談が$500,000に達したときに営業部長にアラートを出す簡単な方法が必要です。管理者は、この要件を満たすために何を構成する必要がありますか。",
      choices: ["ホームページ上の強調表示パネルコンポーネント","Kanban ビューの商談警告","金額の大規模商談アラートの設定","商談アップデートリマインダーを有効にする"],
      answers: [2],
      explanation: `大規模商談アラートの設定を使用すると、商談の金額が特定の値に達したときに自動的に通知を送ることができます。例えば、商談が$500,000に達したときに営業部長にメールアラートを送信するよう設定することが可能です。これにより、重要な商談が進行中であることをタイムリーに把握できます。
        ※ 強調表示パネルコンポーネントは、レコードの主要項目やページレベルのアクションを表示するためのもので、特定の条件に基づいて自動的にアラートを出す機能はありません。このコンポーネントは、主要情報の迅速な参照やアクションの実行を支援するために使用されます。
        ※ Kanban ビューは視覚的に商談の進捗を追跡するのに役立ちますが、特定の金額に達した際に自動的にアラートを送る機能は含まれていません。このビューは主に進捗の視覚化に利用されます。
        ※ 商談アップデートリマインダーは、商談の更新を促すためのリマインダー機能であり、特定の金額に達したときに自動的にアラートを出す機能ではありません。この機能は主にマネージャーがチームの進行中の商談を定期的に確認できるようにするためのものです。`
    },
  {
      id: 99,
      category: "設定とセットアップ",
      source: "tysonblog 第100問",
      question: "Universal Containers社のユーザーが退社しました。管理者は後任のユーザーのために新しいユーザーを作成する必要がありますが、利用可能なユーザーライセンスをすべて割り当てています。新しいユーザーのためにユーザーライセンスを解放するために、管理者は何をすべきですか。",
      choices: ["元従業員のユーザーレコードを無効化する。","元従業員のユーザーレコードを削除する。","元従業員のユーザーレコードを凍結する。","元従業員のユーザーレコードを新しいユーザーに変更する。"],
      answers: [0],
      explanation: `ユーザーを無効化することで、そのユーザーはSalesforceにログインできなくなり、そのユーザーライセンスは解放されます。この方法により、新しいユーザーのためにライセンスを再利用することができます。
        ※ Salesforceではユーザーレコードを完全に削除することはできません。ユーザーアカウントのデータや履歴を保持するために、ユーザーを無効化するのが一般的な方法です。
        ※ ユーザーを凍結すると、そのユーザーは一時的にログインできなくなりますが、ライセンスは解放されません。凍結は主にセキュリティ対策として使用されますが、ライセンス管理の目的には適していません。
        ※ ユーザーレコードを直接新しいユーザーに変更することは推奨されません。元のユーザーのデータと関連する履歴が新しいユーザーに混在することを避けるためです。新しいユーザーを作成する前に、元のユーザーを無効化してライセンスを解放するのが正しい方法です。`
    },
  {
      id: 100,
      category: "セールス&マーケティングアプリケーション",
      source: "tysonblog 第101問",
      question: "Cloud Kicks社では、商談の組織全体のデフォルトが非公開に設定されています。管理者はどの機能を使用して、商談レコードにアクセスできるようにする必要がありますか。2つ選びなさい。",
      choices: ["共有セット","ロール階層","プロファイル","共有ルール"],
      answers: [1,3],
      explanation: `ロール階層を使用することで、組織内の上位ロールにあるユーザーが、下位ロールのユーザーが所有するレコードに対してアクセス権を持つことができます。商談が非公開に設定されている場合、ロール階層を通じて上位の管理者や営業部門のディレクターなどがそれらの商談レコードにアクセスできるようになります。
        共有ルールを使用すると、組織全体のデフォルト設定が非公開であっても、特定の条件に基づいてユーザーグループやロールにレコードへの追加のアクセス権を付与することができます。例えば、特定の地域の営業チームや特定の製品ラインを扱うチームに限定して商談レコードのアクセスを許可するなどが可能です。
        ※ 共有セットは、Experience Cloudサイトで顧客ユーザーが特定のレコードにアクセスできるようにするための機能です。商談レコードの内部共有には使用されません。
        ※ プロファイルはユーザーがアクセスできるオブジェクトレベルの権限を設定するために使用されますが、レコードレベルのアクセスを直接設定する機能は提供していません。プロファイルでは、オブジェクトに対する「参照」や「編集」といった権限は設定できますが、個々のレコードへのアクセス権は設定できません。`
    },
  {
      id: 101,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第102問",
      question: "Ursa Major Solar社は、設置したすべてのパネルに1年間の保証を提供しています。設置の詳細は、「設置」というカスタムオブジェクトに保存され、保証情報も含まれます。設置レコードは、設置者がモバイルアプリから作成します。設置が遅れたり問題が発生した場合、顧客満足度を向上させるために、顧客に長期保証が提供されることがあります。Salesforceをどのように構成して保証の有効期限を記録すればよいでしょうか。",
      choices: ["保証有効期限項目のデフォルト値として数式を使用する。","購入日から1年後を表示する数式項目を作成する。","有効期限項目が入力されることを確認する入力規則を追加する。","保証有効期限項目をモバイルページレイアウトに含める。"],
      answers: [0],
      explanation: `保証の有効期限を自動計算することで、入力ミスを防ぐことができます。ただし、設置日がカスタム日付型項目の場合は、デフォルト値の数式で直接参照できません。この場合、デフォルト値として日付項目を参照するのではなく、DATE(YEAR(TODAY()) + 1, MONTH(TODAY()), DAY(TODAY()))を使用してレコード作成日から1年後の日付を設定するのが実現可能です。 なぜこれが適切かYEAR(TODAY()) + 1: 今日の日付の年を取得し、それに1年を加えます。MONTH(TODAY()): 今日の日付の月を取得します。DAY(TODAY()): 今日の日付の日を取得します。DATE: これらの値を組み合わせて新しい日付を生成します。
        ※ 数式項目は動的にカスタム日付項目の購入日＋1年を計算して表示できますが、この値はユーザーが編集できません。「有効期限をあとから変更する可能性」に対応できないため、要件を満たしません。
        ※ 入力規則を追加しても、ユーザーが手動で有効期限を入力しなければならず、計算が自動化されません。これではエラーが発生する可能性が高く、効率的とはいえません。
        ※ Lightning Experienceでは、ページレイアウトはデスクトップとモバイルの両方で同じレイアウトが使用されます。したがって、モバイル専用のページレイアウトを作成する必要はありません。また、保証の有効期限を自動的に計算するための解決策にもなりません。`
    },
  {
      id: 102,
      category: "設定とセットアップ",
      source: "tysonblog 第103問",
      question: "Universal Containers社には、LinkedInのデータを表示するコンポーネントを持つ取引先責任者Lightningレコードページがあります。営業チームは、営業ユーザーが携帯電話を使用しているときにのみ、このコンポーネントを表示したいと考えています。[コンポーネントの表示を設定]をどのように構築すればよいですか。2つ選びなさい。",
      choices: ["ユーザー>プロファイル>プロファイル名=営業ユーザー","Form Factor=電話","ビュー = 電話/タブレット","ユーザー>ロール>ロール名=営業ユーザー"],
      answers: [0,1],
      explanation: `この条件は、特定のプロファイル(この場合は「営業ユーザー」)を持つユーザーに対してコンポーネントを表示するように設定するために使用します。営業チームのメンバーが対象となるため、この条件を設定することが要件に適合します。
        この条件は、デバイスの形状要因(Form Factor)が「電話」である場合にのみコンポーネントを表示するよう設定します。これにより、ユーザーが携帯電話を使用している場合のみコンポーネントが表示され、要件に合致します。
        ※ 条件種別として「ビュー」という項目はありません。コンポーネントの表示を制御するための条件としては使用できません。
        ※ 営業ユーザーはロールではなくプロファイルであるため、この選択肢は適切ではありません。`
    },
  {
      id: 103,
      category: "データ管理&分析",
      source: "tysonblog 第104問",
      question: "Cloud Kicks社の幹部から、ダッシュボードに不正確なデータが表示されているとの報告がありました。管理者はソースレポートを変更していることを発見しました。ソースレポートの整合性を維持するために、管理者が取るべきアクションはどれですか。2つ選びなさい。",
      choices: ["参照アクセス権がある新しいレポートフォルダを作成する。","ダッシュボードをユーザーの非公開フォルダに移動する。","ダッシュボードのレポートを参照専用フォルダに移動する。","ダッシュボードを動的ダッシュボードに変更する。"],
      answers: [0,2],
      explanation: `新しいレポートフォルダを作成し、参照アクセス権のみを付与することで、レポートの編集を防ぎ、ソースレポートの整合性を維持することができます。これにより、ユーザーはレポートを見ることはできますが、変更することはできません。
        レポートを参照専用フォルダに移動することで、ユーザーがレポートを編集できなくなり、ソースレポートの整合性を維持することができます。参照専用フォルダでは、レポートを閲覧することはできますが、編集や削除はできません。
        ※ ダッシュボードを非公開フォルダに移動しても、ソースレポートの整合性を維持することにはなりません。非公開フォルダはダッシュボードへのアクセスを制限しますが、ソースレポートの編集を防ぐことはできません。
        ※ 動的ダッシュボードは、複数のユーザーが同じダッシュボードを使用して、自分のデータを表示できるようにする機能です。これはレポートの整合性には関係がなく、ソースレポートが編集されるのを防ぐことはできません。`
    },
  {
      id: 104,
      category: "自動化",
      source: "tysonblog 第105問",
      question: "Cloud Kicks社の営業マネージャーは、従業員の休暇を承認しています。管理者は、営業部長が休暇で不在の間、予備マネージャーがこれらの申請を見て対応できるようにするよう求められました。管理者は、この要件を満たすために何を使用する必要がありますか。",
      choices: ["委任された承認者","2段階の承認プロセス","承認履歴の関連リスト","委任された管理者"],
      answers: [0],
      explanation: `委任された承認者を設定することで、営業部長が休暇中でも予備マネージャーが休暇申請を確認し、対応することができます。委任された承認者は、指定された期間中に本来の承認者の代わりに承認作業を行う権限を持ちます。
        ※ 2段階の承認プロセスは、休暇申請が2人以上の承認者によって承認されるように設定するものであり、営業部長が不在の場合に予備マネージャーが対応するための解決策ではありません。
        ※ 承認履歴の関連リストは、承認プロセスの履歴を表示するためのものであり、休暇申請の対応や承認を他のユーザーに委任するための機能ではありません。
        ※ 委任された管理者は、Salesforce管理者の権限を特定のユーザーに一時的に委任する機能ですが、休暇申請の承認を代行するためのものではありません。`
    },
  {
      id: 105,
      category: "セールス&マーケティングアプリケーション",
      source: "tysonblog 第106問",
      question: "Universal Containers社は、商談の非公開の共有モデルを持ち、商談チームを使用しています。条件に基づく共有ルールは使用していません。Universal Containers社の営業担当者が退職し、そのユーザーレコードが無効化されました。後日、その担当者が同じ職場で再雇用されました。Salesforce管理者は、古いユーザレコードを有効化します。そのユーザーは、同じデフォルトの商談チームに追加されますが、退職前にそのユーザーが担当していたのと同じレコードを見ることができなくなります。考えられる原因は何ですか。",
      choices: ["レコードがユーザーと手動で共有された。","商談レコードのフェーズが不成立(Closed Lost)に変更された。","ユーザーを無効化したときに権限セットが削除された。","商談レコードのレコードタイプが変更された。"],
      answers: [0],
      explanation: `退職前に商談レコードがそのユーザーと手動で共有されていた場合、その共有設定はユーザーが無効化されたときに無効になります。ユーザーが再有効化された後、その手動共有の設定は自動的に復元されないため、ユーザーは以前のようにレコードにアクセスできなくなります。
        ※ 商談レコードのフェーズが変更されたとしても、元々のアクセス権限や共有設定が変更されるわけではありません。フェーズの変更はレコードへのアクセスに影響を与えないため、この理由ではありません。
        ※ ユーザーを無効化しても、権限セットが自動的に削除されるわけではありません。ユーザーが再有効化された場合、権限セットもそのまま引き継がれます。権限セットの削除がアクセス権限の原因となることは考えにくいです。
        ※ レコードタイプの変更も、レコードのアクセス権限に直接影響を与えません。商談レコードのレコードタイプが変更されたとしても、元のユーザーのアクセス権限が失われる理由とはなりません。`
    },
  {
      id: 106,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第107問",
      question: "別のシステムからレコードをインポートして更新する場合、管理者は識別子として何を使用すべきですか。",
      choices: ["リッチテキスト項目","レコードID","自動採番項目","外部ID"],
      answers: [3],
      explanation: `外部IDは、別のシステムで使用されている一意の識別子をSalesforceに取り込むための項目です。外部IDを使用すると、他のシステムとSalesforceのレコードを一致させることができ、データのインポートや更新が容易になります。特に、外部システムとSalesforceを統合する場合に非常に有効です。
        ※ リッチテキスト項目は、HTML形式のテキストを保存するためのものであり、識別子として使用するのには適していません。
        ※ レコードIDは、既存のSalesforceレコードに自動的に割り当てられるユニークな識別子ですが、外部システムからのインポートには適していません。
        ※ 自動採番項目はレコードが作成されるたびにSalesforceによって自動でシーケンシャルな番号が割り当てられる項目ですが、これは外部システムとの間で同期を取るための識別子としては適切ではありません。`
    },
  {
      id: 107,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第108問",
      question: "Cloud Kicks社の管理者は、リードのカスタム選択リスト項目を用意していますが、リードが変換されたときに取引先責任者にこの項目がありません。これらの値が入力されていることを確認するために、管理者が行うべき作業はどれですか。2つ選びなさい。",
      choices: ["取引先責任者にカスタム選択リスト項目を作成する。","入力規則で選択リストの値を更新する。","リードの選択リスト項目を取引先責任者の選択リスト項目に対応付けする。","リードオブジェクトの選択リスト項目を必須に設定する。"],
      answers: [0,2],
      explanation: `リードが取引先責任者に変換される際に、リードのカスタム選択リスト項目の値を取引先責任者レコードに対応付けする必要があります。そのためには、取引先責任者に同じカスタム選択リスト項目を作成する必要があります。そうすることで、リードの選択リストの値を取引先責任者に引き継ぐことができます。
        リードが変換される際に、リードの選択リスト項目を取引先責任者の選択リスト項目に対応付けする設定が必要です。これにより、リードの選択リストの値が取引先責任者レコードに適切に引き継がれます。
        ※ 入力規則は、レコードの保存時に特定の条件を満たすことを強制するために使用されますが、リードのカスタム選択リスト項目を取引先責任者に対応付けするための手段としては適していません。入力規則は、値の自動的な更新や転送には使われません。
        ※ リードオブジェクトの選択リスト項目を必須にすることは、リードが変換されたときに取引先責任者レコードにこの値を引き継ぐことを保証するものではありません。この設定はリードの作成や編集時にその項目に値が入力されていることを保証するだけです。`
    },
  {
      id: 108,
      category: "設定とセットアップ",
      source: "tysonblog 第109問",
      question: "アプリケーションランチャーでタブを非表示にしたり、アプリでタブを利用可能にした場合に、ユーザーがこのタブの下にあるレコードを表示できるようにするプロファイルの設定はどれですか。",
      choices: ["オブジェクト権限","アプリケーション権限","組織全体のデフォルト","タブの設定"],
      answers: [3],
      explanation: `タブの設定は、特定のタブの表示オプション[デフォルトで表示]、[デフォルトで非表示]、[タブを隠す]を設定するものであり、プロファイルごとにタブの表示を制御します。ユーザーがタブを[デフォルトで非表示]にしても、そのオブジェクトに対する権限がある場合、そのタブに関連するレコードにアクセスできます。したがって、タブを[デフォルトで非表示]にしながらも関連するレコードを閲覧可能にするためには、この設定を使用します。
        ※ オブジェクト権限はユーザーが特定のオブジェクトのレコードに対して実行できる操作(参照、作成、編集、削除)を定めますが、この問題文のコンテキストでは、タブが非表示にされてもその下にあるレコードにアクセスできるようにするための直接的な手段ではありません。
        ※ アプリケーション権限はユーザーが特定のSalesforceアプリケーションにアクセスできるかどうかを決定しますが、オブジェクトへのアクセス権や個別のタブの表示設定には直接関与しません。
        ※ 組織全体のデフォルトは、特定のオブジェクトのレコードが他のユーザーとどのように共有されるかを決定します。これによりデータの可視性が決まりますが、タブの表示設定とは直接的な関係がありません。`
    },
  {
      id: 109,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第110問",
      question: "Northern Trail Outfitters社の営業担当者は、商談の[確度 (%)]項目の値を変更する方法を求めています。この要求に応えるために、管理者は何を提案すればよいでしょうか。",
      choices: ["新しいフェーズの選択リスト値を定義する。","商談にカスタム項目を作成する。","売上予測を構成する。","ページレイアウトで項目を編集可能にする。"],
      answers: [3],
      explanation: `商談の[確度 (%)]項目の値を変更するには、ページレイアウトでこの項目を編集可能に設定する必要があります。これにより、営業担当者は[確度 (%)]項目の値を直接変更できるようになります。
        ※ 確度(%)は商談フェーズに基づいて自動的に設定されるため、新しいフェーズの選択リスト値を定義しても直接的に[確度 (%)]項目の値を変更する方法にはなりません。これは確度を設定する方法ではなく、フェーズを追加するだけです。
        ※ カスタム項目を作成しても、営業担当者が求めている既存の[確度 (%)]項目の値を変更することはできません。新しいカスタム項目は別のデータを保持するためのものであり、確度の値を調整する方法ではありません。
        ※ 売上予測の構成は、商談のフェーズや収益の予測に関わる設定であり、直接的に商談の[確度 (%)]項目の値を変更する方法ではありません。`
    },
  {
      id: 110,
      category: "自動化",
      source: "tysonblog 第111問",
      question: "Cloud Kicks社では、7日以上開いているケースの所有者を変更する必要があります。管理者はこの要件をどのように対応すればよいですか。",
      choices: ["自動レスポンスルール","入力規則","エスカレーションルール","割り当てルール"],
      answers: [2],
      explanation: `エスカレーションルールは、特定の条件を満たすケース(例えば、開かれてから一定の時間が経過したケース)を自動的にエスカレートするために使用されます。このルールを使用して、7日以上開いているケースの所有者を変更し、必要に応じて別のチームや担当者に割り当てることができます。
        ※ 自動レスポンスルールは、新しいケースやリードが作成された際に自動的に応答メールを送信するために使用されます。このルールは、既存のケースの管理や所有者の変更には使用されません。
        ※ 入力規則は、ユーザーがデータを入力する際にそのデータが特定の基準を満たしているかを検証するために使用されます。これは、ケースの所有者を自動的に変更するプロセスには適していません。
        ※ 割り当てルールは主に新しいレコードが作成された際に適切なユーザー、キューに割り当てるために使用されます。既存のケースの所有者を時間経過に基づいて変更するためには適していません。`
    },
  {
      id: 111,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第112問",
      question: "Ursa Major Solar社は、太陽光発電製品の売上を追跡するために商談を利用しています。同社には、異なるエネルギー市場に特化した2つの営業チームがあります。サービスチームもまた、商談を使用して設置を追跡したいと考えています。3つのチームはすべて、異なる項目とフェーズを使用する必要があります。管理者は、この要件をどのように構成する必要がありますか。",
      choices: ["セールスプロセスを3つ作成する。3つのレコードタイプと1つのページレイアウトを作成する。","セールスプロセスを1つ作成する。3つのレコードタイプと3つのページレイアウトを作成する。","セールスプロセスを3つ作成する。3つのレコードタイプと3つのページレイアウトを作成する。","セールスプロセスを1つ作成する。1つのレコードタイプと3つのページレイアウトを作成する。"],
      answers: [2],
      explanation: `Ursa Major Solar社の要件をまとめると以下の通りです。 異なるエネルギー市場に特化した2つの営業チームと1つのサービスチームの合計3チームあり、それぞれが商談を使用して異なる項目とフェーズで管理する必要がある。 Ursa Major Solar社の要件に基づき、管理者は以下のように構成する必要があります。 セールスプロセスの作成セールスプロセスは、営業サイクルを管理するために使用されるカスタマイズされた商談フェーズの値を持ちます。今回は、異なる商談フェーズを使用する必要があるため、3つの異なるセールスプロセスを作成します。これにより、各チームはそれぞれの営業プロセスに適したフェーズを使用できます。レコードタイプの作成商談レコードタイプには、セールスプロセスを設定することが必須です。各チームに対応する3つのセールスプロセスを紐づけるために、3つの商談レコードタイプを作成します。これにより、各レコードタイプがそれぞれのセールスプロセスに対応します。ページレイアウトの作成各チームは異なる項目を使用する必要があるため、3つの異なるページレイアウトを作成します。各ページレイアウトは、それぞれのレコードタイプに対応し、チームごとに必要な項目を表示します。`
    },
  {
      id: 112,
      category: "設定とセットアップ",
      source: "tysonblog 第113問",
      question: "管理者が、権限セットグループを含む管理パッケージをインストールしました。インストールされた権限セットグループには、いくつかのオブジェクトの削除権限が含まれておりますが、管理者は権限セットグループのユーザーがレコードを削除できないようにする必要があります。管理者は、削除権限を制御するために何をすべきでしょうか。",
      choices: ["権限セットグループとミュート権限セットを使用して、選択した権限をミュートする。","オブジェクトの削除権限が選択解除された新しい権限セットを作成する。","削除権限がユーザーに反映されないようにする新しいロールを作成する。","ユーザーのプロファイルを編集して、オブジェクトから削除権限を削除する。"],
      answers: [0],
      explanation: `ミュート権限セットは、権限セットグループによって付与された権限を無効にするために使用されます。この方法で、特定のオブジェクトに対する削除権限をミュートし、ユーザーがレコードを削除することができないようにすることができます。これは権限セットの粒度を細かく調整するための効率的な手法です。
        ※ 新しい権限セットを作成しても、既存の権限セットグループによって付与された権限が依然として有効である限り、削除権限を無効にすることはできません。権限セットグループ内で権限を管理するためには、ミュート権限セットを使用する必要があります。
        ※ ロールは組織内のデータアクセスと階層を管理するために使用されますが、特定の権限(特に削除権限など)を直接管理するものではありません。オブジェクトの権限を管理するためには権限セットまたはプロファイルの調整が適切です。
        ※ プロファイルを編集して削除権限を削除する方法もありますが、プロファイルは一般的に多くのユーザーに適用されるため、特定のユーザーグループに対する細かい制御には適していません。また、権限セットグループを使用している場合、プロファイルだけで制御するのは複雑です。`
    },
  {
      id: 113,
      category: "自動化",
      source: "tysonblog 第114問",
      question: "DreamHouse Realty社(DR)では、検査員が物件検査の結果を提出するためのフォームをExperience Cloudサイトで提供したいと考えています。この要件を満たすために、管理者がページに配置すべき機能はどれですか。",
      choices: ["関連リスト","自動起動フロー","レコードの詳細","画面フロー"],
      answers: [3],
      explanation: `画面フローは、ユーザーが対話的に情報を入力できるフォームを作成するための機能です。管理者は画面フローを使用して、検査員が物件検査の結果を入力し提出するためのフォームを作成できます。画面フローはカスタマイズ可能で、複数のステップや条件分岐を含むことができるため、この要件に最適です。
        ※ 関連リストは、特定のレコードに関連付けられた他のレコードやオブジェクトのリストを表示するために使用されます。これはデータの表示に適していますが、検査員が新しい情報を入力または提出するためのフォームとしては機能しません。
        ※ 自動起動フローは、特定の条件が満たされたときに自動的に実行されるフローです。ユーザーがフォームに入力するためのインターフェースとしては適していません。
        ※ レコードの詳細は、既存のレコードの項目と値を表示するために使用されるコンポーネントです。主に情報の表示に使用され、ユーザーが新しい情報を入力するためのフォームとしては機能しません。`
    },
  {
      id: 114,
      category: "サービス&サポートアプリケーション",
      source: "tysonblog 第115問",
      question: "AW Computing社のCTOは、顧客満足度向上のため、ケースに関する新しいポリシーを定めました。ケースの理由が[インストール]であるすべてのケースは、メールで直ちに承認され、適切なエージェントに割り当てられなければなりません。4時間経っても[新規]ステータスのままのケースは、サポート管理者にエスカレーションしなければなりません。この要件には、どのようなケース管理ツールを利用する必要がありますか。",
      choices: ["自動レスポンスルール、マクロ、エンタイトルメント","自動レスポンスルール、キュー、マクロ","自動レスポンスルール、キュー、エスカレーションルール","自動レスポンスルール、エンタイトルメント、エスカレーションルール"],
      answers: [2],
      explanation: `自動レスポンスルールは、ケースが作成されたときに自動的にメールを送信するために使用されます。キューはケースを適切なエージェントに割り当てるために使用され、エスカレーションルールは、4時間経ってもステータスが[新規]のままのケースをサポート管理者にエスカレーションするために使用されます。この選択肢はすべての要件を満たします。
        ※ 自動レスポンスルールは、ケース作成時に自動的な通知を顧客に送信するために使用されますが、マクロは一連のアクションを自動化するためのものであり、エンタイトルメントはサービス契約を管理します。この組み合わせには、特定の条件下でのエスカレーション処理を自動的に行うエスカレーションルールが含まれていません。
        ※ こちらも、自動レスポンスルールは適切ですが、マクロはアクションの自動化に利用され、キューはケースを適切なチームに割り当てるのに役立ちますが、時間経過に応じた自動エスカレーションを行うエスカレーションルールが不足しています。
        ※ 自動レスポンスルールとエスカレーションルールは要件を満たすために必要ですが、エンタイトルメントはサービス契約の条件を管理するためのもので、このシナリオには必要ありません。適切なエージェントに割り当てるためにはキューが必要です。`
    },
  {
      id: 115,
      category: "データ管理&分析",
      source: "tysonblog 第116問",
      question: "AW Computing社は、ユーザーが取引先の[年間売上]項目を負の値または1,000億ドルを超える金額に更新できないようにしたいと考えています。管理者は、この要求をどのように達成すればよいですか。",
      choices: ["取引先の[年間売上]項目が0以下または1,000億円を超える場合にエラーを表示する入力規則を作成する。","取引先の[年間売上]項目がマイナスまたは 1,000億円以上の取引先を表示するスケジュールレポートを作成する。","ページレイアウトで取引先の[年間売上]項目を必須にする。","最小値を0、最大値を1,000億として、設定での取引先の[年間売上]項目の制限を有効にする。"],
      answers: [0],
      explanation: `入力規則を使用することで、特定の条件を満たさないデータの入力を制限し、エラーメッセージを表示することができます。このケースでは、年間売上が0以下または1,000億ドルを超える場合にエラーメッセージを表示し、ユーザーがそのような値を保存するのを防ぐことができます。
        ※ スケジュールレポートはデータを監視するために有効ですが、ユーザーが不適切なデータを入力すること自体を防止する機能はありません。これは問題が発生した後に状況を把握するためのものであり、事前に入力を制限するものではないため、要件を直接的に解決するものではありません。
        ※ ページレイアウトで項目を必須にすることは、その項目が空白でないことを保証しますが、入力される値の範囲を制限するものではありません。この設定は値の存在を強制するだけで、その値の妥当性(範囲制限など)には影響しません。
        ※ Salesforceの標準機能では、項目の最小値と最大値を直接設定する機能はありません。`
    },
  {
      id: 116,
      category: "自動化",
      source: "tysonblog 第117問",
      question: "Ursa Major Solar社の営業チームは、リードがWebサイトのフォームに入力するたびに、カスタマイズされたメールを送信したいと考えています。彼らは、リードオブジェクトの[業種]項目の値に基づいて異なるメッセージを送信したいと考えています。この要件を満たすために、管理者は何を設定する必要がありますか。",
      choices: ["入力規則を使用して、ワークフローをトリガーし、リードにメールを送信する。","自動レスポンスルールを構成して、リードにメールを送信する。","公開グループとフロービルダーのメールアラートを使用して、リードにメールを送信する。","割り当てルールを作成して、リードにメールを送信する。"],
      answers: [1],
      explanation: `自動レスポンスルールは、リードがWebサイトのフォームを提出した際に、特定の条件に基づいて自動的にメールを送信するために使用されます。このルールを使用して、リードオブジェクトの[業種]項目の値に基づいて異なるメッセージを送信することができます。設定はシンプルで、要件に適しています。
        ※ 入力規則は、特定の条件を満たすかどうかを検証するためのものであり、ワークフローを直接トリガーするためには使用されません。入力規則はデータ入力の制限やエラーメッセージを表示するためのもので、このシナリオには適していません。
        ※ 公開グループはユーザーやチーム間の共有設定に用いられるもので、メール送信プロセスには関連がありません。プロセスビルダーは自動化プロセスを構築するのに有効ですが、この選択肢ではそれを利用する具体的な方法が不明で、単体では要件を満たすのに十分ではありません。
        ※ 割り当てルールは、リードが作成された際に適切なユーザーまたはキューにリードを割り当てるためのものです。メールを送信するための機能はありません。この要件には直接対応していません。`
    },
  {
      id: 117,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第118問",
      question: "Cloud Kicks社のユーザーが、商談オブジェクトにカスタム選択リストを適用する際に、商談の種類によって異なるオプションがあることを報告しています。管理者は選択リストのオプションをどこで更新する必要がありますか。",
      choices: ["項目とリレーション","ルックアップ検索条件","レコードタイプ","グローバル選択リスト値セット"],
      answers: [2],
      explanation: `レコードタイプは、特定のビジネスプロセスやページレイアウトをオブジェクトに適用するために使用されます。異なるレコードタイプごとに異なる選択リストのオプションを設定することができます。商談の種類によって異なる選択リストのオプションを設定するには、レコードタイプごとに選択リストの値を設定します。
        ※ 項目とリレーションは、オブジェクトに追加された項目の設定やリレーションを管理する場所ですが、商談の種類によって異なる選択リストのオプションを設定するための場所ではありません。
        ※ ルックアップ検索条件は、ルックアップ関係において参照可能なレコードを制限するために使用される条件を設定する機能です。これは選択リストのオプションを管理するものではありません。
        ※ グローバル選択リスト値セットは、複数の選択リスト項目で共有される値セットを管理する場所です。個々のレコードタイプごとに異なる選択リストのオプションを設定するためのものではありません。グローバル選択リスト値セット自体では、商談の種類によって異なるオプションを設定することはできません。`
    },
  {
      id: 118,
      category: "自動化",
      source: "tysonblog 第119問",
      question: "Universal Containers社の管理者は、項目値に基づいてレコードを削除する自動化された方法を必要としています。管理者はどのような自動化ソリューションを使用する必要がありますか。",
      choices: ["クイックアクション","入力規則","フロービルダー","Automation Studio"],
      answers: [2],
      explanation: `フロービルダーはレコードの削除を含む高度な自動化処理が可能です。承認プロセスはユーザーによる承認フローであり、自動削除には使用できません。入力規則はデータ検証であり、自動削除には使用できません。Automation Studioはマーケティングクラウドの機能であり、Sales Cloud標準では使用できません。`
    },
  {
      id: 119,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第120問",
      question: "Universal Containers社の管理者は、コンテナ(Containers__c)と購入(Purchase__c)という2つのオブジェクトを作成しました。管理者は、すべてのコンテナレコードをSalesforceの購入レコードに表示するよう要求しました。コンテナ(Containers__c)と購入(Purchase__c)の間のどのタイプのリレーションシップがこの要件を満たすことができますか。",
      choices: ["積み上げ集計項目","数式項目","主従関係","参照関係"],
      answers: [2],
      explanation: `主従関係を設定すると、従レコードは親レコードのセキュリティ設定と権限を継承します。これにより、親レコードが参照可能な場合、その関連する従レコードも自動的に参照されます。この機能は、コンテナ(従)が購入(主)レコードに密接に関連し、購入レコードから直接、すべての関連コンテナレコードを表示および管理することを可能にします。
        ※ 積み上げ集計項目は、主従関係においてのみ使用でき、従オブジェクトのレコードの数や特定の数値項目の合計などを親オブジェクトに集計するための項目です。積み上げ集計項目自体はリレーションシップのタイプではなく、リレーションシップの作成やレコードの表示には使用されません。
        ※ 他の項目の値を計算して表示するためのもので、リレーションシップを作成するためのものではありません。数式項目を使用しても、すべてのコンテナレコードを購入レコードに表示することはできません。
        ※ 参照関係では、各レコードは独立したセキュリティ設定を持ち、親レコードへのアクセス権限が自動的に子レコードの可視性に影響を与えるわけではありません。そのため、親レコードからすべての子レコードを自動的に表示することはできません。`
    },
  {
      id: 120,
      category: "データ管理&分析",
      source: "tysonblog 第121問",
      question: "Ursa Major Solar社の管理者が誤ってレコードをオブジェクトにインポートしてしまいました。このインポートを元に戻すには、どのツールを使用する必要がありますか。2つ選びなさい。",
      choices: ["マンスリーエクスポートサービス","レコードの一括削除","データローダー","データインポートウィザード"],
      answers: [1,2],
      explanation: `一括削除機能を使用すると、特定の条件を満たすレコードを大量に削除することができます。管理者は誤ってインポートされたレコードを特定し、それらを効率的に一括で削除することが可能です。
        データローダーは、Salesforceにデータをインポート、エクスポート、更新、削除するためのデスクトップアプリケーションです。誤ってインポートされたレコードのIDを特定した場合、データローダーを使用してこれらのレコードを削除することができます。
        ※ マンスリーエクスポートサービスは、Salesforceからデータを定期的にエクスポートするためのツールですが、既にインポートされたレコードを削除する機能はありません。このツールはバックアップ目的に使用されます。
        ※ データインポートウィザードは、特定のオブジェクトへのデータのインポートを簡単にするツールですが、既存のレコードを削除する機能は提供していません。このツールは主に新規レコードの追加や既存レコードの更新に使用されます。`
    },
  {
      id: 121,
      category: "自動化",
      source: "tysonblog 第122問",
      question: "商談が[Closed Lost]になったときに、不成立の理由をリッチテキスト項目に入力する必要があります。管理者はこの要件をどのように構成すればよいですか。",
      choices: ["ページレイアウトの[不成立の理由]項目の項目プロパティにある必須チェックボックスを選択する。","フェーズが[Closed Lost]で[不成立の理由]が空白の場合、エラーを表示する入力規則を作成する。","オブジェクトマネージャーの[不成立の理由]項目の必須チェックボックスをチェックする。","[不成立の理由]項目が空白の場合、エラーを表示するフロービルダーの保存前フローを作成する。"],
      answers: [1],
      explanation: `入力規則を使用すると、特定の条件下で項目の入力を制御できます。この場合、商談が[Closed Lost]になったときに「不成立の理由」が空白であればエラーメッセージを表示してレコードの保存を阻止できます。これにより、商談のフェーズが[Closed Lost]の場合にのみ、「不成立の理由」の入力を強制することが可能です。
        ※ ページレイアウトで項目を必須に設定しても、その項目が必須であるのは特定のページレイアウトを使用する場合のみです。また、ページレイアウトの設定はユーザーが入力フォームを通じてレコードを編集する際にのみ適用されるため、APIを通じての更新など他の手段では強制されません。
        ※ オブジェクトマネージャーで項目を必須にする設定は、その項目をすべてのコンテキストで必須にしますが、特定の条件(この場合は[Closed Lost]のときのみ)に限定することはできません。つまり、すべての商談レコードでこの項目の入力が必須になり、要件を満たしません。
        ※ ワークフロールールは項目の値を自動的に更新したり、特定のアクションをトリガーするために使用されますが、項目の入力を強制したり、入力されていない場合にエラーを表示する機能はありません。`
    },
  {
      id: 122,
      category: "データ管理&分析",
      source: "tysonblog 第123問",
      question: "DreamHouse Realty社(DR)の営業担当副社長から、異なるチーム間の企業売上を可視化するダッシュボードの要望がありました。データの重要な部分は、年間の全売上高の合計と、企業売上目標までの進捗状況です。この数値と目標合計までの進捗を1つの値として効果的に表示するダッシュボードコンポーネントはどれでしょうか。",
      choices: ["テーブル","棒グラフ","ドーナツ","ゲージ"],
      answers: [3],
      explanation: `ゲージは目標値に対する現在の達成度を視覚的に示すのに理想的です。目盛りが示す範囲内で針が現在の値を指し、目標達成に向けた進捗を直感的に表現します。このコンポーネントは、特定の数値目標への進捗を即座に把握するのに最適です。
        ※ テーブルは詳細なデータポイントを一覧表示するのに適しており、特定の数値や情報を詳細に確認するために有用です。しかし、大まかな進捗や趨勢を即座に把握する視覚的な表現には適していません。
        ※ 棒グラフは各チームの売上高を比較するのには適していますが、目標進捗を示すのには限定的です。棒グラフは主にカテゴリ別の比較に利用され、目標達成度の即時の視覚表現には向いていません。
        ※ ドーナツグラフは各カテゴリの割合を色分けして円形に表示し、全体の構成を一目で理解できるようにする視覚的なツールです。特定の割合や比率を視覚化する際に効果的ですが、具体的な数値の目標に対する進捗を示すのには制限があります。`
    },
  {
      id: 123,
      category: "セールス&マーケティングアプリケーション",
      source: "tysonblog 第124問",
      question: "Cloud Kicks社の営業担当者は、100万ドル以上の商談を獲得する可能性が高いときに通知を受けたいと考えています。この要件を満たす機能はどれですか。",
      choices: ["重要な項目","大規模商談アラート","活動タイムライン","パフォーマンスグラフ"],
      answers: [1],
      explanation: `大規模商談アラートは、商談が特定の金額のしきい値に達したときに通知を送る機能です。この機能により、営業担当者は商談金額が100万ドル以上になった場合に自動的に通知を受けることができます。金額だけでなく、確度のしきい値に基づいてアラートを設定することも可能で、重要な機会を逃さず対応できるようにします。
        ※ 重要な項目はSalesforceのパス機能の一部で、各フェーズで特に注目すべき情報やアクションを示します。これは商談の進行に伴うガイダンスを提供し、営業担当者が効果的に対応できるよう支援します。
        ※ 活動タイムラインは商談関連の活動を時系列で追跡しますが、特定の金額に達した際の自動通知機能はありません。これは活動の詳細を把握するためのツールであり、100万ドル以上の商談を獲得する可能性が高い時に通知を受ける要件には対応していません。
        ※ パフォーマンスグラフは営業担当者やチームの業績を可視化するためのツールです。売上や目標達成の進行状況をグラフィカルに表示しますが、商談の金額が特定のしきい値に達したときに自動通知を生成する機能はありません。これは主に業績の分析と視覚化に使用されます。`
    },
  {
      id: 124,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第125問",
      question: "Ursa Major Solar社の管理者は、顧客保証ケース用に新しいレコードタイプを作成しました。管理者は、ユーザーに新しいレコードタイプを表示するためにどの割り当てを使用する必要がありますか。2つ選びなさい。",
      choices: ["プロファイルの割り当て","ロールの割り当て","アプリケーションマネージャーの割り当て","ページレイアウトの割り当て"],
      answers: [0,3],
      explanation: `レコードタイプをユーザーに表示するためには、プロファイルに対してレコードタイプを割り当てる必要があります。プロファイルは、ユーザーがどのレコードタイプを利用できるかを制御します。管理者は新しいレコードタイプをプロファイルに割り当てることで、特定のユーザーがそのレコードタイプを選択できるようにします。
        ページレイアウトの割り当ては、特定のレコードタイプに関連付けられたページレイアウトをユーザーのプロファイルに割り当てるために使用されます。これにより、特定のレコードタイプに対して特定のページレイアウトを表示することができます。ページレイアウトの割り当てにより、ユーザーが新しいレコードタイプを利用できるようにします。
        ※ ロールはレコードのアクセスと共有を制御するために使用されますが、レコードタイプの表示には直接関与しません。ロールの割り当ては、ユーザーが利用できるレコードタイプを制御する手段ではありません。
        ※ [Lightning Experience アプリケーションマネージャー]は、アプリケーションの設定や管理に関する機能ですが、レコードタイプの割り当てには直接関与しません。レコードタイプの表示には適していません。`
    },
  {
      id: 125,
      category: "設定とセットアップ",
      source: "tysonblog 第126問",
      question: "Northern Trail Outfitters社の管理者がSalesforce組織で新しいユーザーを追加できません。この問題の原因は何でしょうか。",
      choices: ["ユーザー名が会社のメールアドレスではない。","ユーザー名が80文字未満である。","ユーザー名が偽のメールアドレスである。","ユーザー名がすでに使用されている。"],
      answers: [3],
      explanation: `ユーザー名が組織全体で一意である必要があります。既に使用されているユーザー名を新しいユーザーに割り当てることはできません。ユーザー名がすでに使用されている場合、新しいユーザーを追加する際にエラーが発生します。
        ※ Salesforceではユーザー名がメールアドレス形式である必要がありますが、実際に使用される会社のメールアドレスである必要はありません。ユーザー名が会社のメールアドレスではないことは、新しいユーザーを追加できない理由とは関連しません。
        ※ ユーザー名が80文字未満であることは、Salesforceの要件に合致しています。ユーザー名は80文字以内でなければならないため、80文字未満であることは問題ありません。
        ※ ユーザー名はメールアドレス形式である必要がありますが、実際のメールアドレスである必要はありません。ユーザー名が偽のメールアドレスであっても、メールアドレス形式であり、Salesforce内で一意であれば問題ありません。`
    },
  {
      id: 126,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第127問",
      question: "Cloud Kicks社で商談が交渉フェーズに達するために、商談の金額項目は営業ユーザーにとって必須となります。しかし、営業マネージャーは、金額を入力せずに商談を交渉フェーズに進めることが必要です。管理者は、営業ユーザーに対して交渉フェーズでこの項目を必須にし、マネージャーにはその制約を受けずに商談を進められるようにするにはどうすればよいでしょうか。",
      choices: ["すべてのユーザーにこの項目を必須にする。","管理者用にこの項目を埋める数式項目を作成する。","管理者プロファイルをマネージャーに割り当てる。","条件を満たす入力規則を作成する。"],
      answers: [3],
      explanation: `条件を満たす入力規則を作成することで、特定の条件(この場合は商談が交渉フェーズに進む場合)で特定のユーザー(営業ユーザー)に対して項目を必須にすることができます。入力規則を使って、営業マネージャーにはこの条件を回避することも設定できます。たとえば、商談のフェーズが交渉フェーズであり、かつユーザーが営業ユーザープロファイルの場合に金額項目が必須であるというルールを作成できます。
        ※ すべてのユーザーに対して項目を必須にすると、営業ユーザーと営業マネージャーの両方が対象となります。営業マネージャーも商談を交渉フェーズに進める際に金額を入力しなければならなくなるため、この要件には対応していません。
        ※ 数式項目は他の項目の値を計算して表示するためのものであり、特定の条件下で項目を必須にすることはできません。管理者用の数式項目を作成しても、営業ユーザーに対して金額項目を必須にする要件には対応していません。
        ※ 管理者プロファイルを割り当てることで、マネージャーに広範な権限を付与できますが、特定の項目を必須にする要件には対応しません。また、営業ユーザーに対して項目を必須にすることもできません。管理者プロファイルの割り当てはセキュリティリスクも伴います。`
    },
  {
      id: 127,
      category: "自動化",
      source: "tysonblog 第128問",
      question: "DreamHouse Realty社(DR)の仲介業者が、オープンハウスイベントの夜をダブルブッキングしています。イベントマネージャーは、仲介業者がイベントの詳細を記入し、日程をリクエストできるよう、イベント送信プロセスを望んでいます。管理者はどのようにこの要求を達成すべきでしょうか。",
      choices: ["イベント日付項目を更新するワークフローロールを作成する。","キャンペーンオブジェクトに承認プロセスを作成する。","他の仲介業者がイベントを表示できるように、共有ルールを作成する。","仲介業者がイベント日程をリクエストするためのキャンペーンを作成する。"],
      answers: [1],
      explanation: `承認プロセスを使用することで、仲介業者がイベントの詳細を入力し、日程をリクエストした後に、そのリクエストがイベントマネージャーによって承認されるワークフローを作成することができます。これにより、ダブルブッキングを防止し、全てのイベントリクエストが適切に管理されるようになります。
        ※ ワークフロールールは特定の条件に基づいて自動的にアクションを実行するためのものであり、イベント日付を自動的に更新することができますが、仲介業者がイベントの詳細を入力し日程をリクエストするプロセスには適していません。
        ※ 共有ルールはレコードのアクセス権を設定するためのものであり、他の仲介業者がイベントを表示できるようにすることはできますが、イベントの詳細を入力し日程をリクエストするプロセスには対応していません。
        ※ キャンペーンはマーケティング活動やイベントの追跡に使用されますが、仲介業者がイベントの詳細を入力し日程をリクエストするためのプロセスとしては適していません。`
    },
  {
      id: 128,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第129問",
      question: "AW Computing社の管理者はカスタム選択リスト項目を作成しました。ビジネスユーザーは、この項目をテキスト項目にするよう要求しました。管理者は項目のデータ型を変更しようとしましたが、他の機能によって参照されているため、変更できません。項目のデータ型を変更できないようにしているのは、どの機能ですか。",
      choices: ["数式項目","レコードタイプ","Visualforce","JavaScript"],
      answers: [0],
      explanation: `選択リスト項目が数式項目で参照されている場合、そのデータ型を変更することはできません。数式項目は元のデータ型に依存して計算を行うため、データ型の変更は数式の整合性を損なう可能性があります。今回の場合、他の数式項目で参照されたカスタム選択リスト項目のデータ型を、テキストに変更しようとする場合、以下のようなエラーが出てきてデータ型を変更することはできません。エラー: この項目のデータ型は、次で参照されているため変更できません:数式項目: Field1(※この項目を参照している数式項目のAPI参照名)
        ※ レコードタイプは特定のレコードで使用するページレイアウトや選択リストの値を制御するための機能ですが、項目のデータ型を直接変更できないようにするものではありません。レコードタイプは項目の選択肢を制限することはできますが、データ型には影響を与えません。
        ※ Visualforceページで選択リスト項目を参照していても、データ型の変更は可能です。ただし、変更後にVisualforceページのコードで型の不整合が発生する可能性があるため、修正が必要になる場合があります。
        ※ JavaScriptは、クライアントサイドのスクリプト言語であり、ユーザーインターフェースのカスタマイズや動作の制御に使用されますが、Salesforceの項目のデータ型を変更できないようにするものではありません。`
    },
  {
      id: 129,
      category: "設定とセットアップ",
      source: "tysonblog 第130問",
      question: "Universal Containers社は、営業チームAと営業チームBの2つの営業チームがあります。どちらのロールも同じマネージャーロールの部下です。管理者は、営業チームAが所有するレコードを営業チームBとどのように共有すべきですか。",
      choices: ["階層を使用した共有","手動共有","[条件に基づく]共有","[レコード所有者に基づく]共有"],
      answers: [3],
      explanation: `[レコード所有者に基づく]共有ルールは、特定のユーザーまたはグループが所有するレコードを他のユーザーやグループと共有するためのルールです。営業チームAが所有するレコードを営業チームBと共有するには、営業チームAのユーザーまたはグループに基づいた共有ルールを設定することで、営業チームBに対して適切なアクセス権を付与できます。
        ※ 階層を使用した共有は、ロール階層に基づいてアクセスを制御します。営業チームAと営業チームBが同じマネージャーロールの部下である場合、ロール階層を使用して共有することはできません。これは、同じレベルのロール間での共有は階層を通じて行われないためです。
        ※ 手動共有は個々のレコードを特定のユーザーやグループと共有するためのもので、全レコードを共有するには非効率的です。営業チームAのすべてのレコードを営業チームBと共有するためには、より効率的な方法が必要です。
        ※ 条件に基づく共有ルールは、レコードの特定の条件に基づいてアクセス権を他のユーザーやグループに自動的に付与するものです。営業チームAが所有する全てのレコードを営業チームBと共有するためには適していません。特定の条件に基づかない全レコードの共有には不向きです。`
    },
  {
      id: 130,
      category: "データ管理&分析",
      source: "tysonblog 第131問",
      question: "DreamHouse Realty社(DR)の管理者は、Salesforce モバイルアプリケーションのカスタマイズページを作成する必要があります。管理者が[Lightning アプリケーションビルダー]を使用して作成およびカスタマイズできるページは、どのタイプですか。2つ選びなさい。",
      choices: ["ユーザーページ","ダッシュボードページ","アプリケーションページ","レコードページ"],
      answers: [2,3],
      explanation: `Salesforceの[Lightning アプリケーションビルダー]で作成できるものは、アプリケーションページ、レコードページ、ホームページです。今回の選択肢ではアプリケーションページとレコードページが正解です。`
    },
  {
      id: 131,
      category: "自動化",
      source: "tysonblog 第132問",
      question: "DreamHouse Realty社(DR)には承認プロセスがあります。管理者がレコードを承認しようとしましたが、エラーが表示されました。この要求をトラブルシューティングするために、管理者は何を確認すべきですか。",
      choices: ["プロセスの次の承認者に委任承認者を追加する。","プロセスで更新される項目で表示するように、項目レベルセキュリティを更新する。","次の承認者のユーザーが無効または失効していないか確認する。","ページレイアウトを見直し、プロセスで更新された項目が表示されていることを確認する。"],
      answers: [2],
      explanation: `承認プロセスのエラーの一般的な原因の一つは、次の承認者として指定されているユーザーが無効または失効していることです。この場合、承認プロセスが次に進むことができず、エラーが発生します。したがって、次の承認者のユーザーの状態を確認することが最も重要です。
        ※ 委任承認者を追加することは、承認プロセスがスムーズに進むための手段ですが、エラーが発生している場合の直接的なトラブルシューティングにはなりません
        ※ 承認プロセスでの項目自動更新は、項目レベルセキュリティ設定とは独立して機能するため、このアクションはエラーを解消する直接的な解決策にはなりません。
        ※ ページレイアウトの確認は、ユーザーが必要な情報にアクセスできるようにするために重要ですが、承認プロセスのエラーの直接的な原因にはなりません。`
    },
  {
      id: 132,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第133問",
      question: "DreamHouse Realty社(DR)は、取引先とケースに適用されるカテゴリで、レコードタイプに応じた値で一貫した選択リストを使用する必要があります。この要件を満たすために管理者が使用すべき機能はどれですか。2つ選びなさい。",
      choices: ["連動選択リスト","グローバル選択リスト値セット","複数選択リスト","カスタム選択リスト"],
      answers: [1,3],
      explanation: `グローバル選択リスト値セットは、Salesforceで一度定義すると、他の選択リスト項目に再利用できる値セットです。これにより、取引先とケースの両方に適用されるカテゴリに対して一貫した選択リストを作成できます。この選択肢は、取引先とケースのレコードタイプに応じて値を一貫して提供するために最適です。
        カスタム選択リストは、Salesforceで独自の値セットを持つリストを作成するためのものです。カスタム選択リストを作成し、それをグローバル選択リスト値セットとして使用することで、取引先とケースのレコードタイプに対して一貫した選択肢を提供することが可能です。
        ※ 連動選択リストは、特定の選択肢が他のリストの選択肢に依存する場合に使用されます。例えば、最初の選択リストで選択された値に基づいて、次の選択リストに表示される値が変わるような場合です。しかし、これは取引先とケースのレコードタイプに応じた値で一貫した選択リストを提供する機能ではありません。
        ※ 複数選択リストは、複数の値を選択できるリストを提供しますが、グローバルな選択リストの値セットを共有するための手段ではありません。この選択肢は、特定の項目の性質を変えるためのものですが、取引先とケースのレコードタイプに応じた一貫性を提供するためのものではありません。`
    },
  {
      id: 133,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第134問",
      question: "管理者がカスタマイズできる標準項目の属性はどれですか。3つ選びなさい。",
      choices: ["選択リスト値","ヘルプテキスト","項目履歴の追跡","小数点以下の桁数","項目名"],
      answers: [0,1,2],
      explanation: `標準項目の選択リストは、値の追加、削除、並び替えなどを行うことができます。これにより、選択リストの値をビジネスのニーズに合わせて調整できます。
        管理者は標準項目のヘルプテキストをカスタマイズできます。これにより、ユーザーが項目の使い方や入力する情報についての説明を確認できるようになります。
        管理者は標準項目に対して項目履歴の追跡を有効にすることができます。これにより、項目の変更履歴を追跡し、変更内容を監視することができます。
        ※ 小数点以下の桁数は、カスタム項目であれば設定することができますが、標準項目ではこのような直接的なカスタマイズができません。このため、小数点以下の桁数を変更するためには、標準項目ではなくカスタム項目の使用を検討する必要があります。
        ※ E: 標準項目の項目名はカスタマイズできません。標準項目の名称はSalesforceによって定義されており、変更することはできません。`
    },
  {
      id: 134,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第135問",
      question: "管理者は、子レコードへのアクセスを制限した2つのオブジェクト間に1対多のリレーションシップを作成する必要があります。管理者はどのようなデータ型の項目を使用する必要がありますか。",
      choices: ["積み上げ集計項目","主従関係","クロスオブジェクト数式項目","参照関係"],
      answers: [3],
      explanation: `参照関係は1対多のリレーションシップを形成しつつ、子レコードへのアクセスを独立して制御することが可能です。これにより、子オブジェクトへのアクセスを制限することができ、各オブジェクトのセキュリティ設定を独立して設定することが可能です。このため、子レコードのセキュリティを独自に管理するために最適な選択肢です。
        ※ 積み上げ集計項目は、主従関係の主オブジェクトに対して、従レコードのデータを集計するための項目です。これはリレーションシップの作成そのものではなく、主従間のデータを集計するためのものです。リレーションシップのセキュリティを管理するものではありません。
        ※ 主従関係は1対多のリレーションシップを形成しますが、従レコードは主レコードに完全に連動します。これにより、主オブジェクトに対するアクセスがある場合、従オブジェクトへのアクセスも可能となり、セキュリティが独立していません。これでは従レコードへのアクセスを制限する要件には合致しません。
        ※ クロスオブジェクト数式項目は、関連する2つのオブジェクト間で差し込み項目を参照するために使用されます。しかし、クロスオブジェクト数式項目は、リレーションシップのセキュリティやアクセス制御を直接的に管理するためのものではありません。そのため、子レコードへのアクセスを制限することには適していません。`
    },
  {
      id: 135,
      category: "自動化",
      source: "tysonblog 第136問",
      question: "Cloud Kicks社の営業マネージャーは、30%以上の商談割引は営業担当副社長の承認が必要なビジネスプロセスを設定したいと考えています。10%以上の割引は、ユーザーのマネージャーの承認が必要です。管理者は承認プロセスの作成を任されています。この承認プロセスを設定する前に、管理者が確認する必要がある考慮事項はどれですか。2つ選びなさい。",
      choices: ["割引額を記録するために、商談にカスタム割引額項目を作成する。","営業ユーザーのユーザー詳細ページの、マネージャーという標準項目を設定する。","2つの別々の承認プロセスを構成する。","提出者が承認者を手動で選択できるようにする。"],
      answers: [0,1],
      explanation: `この選択肢は、割引額に基づいて承認プロセスが動作するために不可欠です。商談にカスタム割引額項目を作成することで、割引額が記録され、特定の割引額に応じて承認プロセスを起動するための基準を設定できます。例えば、10%以上の割引でマネージャーの承認、30%以上の割引で営業担当副社長の承認が必要というフローを構築できます。
        ユーザー詳細ページに設定されたマネージャー項目は、そのユーザーの直属の上司を示します。承認プロセスはこの項目を参照し、10%以上の割引に対して自動的にマネージャーの承認を必要とするフローを形成します。この項目が適切に設定されていないと、承認プロセスが正しく機能しない可能性があります。
        ※ 1つの承認プロセス内で条件付きのルールを設定することで、割引額に応じた異なる承認フローを構築できます。別々の承認プロセスを作成する必要はありません。
        ※ 承認プロセスは自動化されるべきであり、条件に基づいて適切な承認者に自動的に割り当てられる必要があります。手動で承認者を選択することは、効率や自動化の目的に合致しません。`
    },
  {
      id: 136,
      category: "自動化",
      source: "tysonblog 第137問",
      question: "Cloud Kicks社の営業担当者は、商談レコードで割引を使用することで、商品の売上を獲得しています。商談が獲得されると、関連する商談商品に手動で割引を適用しなければなりません。営業マネージャーは、この時間のかかる作業を自動化する方法はないかと尋ねてきました。管理者は、この要件を実現するために何を使用する必要がありますか。",
      choices: ["フロービルダー","承認プロセス","作成済みマクロ","数式項目"],
      answers: [0],
      explanation: `フロービルダーはSalesforceの自動化ツールで、さまざまな業務プロセスを自動化するために使用できます。商談が獲得されたときに関連する商談商品に自動的に割引を適用するフローを作成することができます。これにより、手動で割引を適用する必要がなくなります。
        ※ 承認プロセスは、特定の条件に基づいて承認が必要なレコードを承認者に送るための機能です。商談商品に割引を適用するプロセスを自動化するためのツールとしては適していません。
        ※ マクロは、ユーザーがSalesforce内で特定の一連の操作を自動化するためのものです。ただし、マクロは手動で実行される必要があり、フロービルダーのような自動化プロセスを常に動作させるものではありません。したがって、商品の割引適用の自動化には適していません。
        ※ 数式項目は、項目の値を他の項目や条件に基づいて動的に計算するためのものです。これはデータの表示や計算に関して有用ですが、割引の適用自体を自動化するためのツールではありません。そのため、商品の割引適用の自動化には向いていません。`
    },
  {
      id: 137,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第138問",
      question: "クライアントサービスチームとカスタマーサポートチームは同じプロファイルを共有していますが、権限セットは異なります。Lightningレコードページレイアウトのカスタムオブジェクトの保持する関連リストをクライアントサービスチームに制限する必要があります。管理者は、この要求を満たすために何を使用する必要がありますか。",
      choices: ["共有設定","ページレイアウトの割り当て","コンポーネントの表示を設定","レコードタイプの割り当て"],
      answers: [2],
      explanation: `コンポーネントの表示を設定することで、Lightningページの特定のコンポーネント(関連リストを含む)を条件に基づいて表示または非表示にできます。権限セットやユーザーの属性に基づいてコンポーネントを表示する条件を設定することで、クライアントサービスチームに対してのみ関連リストの表示を制限することができます。
        ※ 共有設定は、レコード全体のアクセス制御に関する設定です。これにより、レコードの閲覧権限を制御できますが、特定のレコードページ内の関連リストの表示制限には使用できません。
        ※ ページレイアウトの割り当ては、特定のプロファイルやレコードタイプに基づいてページレイアウトを指定することができますが、プロファイルが同じ場合、特定のチームに対してのみ異なるレイアウトを設定することはできません。プロファイルごとの割り当てしかできないため、今回の要件には適していません。
        ※ レコードタイプの割り当ては、特定のオブジェクトのレコードに対する異なる表示や動作を管理するためのものです。これは関連リストの可視性を制御するためのものではなく、クライアントサービスチームに対するアクセス制限には直接的な関係がありません。`
    },
  {
      id: 138,
      category: "生産性向上とコラボレーション",
      source: "tysonblog 第139問",
      question: "Ursa Major Solar社は従業員全員に素晴らしい経験を提供しています。従業員管理委員会は、他の従業員の投稿を制限しながら、最新情報を投稿したいと考えています。この要求に応えるために、管理者は何を作成すべきでしょうか。",
      choices: ["Chatter ストリーム","Chatter [ブロードキャストのみ]グループ","おすすめ Chatter グループ","Chatter 非公開グループ"],
      answers: [1],
      explanation: `Chatter [ブロードキャストのみ]グループは、管理者やグループの所有者、マネージャーのみが投稿できる特別なタイプのグループです。グループメンバーは投稿を閲覧し、コメントすることができますが、新しい投稿を作成することはできません。これにより、従業員管理委員会が最新情報を投稿し、他の従業員の投稿を制限することが可能です。
        ※ Chatter ストリームは、ユーザー、グループ、レコードのフィードをカスタムフィードとしてまとめる機能です。これは情報の整理に役立ちますが、グループの投稿権限を制御する目的には適していません。従って、委員会が他の従業員の投稿を制限しつつ情報を共有する目的には適合しません。
        ※ おすすめ Chatter グループは、ユーザーに参加を推薦する自動提案機能です。メンバー数の多いグループや、自分がフォローしているメンバーが多く参加しているグループ、新規に作成されたグループを基に推奨されます。
        ※ Chatter 非公開グループは、メンバーのみがグループのコンテンツを見ることができるグループです。ただし、全メンバーが投稿できるため、他の従業員の投稿を制限する機能はありません。`
    },
  {
      id: 139,
      category: "自動化",
      source: "tysonblog 第140問",
      question: "新しいリードは、リードのアドレスに基づいて正しい営業担当者に割り当てられる必要があります。管理者はこの要件をどのように構成すればよいですか。",
      choices: ["数式項目を作成する。","リードの割り当てルールを使用する。","エスカレーションルールを使用して割り当てる。","入力規則を設定する。"],
      answers: [1],
      explanation: `リードの割り当てルールを使用することで、リードのアドレスに基づいて特定の営業担当者にリードを自動的に割り当てることができます。リードの割り当てルールでは、リードの特定の項目(今回の場合はアドレス)に基づいて条件を設定し、その条件に一致するリードを適切なユーザーに割り当てることができます。
        ※ 数式項目は、特定の項目の値を計算し表示するためのものであり、自動的にリードを割り当てる機能はありません。数式項目は、データを動的に計算したり、他の項目の値を参照することに特化していますが、営業担当者へのリード割り当ては数式項目では実現できません。
        ※ エスカレーションルールは、ケースの処理をエスカレートするために使用されるものであり、リードの割り当てには使用されません。エスカレーションルールは主にサポートケースの管理に使用され、リードのアドレスに基づいて営業担当者にリードを割り当てる機能はありません。
        ※ 入力規則は、レコードが特定の基準を満たしているかどうかを確認し、基準を満たさない場合にエラーメッセージを表示するためのものです。入力規則はデータの正確性を確保するためのものであり、リードを特定のユーザーに割り当てる機能はありません。`
    },
  {
      id: 140,
      category: "設定とセットアップ",
      source: "tysonblog 第141問",
      question: "管理者は、自分の組織で行われた最近の設定変更を確認するために、どのツールを使用すべきですか。",
      choices: ["リリース更新","デバッグログ","設定変更履歴の参照","項目履歴管理"],
      answers: [2],
      explanation: `設定変更履歴の参照は、管理者が組織内で行われた設定変更の履歴を確認するためのツールです。これにより、誰がいつどのような変更を行ったかを追跡できます。
        ※ リリース更新は、Salesforceの新しいリリースや機能、セキュリティアップデートに関する情報を提供するためのものです。組織内の設定変更を確認するためのツールではありません。
        ※ デバッグログは、開発者や管理者がApexコード、ワークフロー、APIリクエストなどの動作をトラブルシューティングするために使用するツールです。設定変更の履歴を確認するためのものではありません。
        ※ 項目履歴管理は、特定のオブジェクトの項目変更履歴を追跡するための機能です。これは設定変更の履歴を確認するためのものではなく、レコードデータの変更履歴を確認するためのものです。`
    },
  {
      id: 141,
      category: "設定とセットアップ",
      source: "tysonblog 第142問",
      question: "Cloud Kicks社は、Salesforceを利用して商品の出荷を追跡するためのより良い方法に取り組んでいます。管理者が座標を取得するために使用すべき項目はどれですか。",
      choices: ["地理位置情報","参照関係","メール","外部参照関係"],
      answers: [0],
      explanation: `地理位置情報項目は、緯度と経度の値を格納するために使用され、特定の場所の座標を取得できます。製品の出荷を追跡する際に、出荷場所や配送先の座標を記録するのに適しています。
        ※ 参照関係は、Salesforceオブジェクト間のリレーションシップを作成するために使用されます。これは座標を設定するためのものではありません。
        ※ メール項目は、メールアドレスを格納するための項目です。地理的な座標を取得するためには使用できません。
        ※ 外部参照関係は、Salesforceオブジェクトと外部オブジェクト間のリレーションシップを作成するために使用されます。これも座標を取得するためのものではありません。`
    },
  {
      id: 142,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第143問",
      question: "AW Computing社は、ケースのLightningレコードページを改善したいと考えています。 これらの要求を満たすために、管理者が使用すべきコンポーネントはどれですか。2つ選びなさい。",
      choices: ["案件がクリティカルレコードタイプとして保存された場合、太字フォントでメッセージを表示するためのフィルターコンポーネント","ケースレイアウトから取引先のステータスを更新する簡単な方法","関連リスト","関連レコード","レコードの詳細","リッチテキスト"],
      answers: [1,3],
      explanation: `関連レコードコンポーネントを使用すると、ケースレイアウトから関連するレコードの項目を直接編集できます。例えば、取引先のステータスを更新するために、このコンポーネントを使用して必要な項目を表示し、ユーザーが編集できるようにします。
        リッチテキストコンポーネントは、ページにカスタマイズされたテキストを表示するために使用されます。[コンポーネントの表示を設定]機能を利用して、特定の条件(クリティカルレコードタイプ)に基づく動的な表示が可能です。これにより、クリティカルレコードタイプの場合にのみ太字フォントでメッセージを表示することができます。
        ※ 関連リストコンポーネントは、レコードに関連する他のレコードのリストを表示するためのものです。取引先のステータスを更新する機能や、特定の条件下でのメッセージ表示には寄与しません。
        ※ レコードの詳細コンポーネントは、レコードの全項目を表示するためのものです。特定の項目を編集する機能や、条件に基づいて太字でメッセージを表示する機能はありません。静的なデータ表示に適しています。`
    },
  {
      id: 143,
      category: "設定とセットアップ",
      source: "tysonblog 第144問",
      question: "Northern Trail Outfitters社のユーザーが Salesforce にログインできません。このユーザーのログイン履歴によると、このユーザーは何度もログインを試み、組織からロックアウトされています。管理者は、このユーザーがSalesforceにログインするのを支援するための手段はどれですか。2つ選びなさい。",
      choices: ["ユーザーとしてログインし、ロックを解除してパスワードをリセットする。","パスワードポリシーをリセットして、ユーザーがログインできるようにする。","ユーザーのレコード詳細ページでパスワードをリセットする。","ユーザーのレコード詳細ページの[ロック解除]ボタンを使用する。"],
      answers: [2,3],
      explanation: `管理者はユーザーのレコード詳細ページからパスワードをリセットすることができます。パスワードリセット後、ユーザーは新しいパスワードでログインでき、これによりアカウントのロックも自動的に解除されます。ユーザーはすぐにシステムにアクセスを再開できます。
        管理者はユーザーのレコード詳細ページにある[ロック解除]ボタンを使用して、ロックアウトされたユーザーのアカウントを解除できます。この操作により、ユーザーは再びログインを試みることができます。
        ※ 管理者が他のユーザーとしてログインする機能は、トラブルシューティングやサポート目的で使用されますが、ロックアウトされたユーザーには適用できません。ロックアウト中のユーザーにはアクセスできないため、このオプションは適切ではありません。
        ※ パスワードポリシーのリセットという操作は存在しません。パスワードポリシーは組織全体のセキュリティ設定であり、特定のユーザーのロックアウトを解除するための手段ではありません。`
    },
  {
      id: 144,
      category: "セールス&マーケティングアプリケーション",
      source: "tysonblog 第145問",
      question: "Northern Trail Outfitters社は、商談の主要な利害関係者である取引先責任者のROIを追跡したいと考えています。営業担当副社長は、この情報に商談上でアクセスでき、レポートに利用できるようにすることを要求しました。これらの要件を満たすために、管理者はどのオプションを構成する必要がありますか。2つ選びなさい。",
      choices: ["[キャンペーンメンバーの役割]をカスタマイズする。","商談ページレイアウトに[キャンペーンメンバー]関連リストを追加する。","[キャンペーンの役割]をカスタマイズする。","[取引先責任者の役割]をカスタマイズする。","商談ページレイアウトに商談の[取引先責任者の役割]関連リストを追加する。"],
      answers: [3,4],
      explanation: `ROIを追跡するには、取引先責任者の役割を特定の利害関係者に関連付けることで、どのように影響を与えるかを特定できます。これをカスタマイズすることで、特定のROIデータを役割に直接結び付けることが可能になります。
        これにより、商談を閲覧する際に取引先責任者のROI情報に直接アクセスできるようになります。この関連リストは、営業担当副社長が商談の中で取引先責任者のROIを簡単に確認できるようにします。
        ※ Salesforceには[キャンペーンメンバーの役割]という概念は存在しません。
        ※ Salesforceには商談ページレイアウトに[キャンペーンメンバー]関連リストを追加するオプションは存在しません。
        ※ Salesforceには[キャンペーンの役割]という概念は存在しません。`
    },
  {
      id: 145,
      category: "自動化",
      source: "tysonblog 第146問",
      question: "Cloud Kicks社のビジネス開発チームでは、取引先の作成プロセスには入力項目が多すぎ、ページが乱雑に感じられると考えています。彼らは管理者にプロセスを簡素化するよう要請しました。管理者はどの自動化ツールを使うべきか。",
      choices: ["承認プロセス","レコードトリガーフロー（保存前）","フロービルダー","入力規則"],
      answers: [2],
      explanation: `フロービルダーの画面フロー機能を使用すると、ユーザーが必要とする項目のみを表示するカスタムページを作成できます。このツールを使用して、取引先の作成プロセスをガイドするステップバイステップのインターフェースを設計し、ページの乱雑さを減らし、プロセスを簡素化することができます。
        ※ 承認プロセスは、特定の条件に基づいてレコードを承認者に送るための機能です。これは入力項目を簡素化するためのツールではなく、取引先の作成プロセスの簡素化には適していません。
        ※ ワークフロールールは、特定の条件に基づいて自動的にアクションを実行するためのものです。これは入力項目を減らすことやページを整理するためのツールではなく、プロセスの自動化に役立ちますが、ページの乱雑さを改善するための直接的な解決策ではありません。
        ※ 入力規則は、データの入力時に特定の条件を満たさない場合にエラーを発生させるためのものです。これにより、データの品質を保つことができますが、入力項目の数を減らしたりページのレイアウトを簡素化するためのツールではありません。`
    },
  {
      id: 146,
      category: "Agentforce",
      source: "tysonblog 第147問",
      question: "AW Computing社の管理者が、サポートチームのレポートフォルダーの作成を手伝ってほしいと依頼されました。Support Reportsというフォルダーと、その下にあるHelpdeskとR&Dという2つのフォルダーが必要です。サポート組織は、サポートエージェント、R&D、およびサポートマネージャーに公開グループを使用しています。サポートエージェントは、Helpdeskレポートを実行できる必要がありますが、R&Dレポートを参照できないようにする必要があります。サポートマネージャーは、すべてのレポートを参照および編集できる必要があります。これらのフォルダーはどの方法で共有する必要がありますか。2つ選びなさい。",
      choices: ["R&Dフォルダーをサポートマネージャーと編集アクセス権で共有する。","Helpdeskフォルダーをサポートエージェントと表示アクセスで共有する。","Support Reportsフォルダーをサポートマネージャーと編集アクセスで共有する。","Support Reportsフォルダーをサポートエージェントと表示アクセスで共有する。"],
      answers: [1,2],
      explanation: `サポートエージェントはHelpdeskレポートの実行するために参照アクセスでの共有が適切です。
        サポートマネージャーにはすべてのレポートに対する完全なアクセス権が必要であり、この設定によりすべてのサブフォルダーの参照・編集もカバーされます。
        ※ Support Reportsフォルダーを編集アクセスで共有すれば、Support Reportsフォルダーとそのすべてのサブフォルダーが参照・編集できるため、R&Dフォルダーを個別に共有する必要はありません。
        ※ この設定ではサポートマネージャーの要求である編集権限が提供されません。サポートマネージャーは編集権限を持つ必要があります。`
    },
  {
      id: 147,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第148問",
      question: "Cloud Kicks社は、異なる商品カテゴリー(シューズ、アパレル、アクセサリー)のリードを多くの異なるソースから生成しています。3つのカテゴリーすべてに使用されるリードソースもあれば、1つのカテゴリーに特化したリードソースもあります。マーケティング担当副社長は、選択した商品カテゴリーに基づいて適切なリードソースのみを表示するよう要求しています。この要件を満たすために、管理者はSalesforceをどのように設定すればよいでしょうか。",
      choices: ["カテゴリーごとにページレイアウトを作成し、カテゴリーに基づいてリードソース項目を絞り込む。","商品カテゴリー項目とリードソース項目の間に依存関係を作成する。","3つの商品カテゴリーごとにビジネスプロセスとレコードタイプを作成する。","1つのビジネスプロセスを作成し、各商品カテゴリーのレコードタイプを作成する。"],
      answers: [2],
      explanation: `リードのレコードタイプを作成する際は、リードプロセスの選択が必須です。今回は、シューズ、アパレル、アクセサリーで異なる商品カテゴリーごとにライフサイクルが異なると判断し、各商品カテゴリーに対応するビジネスプロセスとレコードタイプを作成することで、リードソースをあらかじめ絞り込むことができるため、今回の要件を過不足なく満たすことができます。
        ※ ページレイアウトは項目の表示や配置を制御するものであり、選択リストの値に基づいて他の選択リストを絞り込むことはできません。
        ※ カスタム選択リスト項目間では連動選択リストを作成できますが、標準選択リスト(今回の場合はリードソース項目)は連動項目には設定できません。そのため、この方法では要件を満たすことはできません。
        ※ 商品カテゴリーごとにリードソースの値を絞り込むことは、2つの選択リスト(商品カテゴリーとリードソース)とレコードタイプのみで実現可能です。しかし、シューズ、アパレル、アクセサリーで異なるライフサイクル(リード状況項目の選択値)が想定できるため、リードプロセスは分けた方が無難です。`
    },
  {
      id: 148,
      category: "自動化",
      source: "tysonblog 第149問",
      question: "Universal Containers社の管理者は、ユーザーが新しいリードを作成するための画面フローを持っています。リードソースが[検索エンジン]の場合、管理者はユーザーに選択リストから特定の検索エンジンを選択させる必要があります。リードソースが[検索エンジン]でない場合、この選択リストは非表示にする必要があります。管理者はこの要件をどのように設定すればよいですか。",
      choices: ["リードソースが[検索エンジン]の場合のみ、特定の検索エンジンを保持するために、ユーザーを2番目の画面に誘導する決定要素を割り当てる。","リードソースが[検索エンジン]のとき用とそれ以外用の割り当て要素2つを用意する。","特定の検索エンジンの選択リストを作成し、リードソースが[検索エンジン]のときのみ表示されるように[フローの条件付き表示]を設定する。","特定の検索エンジンの選択リストを設定し、入力規則を使用して、リードソースが[検索エンジン]のときのみ条件付きで表示する。"],
      answers: [2],
      explanation: `フロー内で[コンポーネントの表示を設定]を使用し、条件付き表示を設定することで、リードソースが[検索エンジン]のときのみ選択リストが表示されるようにすることができます。これにより、フローの他の部分を変更することなく、必要な情報のみをユーザーに提供できます。
        ※ この選択肢は過度に複雑であり、ユーザーを完全に別の画面に誘導する必要があります。これはユーザーエクスペリエンスを低下させる可能性があり、もっとシンプルな方法が考えられます。
        ※ この選択肢は、リードソースの値に基づいて異なるフロー要素を使用するという点で理にかなっていますが、実際には特定の検索エンジンの選択リストを表示/非表示するだけで済むため、割り当て要素を2つ設定する必要はありません。
        ※ 入力規則はレコードに入力される項目の検証に使用されるため、画面フロー内の要素の表示を制御するためのものではありません。`
    },
  {
      id: 149,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第150問",
      question: "Cloud Kicks社の営業ユーザーは、取引先オブジェクトの業種項目のデータを商談ページレイアウトに表示することを要求しています。これを達成するために、管理者はどのデータ型の項目を作成すべきですか。",
      choices: ["カスタム取引先項目","標準取引先項目","クロスオブジェクト数式項目","主従関係項目"],
      answers: [2],
      explanation: `クロスオブジェクト数式項目を使用することで、商談レコードから取引先の業種項目を参照し、その値を表示することができます。これは異なるオブジェクト間でデータを参照するための最適な方法です。
        ※ カスタム取引先項目は取引先オブジェクトに対して作成されるカスタム項目であり、商談オブジェクトに直接作成することはできません。
        ※ 標準取引先項目は取引先オブジェクトに標準で存在する既定の項目です。これらの項目を直接商談オブジェクトに作成することはできません。
        ※ 主従関係項目は主オブジェクトと従オブジェクト間の関係を作成するために使用されますが、商談と取引先間はすでに参照関係にあります。主従関係は、既に参照関係にあるオブジェクト間で新たに作成することはできません。`
    },
  {
      id: 150,
      category: "データ管理&分析",
      source: "tysonblog 第151問",
      question: "管理者は、AW Computing社の営業チームとマーケティングチームのためにダッシュボードを作成しなければならないという厳しい期限に追われています。予算を増やさずに期限を守るために、管理者は何をすべきでしょうか。",
      choices: ["ダッシュボードを作成するために、営業チームとマーケティングチームの誰かをトレーニングする。","AppExchangeをチェックして、簡単にカスタマイズできる構築済みのソリューションを探す。","カスタムダッシュボードを構築するコンサルタントを雇う。","期限に間に合うように手動でダッシュボードを構築する。"],
      answers: [1],
      explanation: `AppExchangeには、既に開発された多くのダッシュボードとレポーティングツールがあります。これを利用することで時間を節約しつつ、必要なカスタマイズを行うことができます。予算を増やさずに、期限内に対応できる現実的な選択肢です。
        ※ トレーニングには時間がかかるため、期限を守るという目標には適していません。また、予算を増やさずにという条件も満たせません。
        ※ コンサルタントを雇うことは予算の増加につながり、問題の条件を満たしません。
        ※ 管理者自身が手動でダッシュボードを構築することは、時間がかかりすぎる可能性が高く、期限を守ることが困難です。`
    },
  {
      id: 151,
      category: "設定とセットアップ",
      source: "tysonblog 第152問",
      question: "Salesforceユーザーのグローバルチームをサポートする管理者が、[会社の設定]を行うよう依頼されました。 管理者が設定できる項目はどれですか。2つ選びなさい。",
      choices: ["ログイン時間","パスワードポリシー","言語のデフォルト値","ローカル通貨"],
      answers: [2,3],
      explanation: `管理者は[組織情報]ページで組織のデフォルト言語を設定できます。これにより、新規作成されるユーザーアカウントに対して初期設定される言語が決定されます。これはグローバルなチームをサポートする際に特に重要です。
        管理者は[組織情報]で組織が所在する国または地域に基づいたローカル通貨を設定することができます。これは組織が取引を行う基本通貨を定義し、報告や計算の基準となります。
        ※ ログイン時間は[会社の設定]ではなく、プロファイル設定で管理します。特定のユーザーがログインできる時間を制限するために使用されます。
        ※ パスワードポリシーは[会社の設定]ではなく、[セキュリティ]設定で管理します。これは組織全体のパスワード要件を設定するために使用されます。`
    },
  {
      id: 152,
      category: "自動化",
      source: "tysonblog 第153問",
      question: "Ursa Major Solar社の管理者は、VP顧客からの未割り当てのケースが5時間以内に適切なサービス担当者に転送されるようにする必要があります。VIP顧客は24時間サポートにアクセスできます。どのように設定すればよいですか。",
      choices: ["割り当てルール","営業時間","ケースキュー","エスカレーションルール"],
      answers: [3],
      explanation: `エスカレーションルールはケースが特定の基準を満たした場合(例えば、一定時間内に割り当てられない、または解決されない場合)に自動的にアクションを起こします。このシナリオでの要件には、未割り当てのケースが5時間以内に適切なサービス担当者に転送されることが含まれるため、エスカレーションルールが最も適しています。時間が経過し、割り当てられていないケースがあれば自動的に次の対応ステップへと移行させることが可能です。
        ※ 割り当てルールは新規ケースを適切なユーザーやキューに自動的に割り当てることはできますが、時間に基づくアクションを実行する機能は持っていません。
        ※ 営業時間は、組織の業務時間を定義しますが、ケースがどのように処理されるかに直接影響を与えるわけではありません。営業時間自体がケースを移動またはエスカレートするわけではないため、この要件を直接的にサポートするものではありません。
        ※ ケースキューはケースを整理し、グループ化するために使用されますが、自動的にケースを移動させる機能は提供していません。`
    },
  {
      id: 153,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第154問",
      question: "Northern Trail Outfitters社には、取引先に新しいケースを作成するカスタムクイックアクションがあります。管理者は、このクイックアクションを Salesforceモバイルアプリで利用できるようにするにはどうすればよいですか。",
      choices: ["カスタムLightning アプリケーションを作成する。","ケースのコンパクトレイアウトを変更し、アクションを追加する。","Salesforce モバイルナビゲーションメニュー項目にアクションを追加する。","Salesforce モバイルおよび Lightning Experience アクションをページレイアウトに追加する。"],
      answers: [3],
      explanation: `特定のオブジェクトページレイアウトにクイックアクションを追加することによって、モバイルおよびデスクトップのSalesforceアプリケーションでアクションを利用できるようになります。SalesforceモバイルおよびLightning Experienceでアクションを使用するには、ページレイアウトにそれらを追加し、適切に配置する必要があります。これがクイックアクションを有効にする正しい方法です。
        ※ カスタムLightningアプリケーションを作成することは、アプリケーションのナビゲーションやユーザーインターフェースをカスタマイズすることに役立ちますが、特定のオブジェクトのクイックアクションをモバイルアプリに直接追加する方法ではありません。
        ※ コンパクトレイアウトはオブジェクトの主要な項目を表示するために使用されますが、クイックアクションを追加する機能は提供していません。
        ※ モバイルナビゲーションメニューはアプリ内のナビゲーションリンクを整理するためのものであり、特定のChatter、レポート、ダッシュボード、Todayなどの既存のメニュー項目を配置することはできますが、クイックアクションを追加する機能は提供していません。`
    },
  {
      id: 154,
      category: "データ管理&分析",
      source: "tysonblog 第155問",
      question: "Ursa Major Solar社の営業担当者は、一連のネットワーキングイベントを立ち上げました。彼らは毎月1回イベントを開催しており、月ごと、シリーズごとにキャンペーンのROIをレポートできるようにしたいと考えています。レポートを簡略化するために、管理者はキャンペーンをどのように設定すればよいですか。",
      choices: ["毎月のイベントタイプに異なるレコードタイプを追加する。","すべて同じ名前の個別のキャンペーンを作成する。","キャンペーンメンバーの状況を設定して、どのイベントメンバーが参加したかを記録する。","キャンペーン階層を使用し、毎月のイベントを親キャンペーンに積み上げ集計する。"],
      answers: [3],
      explanation: `キャンペーン階層を使用することで、各イベントからのデータを親キャンペーンに集約し、シリーズ全体のROIを簡単に計算し、効果的にレポートすることができます。これにより、月ごとのパフォーマンスを総合的に把握しやすくなります。
        ※ 異なるレコードタイプを使用することで、キャンペーンをカスタマイズして管理することができますが、これだけでは各イベントのROIを効果的に追跡しレポートする方法にはなりません。レコードタイプは、キャンペーンの管理を柔軟にするために役立ちますが、ROIの追跡には直接的な役割を果たしません。
        ※ 同じ名前のキャンペーンを作成することは、追跡とレポート作成を混乱させ、効率を低下させる可能性があります。各イベントにユニークな識別子を持たせることが、効果的なデータ管理とレポートの精度を高めるために重要です。
        ※ キャンペーンメンバーの状況を設定することで参加者を追跡できますが、これだけではイベントごとのROIを計算やレポートする直接的な手段にはなりません。今回の要件は、月ごと及びシリーズ全体のROIを効率的にレポートする方法を求めているため、この選択肢はそれに対応していません。`
    },
  {
      id: 155,
      category: "自動化",
      source: "tysonblog 第156問",
      question: "管理者は、顧客を失ったときにユーザーが記入するフォームをSalesforceに作成したいと考えています。この目標を達成するためのウィザードの作成をサポートしている自動化ツールはどれですか。",
      choices: ["クイックアクション","承認プロセス","アウトバウンドメッセージ","フロービルダー"],
      answers: [3],
      explanation: `フロービルダーは、Salesforceでカスタムフォームやウィザードを作成するためのツールです。これにより、ユーザーがインタラクティブに情報を入力できるステップバイステップのガイドを作成できます。フロービルダーは、画面フローを使用してユーザーが記入するフォームやウィザードを簡単に作成し、データの収集や処理を自動化できます。
        ※ プロセスビルダーは、特定の条件に基づいてレコードを自動的に更新したり、他のアクションを実行したりするためのツールです。しかし、ユーザーが記入するフォームやウィザードを作成する機能はありません。プロセスビルダーは主にバックグラウンドでの自動化に使用されます。
        ※ 承認プロセスは、レコードが承認フローを通過するためのステップを定義するツールです。これにより、特定のアクションに対する承認を自動化できますが、ユーザーが記入するフォームやウィザードを作成する機能はありません。承認プロセスは主に承認手続きの自動化に使用されます。
        ※ アウトバウンドメッセージは、Salesforceから外部システムに情報を送信するための機能です。ユーザーが記入するフォームやウィザードを作成するためのツールではありません。アウトバウンドメッセージは主にシステム間のデータ連携に使用されます。`
    },
  {
      id: 156,
      category: "データ管理&分析",
      source: "tysonblog 第157問",
      question: "DreamHouse Realty社(DR)では、将来の内覧が重なるのを防ぐため、内覧は今年中に行うよう定めています。どうすれば、内覧会の日付が今年度内であることを確実にすることができますか。",
      choices: ["ユーザーの内覧カレンダーをSalesforceに同期し、今年だけを表示するように絞り込む。","今年にスケジュールされていない内覧日を示すレポートを作成する。","ユーザーが内覧日を今年中にのみ追加するように、ヘルプテキストを追加する。","内覧日に今年だけの日付が含まれていることを確認する入力規則を作成する。"],
      answers: [3],
      explanation: `入力規則を使用すれば、システムは自動的にユーザーが今年の日付のみを内覧日として入力するように強制するため、最も直接的で確実な方法です。
        ※ カレンダーを絞り込んでも、ユーザーがシステムに今年以外の日付を入力するのを防ぐことはできません。
        ※ この方法は、来年以降にスケジュールされた内覧日を可視化することはできますが、内覧が今年内にスケジュールされることを保証する手段にはなり得ません。
        ※ ヘルプテキストは指示を提供するものですが、実際にルールを強制するものではありません。`
    },
  {
      id: 157,
      category: "設定とセットアップ",
      source: "tysonblog 第158問",
      question: "Northern Trail Outfitters社の管理者がSalesforceで新しいユーザーを追加できません。この問題の原因は何でしょうか。",
      choices: ["ユーザー名がすでに他の関連組織で使用されている。","そのユーザー名は、[私のドメイン]固有のドメインに制限されている。","ユーザー名に使用されているメールアドレスに取引先責任者レコードがある。","ユーザー名に使用されているメールは、会社のメールアドレスではない。"],
      answers: [0],
      explanation: `Salesforceでは、関連するすべての組織(本番、トライアル、およびSandbox組織を含む)でユーザー名が一意でなければならないため、他の組織で既に使用されているユーザー名を新しいユーザーに割り当てることはできません。重複するユーザー名のエラーが発生した場合、異なるユーザー名を選択する必要があります。
        ※ [私のドメイン]は、組織が独自のカスタムURLを設定するための機能ですが、ユーザー名の制限には影響しません。
        ※ ユーザー名がメールアドレス形式であっても、取引先責任者レコードに同じメールアドレスがあることがユーザー作成を妨げることはありません。ユーザー名と取引先責任者のメールアドレスは独立した項目であり、これが原因でユーザー追加ができなくなることはありません。
        ※ Salesforceでは、ユーザー名が会社のメールアドレスである必要はありません。ユーザー名は一意であれば良く、どのようなメールアドレス形式でも問題ありません。`
    },
  {
      id: 158,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第159問",
      question: "Northern Trail Outfitters社には2つの異なるセールスプロセスがあります。一つは4つのフェーズを持つ商談用、もう一つは8つのフェーズを持つパートナー商談用です。どちらのプロセスも、ページレイアウトと選択リストの値のオプションが異なります。これらの要件を満たすために、管理者は何を設定する必要がありますか。",
      choices: ["ユーザーが正確なセールスのフェーズ情報を入力していることを保証する入力規則","商談タイプの選択リスト値を制御する異なるページレイアウト","商談のレコードタイプとセールスプロセスを制限する公開グループ","各商談タイプごとに異なるレコードタイプとセールスプロセスを設定する"],
      answers: [3],
      explanation: `異なるセールスプロセスを持つ商談の管理には、レコードタイプとそれに関連付けられたセールスプロセスを設定することが効果的です。商談レコードタイプではセールスプロセスの設定が必須で、異なるセールスプロセスを設定することで、各商談タイプに対して適切なフェーズを設定し、ユーザーが正確な情報を入力できるようにすることができます。さらに、各プロセスに必要なページレイアウトと選択リストの値を管理することで、商談用プロセスとパートナー商談用プロセスのそれぞれに対応したカスタマイズが可能です。
        ※ 入力規則は、データ入力の際に特定の条件を満たす必要があることを強制するためのものです。しかし、セールスプロセスごとに異なるページレイアウトや選択リストの値を提供する機能はありません。入力規則はデータの一貫性を保つためのものであり、異なるセールスプロセスの管理には適していません。
        ※ 異なるページレイアウトを使用することで、特定の商談タイプに対して異なる項目やレイアウトを表示することはできますが、セールスプロセスのフェーズ数を制御することはできません。
        ※ 公開グループはユーザーアクセスの管理に用いられ、レコードの表示や編集権限を制御しますが、セールスプロセスやレコードタイプの設定はできません。また、セールスプロセスごとにページレイアウトを分け、選択リストの値のオプションを提供する要件を満たしません。`
    },
  {
      id: 159,
      category: "自動化",
      source: "tysonblog 第160問",
      question: "Ursa Major Solar社では、保証満了日の30日前にリマインドメールを送信するフローが設定されています。ある顧客が保証をさらに3年間更新しました。この場合、フロー内のメール要素の期待される動作は何ですか。",
      choices: ["顧客のメールアドレスが見つからないため、メールは送信されない。","メールは、30日間のリマインダー基準で送信される。","レコードが条件を満たさなくなったため、メールは送信されない。","メールは、条件を満たすまでジョブキューにロックされる。"],
      answers: [2],
      explanation: `保証が更新された場合、保証満了日も変更されます。したがって、フロー内の条件(保証満了日の30日前)が満たされなくなるため、メールは送信されません。リマインドメールの条件が変更後の満了日基準になるため、既存の設定ではメール送信が行われません。
        ※ ここでの前提は、顧客のメールアドレスがすでにシステムに登録されていることです。保証満了日の30日前にリマインドメールを送信する設定がある場合、メールアドレスが見つからないという状況は考えられません。
        ※ 保証が更新されると、新しい満了日が設定されます。したがって、以前の満了日に基づく30日前のリマインダー基準は無効になります。このため、メールは新しいリマインダー基準で送信されます。
        ※ フローの通常の動作では、条件を満たすまでメールがジョブキューにロックされることはありません。条件を満たすかどうかに基づいてメールが送信されるか否かが決まります。`
    },
  {
      id: 160,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第161問",
      question: "DreamHouse Realty社(DR)チームは、オープンハウスを主オブジェクト、訪問者を従オブジェクトとする主従関係を設定しています。訪問者数を追跡するために、管理者はどのようなデータ型の項目をオープンハウスオブジェクトに追加すべきでしょうか。",
      choices: ["積み上げ集計項目","複数選択リスト項目","クロスオブジェクト数式項目","間接参照関係"],
      answers: [0],
      explanation: `積み上げ集計項目は主従関係において主オブジェクトに従オブジェクトのデータを集計するために使用されます。訪問者数を追跡するためには、訪問者(従オブジェクト)の数をオープンハウス(主オブジェクト)で集計する必要があるため、積み上げ集計項目を使用するのが最適です。
        ※ 複数選択リスト項目は、定義されたリストから複数の値を選択するための項目ですが、集計機能はありません。
        ※ クロスオブジェクト数式項目は、他のオブジェクトからのデータを参照するための項目ですが、数を集計する機能はありません。
        ※ 間接参照関係は、外部オブジェクトのレコードを参照するための項目であり、集計目的には使用できません。訪問者数を追跡するには適していません。`
    },
  {
      id: 161,
      category: "サービス&サポートアプリケーション",
      source: "tysonblog 第162問",
      question: "Cloud Kicks社は、各メンバーが各案件に貢献した努力の度合いに基づいて、商談のチームメンバーにクレジットを与えたいと考えています。この要件を満たすために、管理者はどの機能を使用すべきでしょうか。",
      choices: ["フェーズ","商談分割","キュー","リストビュー"],
      answers: [1],
      explanation: `商談分割は、商談に対するチームメンバーの貢献度を追跡し、各メンバーに対してクレジットを割り当てるための機能です。管理者は商談分割を設定することで、商談の収益を複数のチームメンバー間で分割し、それぞれの貢献度に応じたクレジットを与えることができます。これにより、各メンバーの実績を正確に評価することが可能です。
        ※ フェーズは、商談の進行状況を示すためのものです。フェーズは商談の各段階(例えば、提案、交渉、クローズ)を管理するために使用され、個々のチームメンバーの貢献度を追跡するための機能ではありません。
        ※ キューは、特定のレコード(例：リード、ケース、カスタムオブジェクトなど)を複数のユーザーやチームが共同で処理するための機能です。キューは商談の進行状況や貢献度の管理には使用されず、主にタスクやケースの管理に利用されます。
        ※ リストビューは、Salesforceでデータをフィルターや条件に基づいて表示するためのビューです。リストビューはデータの可視化や管理には役立ちますが、チームメンバーの貢献度に基づいたクレジットの割り当てには直接関係ありません。`
    },
  {
      id: 162,
      category: "自動化",
      source: "tysonblog 第163問",
      question: "Northern Trail Outfitters社は、Salesforceにリードを入力するインターンを雇っており、既存のリードから新しいレコードを識別する方法を求めています。この要件を満たすために、管理者はどのようなアプローチを取るべきでしょうか。",
      choices: ["個別のリードLightningアプリを作成する。","レコードタイプを定義し、インターンに割り当てる。","インターン用にWeb-to-リードを設定する。","有効なリードの割り当てルールを更新する。"],
      answers: [1],
      explanation: `レコードタイプを用いることで、異なるタイプのリード(例えばインターンが入力するリードと既存のスタッフが入力するリード)を区別することが可能です。各レコードタイプに独自のページレイアウトや必須項目を設定することで、リードの管理を効果的に行うことができます。
        ※ リードLightningアプリの作成は、ユーザーインターフェースをカスタマイズすることには役立つかもしれませんが、既存のリードから新しいレコードを識別する具体的な方法を提供するものではありません。
        ※ Web-to-リードは主にウェブサイトから直接リード情報をSalesforceに収集するために使用されますが、既存のリードから新しいレコードを区別するための直接的な手段ではありません。
        ※ リードの割り当てルールは、リードが生成された際に適切な営業担当者やチームに自動的に割り当てられるようにするために用いますが、これ自体が新しいリードを既存のリードから識別する直接的な方法とはなりません。`
    },
  {
      id: 163,
      category: "セールス&マーケティングアプリケーション",
      source: "tysonblog 第164問",
      question: "DreamHouse Realty社(DR)のイベントマネージャーは、オープンハウスを成功させたホットリードを、関連する商談の取引先責任者にする必要があります。関連するキャンペーンメンバーの履歴を保持したまま、キャンペーンからどのようにこれを達成すべきでしょうか。",
      choices: ["リードを削除し、新しい取引先責任者と商談を作成する。","リードのコピーを作成し、クローンレコードを取引先責任者に変換する。","キャンペーンメンバーの詳細ページからリードを変換する。","キャンペーンメンバーの詳細ページから取引先責任者を追加する。"],
      answers: [2],
      explanation: `リードの変換機能を使用すると、リードを取引先責任者に変換する際に、関連するキャンペーンメンバーの履歴を保持することができます。これにより、リードの全ての履歴とキャンペーン参加情報が新しい取引先責任者レコードに引き継がれます。
        ※ この方法では、リードの履歴やキャンペーンへの参加記録が失われます。また、手動でリードの情報を取引先責任者や商談に再入力する必要があり、非効率です。
        ※ リードのコピーを作成してクローンレコードを取引先責任者に変換しても、オリジナルのリードの履歴やキャンペーンメンバーシップが保持されません。履歴を引き継ぐためには不適切です。
        ※ キャンペーンメンバーの詳細ページから取引先責任者を追加しても、リードの変換機能を使っていないため、既存のリードの履歴やキャンペーンメンバーシップは引き継がれません。履歴を保持するための方法としては適していません。`
    },
  {
      id: 164,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第165問",
      question: "Ursa Major Solar社の営業とカスタマーケアは、取引先レコードのケース関連リストに異なる項目を表示する必要があります。営業ユーザはケースのオープン日と状況を、カスタマーケアは所有者、状況、取引先責任者名を表示する必要があります。管理者は何を使用すればよいでしょうか。",
      choices: ["ルックアップ検索条件","コンパクトレイアウトエディター","ページレイアウトエディター","検索レイアウトエディター"],
      answers: [2],
      explanation: `ページレイアウトエディターを使用すると、異なるユーザーやプロファイルごとに異なるページレイアウトを設定できます。これにより、営業ユーザにはケースのオープン日と状況を、カスタマーケアには所有者、状況、取引先責任者名を表示するようにカスタマイズできます。
        ※ ルックアップ検索条件は、特定の条件に基づいてレコードをフィルタリングし、ユーザーが一致するレコードのみを見つけられるようにする機能です。取引先レコードのケース関連リストの項目表示をカスタマイズするための機能ではありません。
        ※ コンパクトレイアウトは、モバイルアプリやLightning Experienceでレコードの主要項目を表示するためのものです。関連リストの項目表示をカスタマイズする目的には適していません。
        ※ 検索レイアウトエディターは、検索結果に表示される項目をカスタマイズするためのものです。関連リストの項目表示には適していません。`
    },
  {
      id: 165,
      category: "Agentforce",
      source: "tysonblog 第166問",
      question: "Ursa Major Solar社の管理者は、AppExchangeの存在を知り、それが同社のビジネスにいかに役立つかを知ったばかりです。AppExchangeを介して実現できるアクションはどれですか。2つ選びなさい。",
      choices: ["認定開発者やコンサルタントを見つける。","データローダーをダウンロードする。","業界固有のソリューションテンプレートをインストールする。","Lightningの標準コンポーネントをダウンロードする。"],
      answers: [0,2],
      explanation: `AppExchangeでは、認定開発者やコンサルタントを見つけることができます。Salesforceの専門家を検索し、ビジネスのニーズに合ったサービスを提供するパートナーと連携することができます。
        AppExchangeには、様々な業界固有のソリューションテンプレートが用意されています。これらのテンプレートをインストールすることで、ビジネスプロセスを迅速に展開し、特定の業界要件に対応することができます。
        ※ データローダーはSalesforceの公式ツールですが、AppExchangeではなく、Salesforceの設定メニューダウンロードする必要があります。
        ※ Lightningの標準コンポーネントは、AppExchangeではなく、Salesforceプラットフォーム内で標準で提供されています。AppExchangeはカスタムコンポーネントやアプリケーションを提供するプラットフォームですが、標準コンポーネントのダウンロードは行われません。`
    },
  {
      id: 166,
      category: "自動化",
      source: "tysonblog 第167問",
      question: "Universal Containers社(UC)には、UCのカスタマーサポートチームが作業する必要のあるタスクを管理するためのキューがあります。同じチームが、UCのケースの一部を作業することになります。サポートチームを支援するために管理者が使用すべきオプションはどれですか。2つ選びなさい。",
      choices: ["ケースをキューに割り当てるフローを作成する。","割り当てルールを使用して、キューをケースの所有者に設定する。","既存のキューに利用可能なオブジェクトとしてケースを追加する。","新しいキューを作成し、利用可能なオブジェクトとしてケースを追加する。"],
      answers: [1,2],
      explanation: `割り当てルールを設定することで、ケースが特定の条件に基づいて自動的にキューに割り当てられます。これにより、カスタマーサポートチームに対して適切にケースが振り分けられ、迅速な対応が可能になります。
        既存のキューを拡張して、ケースオブジェクトを管理対象に追加することで、タスクとケースの両方を同じキューで管理できます。これにより、カスタマーサポートチームは一つのキューを使用して、異なるタイプの作業を効率的に処理できます。
        ※ フローを作成することで同様の自動化は可能ですが、既存のキューを活用するためには、割り当てルールの方がシンプルで効果的です。
        ※ 新しいキューを作成する必要はなく、既存のキューを拡張する方が管理が容易です。既存のキューにケースオブジェクトを追加することで、効率的にリソースを活用できます。`
    },
  {
      id: 167,
      category: "サービス&サポートアプリケーション",
      source: "tysonblog 第168問",
      question: "Universal Containers社は、ケースの詳細な状況を探す際のユーザーエクスペリエンスを改善しようとしています。同社は現在、ケースのすべてのレコードタイプに使用される1つのサポートプロセスを持っています。サポートプロセスには10個の状況値があります。サービス担当者は、作業しているケースの種類にもよりますが、5つ以上は必要ないと言っています。管理者は、現在の実装をどのように改善すべきでしょうか。",
      choices: ["ケースの状況項目の値の数を5つに減らす。","ケースの状況項目の正しい値のみを表示する画面フローを作成し、コンソールのユーティリティバーに表示する。","レコードタイプごとに、どの状況の選択肢が必要かを検討し、必要なサポートプロセスをそれぞれ作成する。","レコードタイプでケースの状況項目の選択肢を直接編集する。"],
      answers: [2],
      explanation: `レコードタイプごとに異なるサポートプロセスを設定することで、特定のケースに適した状況項目を表示できます。これにより、サービス担当者は作業するケースの種類に応じた適切な状況を簡単に選択できます。最適なユーザーエクスペリエンスを提供し、業務効率を向上させることができます。
        ※ 状況項目の値を一律に減らすと、必要な状況が含まれなくなる可能性があり、すべてのケースに対して適切な状況を提供できなくなります。サービス担当者が必要とするすべての状況をカバーできなくなり、実際の業務に支障をきたす可能性があります。
        ※ 画面フローを使用して状況の選択肢を制限することは可能ですが、これにはかなりのカスタマイズと開発が必要となり、メンテナンスが複雑になる可能性があります。また、画面フローを常に利用するのはユーザーにとって効率的ではない場合があります。
        ※ ケースの状況項目はサポートプロセスで管理され、レコードタイプでは直接編集できません。特別な選択リストの項目(ケースの状況、商談のフェーズなど)は、セールスプロセスやサポートプロセスでのみ使用され、レコードタイプでは使用できません。`
    },
  {
      id: 168,
      category: "データ管理&分析",
      source: "tysonblog 第169問",
      question: "ある営業担当者が退職しました。管理者は、すべての取引先と商談を新しい営業担当者に再割り当てし、チームはそのまま維持するよう求められました。管理者はどのツールを使用すればよいでしょうか。",
      choices: ["データローダー","所有権の一括変更","データインポートウィザード","Dataloader.io"],
      answers: [1],
      explanation: `所有権の一括変更は、Salesforce内で既存のレコードの所有者を一括して変更するための機能です。これを使用することで、特定の営業担当者が所有するすべての取引先や商談を新しい営業担当者に一括して再割り当てすることができます。この方法は効率的で簡単に実行できるため、最適な選択肢です。
        ※ データローダーは大量のデータをインポート、エクスポート、更新するためのツールです。手動で取引先や商談の所有者を変更することは可能ですが、複数のステップが必要で、手間がかかります。また、データローダーの使用には技術的な知識が必要です。
        ※ データインポートウィザードは、Salesforceに新しいデータをインポートするためのツールであり、既存のレコードの所有者を変更するためには適していません。一括で所有者を変更する機能は提供されていますが、複数のステップが必要であり、最適な方法ではありません。
        ※ Dataloader.ioはクラウドベースのデータ管理ツールで、データのインポート、エクスポート、更新が可能です。ただし、データローダーと同様に、所有者の一括変更には複数のステップが必要で、手間がかかります。技術的な知識も必要とされます。`
    },
  {
      id: 169,
      category: "サービス&サポートアプリケーション",
      source: "tysonblog 第170問",
      question: "Northern Trail Outfitters社は、顧客から受信したメールが自動的にケースを生成することを望んでいます。管理者は、メールが正しいキューに送信されるように、どのようにすればよいでしょうか。",
      choices: ["フローを利用して正しいキューを特定し、ケースを割り当てる。","カスタムメールサービスを使用して、作成時にケースの所有者を設定する。","正しいキューにケースを送信するためのエスカレーションルールを作成する。","メールが正しいキューに送信されるように、メール-to-ケースを設定する。"],
      answers: [3],
      explanation: `メール-to-ケースを使用することで、顧客からの受信メールを自動的にケースに変換し、指定されたルーティングアドレスに基づいて正しいユーザーやキューに割り当てることができます。ルーティングアドレスの「ケース所有者」項目を空白に設定すると、メール-to-ケースで作成されたケースに対して割り当てルールが適用されるようになり、適切なキューにケースが割り当てられます。これにより、メールが正しいキューに送信されるように設定できます。
        ※ フローを使用することで、複雑な条件に基づいてケースをキューに割り当てることは可能ですが、メールから直接ケースを生成し、キューに割り当てるためには設定が複雑になり過ぎる場合があります。
        ※ カスタムメールサービスを使用することで、メールを受信しケースを作成することはできますが、正しいキューへの割り当ては手動で設定する必要があります。標準機能を活用した方が簡単で確実です。
        ※ エスカレーションルールは、既存のケースが特定の条件を満たした場合にアクションを実行するためのルールです。ケースの生成時に正しいキューに割り当てるためのものではなく、既に存在するケースが一定時間解決されない場合などに用いられます。そのため、ケース生成時にキューを割り当てるには直接関係がありません。`
    },
  {
      id: 170,
      category: "自動化",
      source: "tysonblog 第171問",
      question: "Cloud Kicks社のサポートマネージャーは、顧客にできるだけ早く対応したいと考えています。彼らは、顧客の問題を解決するのに役立つトラブルシューティングのヒントを上位5つを回答することを要求しています。これらの要件を満たすために、管理者は何を提案すべきですか。",
      choices: ["自動レスポンスルール","メールアラート","ナレッジ記事","割り当てルール"],
      answers: [2],
      explanation: `ナレッジ記事は、Salesforceナレッジベース内で管理される情報の一部です。トラブルシューティングのヒントを含むナレッジ記事を作成し、それを参照することができます。さらに、ケースが作成された際に関連するナレッジ記事を自動的に提案する機能を使用することで、顧客に迅速に必要な情報を提供できます。
        ※ 自動レスポンスルールは、特定の条件に基づいてリードやケースが作成された際に、即座に自動的な返信メールを送信するために使用されます。しかし、特定のトラブルシューティングのヒントを動的に含めるような高度な内容には対応していません。
        ※ メールアラートは、ワークフローやプロセスビルダーによってトリガーされる自動メール通知です。これは主に内部通知や特定の条件に基づくメール送信に使用されますが、トラブルシューティングのヒントを提供するための動的なコンテンツを含むことには向いていません。
        ※ 割り当てルールは、ケースやリードが作成された際に、特定の条件に基づいて自動的に適切なユーザーやキューに割り当てるためのルールです。しかし、トラブルシューティングのヒントを提供するための直接的な手段にはなりません。`
    },
  {
      id: 171,
      category: "セールス&マーケティングアプリケーション",
      source: "tysonblog 第172問",
      question: "Ursa Major Solar社は、どのマーケティング活動がチームの商談獲得に役立っているかを知りたがっています。このような情報を提供するために、管理者はどのような設定を行う必要がありますか。",
      choices: ["キャンペーン階層","キャンペーンインフルエンス","カスタムリード項目の対応付け","リストメール"],
      answers: [1],
      explanation: `キャンペーンインフルエンスは、商談に対する各キャンペーンの影響度を追跡する機能です。これにより、どのマーケティング活動が商談獲得に貢献しているかを分析できます。キャンペーンインフルエンスを設定することで、商談の中でどのキャンペーンが影響を与えたかを確認でき、マーケティング活動の効果を測定することが可能になります。
        ※ キャンペーン階層は、キャンペーンを親子関係で整理し、集計するための機能です。これにより、複数のキャンペーンのパフォーマンスを総合的に把握できますが、個々のマーケティング活動が商談にどの程度影響を与えたかを直接測定するためのものではありません。
        ※ カスタムリード項目の対応付けは、リード情報を適切に管理し、商談や取引先責任者に変換する際に使用されます。マーケティング活動の効果を分析するための機能ではなく、リード管理に関する設定です。
        ※ リストメールは、取引先責任者やリード、キャンペーンメンバーに個別のパーソナライズしたメールを送信するための機能です。これにより、マーケティング活動の一部を実行できますが、商談に対するマーケティング活動の影響を直接測定するための機能ではありません。`
    },
  {
      id: 172,
      category: "自動化",
      source: "tysonblog 第173問",
      question: "Cloud Kicks社(CK)は、[Needs Review(レビューが必要)]というチェックボックス項目で、商談を商品エンジニアリングの誰かがレビューすべきかどうかを把握します。また、CKには、商談に[商品タイプ]という選択リスト項目があります。営業担当者が商談を保存するとき、商品タイプを選択するか、[Needs Review(レビューが必要)]ボックスをチェックする必要があります。管理者はこれを達成するために何を使用する必要がありますか。",
      choices: ["保存前更新を実行するフロー","入力規則","クイックアクション","必須項目"],
      answers: [1],
      explanation: `入力規則は、レコードの保存前に特定の条件を満たすようにデータの入力を強制するためのツールです。このケースでは、「商品タイプが選択されていない場合、Needs Reviewボックスがチェックされている必要がある」という条件を数式や条件式を用いて、入力規則で設定することで、営業担当者が商談を保存するときに必ずどちらかの条件を満たすように強制できます。これにより、商談のデータ品質を保ち、必要な情報が確実に入力されるようにします。
        ※ 保存前更新を実行するフローは、レコードの保存前に特定の条件を満たすように自動的にレコードを更新する機能です。これにより、条件に基づいて項目の値を設定できますが、特定の項目の入力を強制することはできません。
        ※ ワークフロールールは、レコードが特定の条件を満たしたときにアクションをトリガーするためのツールです。ただし、ワークフロールールはレコードが保存された後に動作するため、保存前に特定の入力条件を強制することはできません。
        ※ 項目を必須に設定することは、該当項目が常に入力されることを保証しますが、このケースではどちらか一方の項目が入力されればよいという条件です。必須項目を使用すると、「商品タイプ」も「Needs Review」も両方必須になってしまうため、この要件には適していません。`
    },
  {
      id: 173,
      category: "データ管理&分析",
      source: "tysonblog 第174問",
      question: "管理者がデータローダーを使用して、新しいAPIからカスタムオブジェクトに新しいレコードを一括インポートしようと計画しています。管理者はデータローダーを使用するために何をする必要がありますか。",
      choices: ["データのインポートを許可する権限セットを追加する。","パスワードの末尾にセキュリティトークンを追加してログインする。","データインポートウィザードを使用して、カスタムオブジェクトレコードを一括インポートする。","パスワードとセキュリティトークンをリセットする。"],
      answers: [1],
      explanation: `Salesforceに外部アプリケーションからアクセスする場合、特にデータローダーのようなAPIを使用するツールでは、セキュリティトークンが必要です。パスワードの末尾にセキュリティトークンを追加することで、Salesforceにログインできます。これは、データローダーを使用するための正しい手順です。
        ※ データのインポートを許可する権限セットを追加することで、ユーザーがデータをインポートできるようにはなりますが、データローダーを使用するために必要な手順ではありません。データローダーを使用するには、Salesforceアカウントにログインするための正しい認証情報が必要です。
        ※ データインポートウィザードは別のインポート手段であり、データローダーとは異なります。
        ※ パスワードとセキュリティトークンのリセットは、アクセスに問題がある場合に役立ちますが、データローダーを使用するための必須手順ではありません。すでにセキュリティトークンを持っている場合は、それを使用してログインすれば問題ありません。`
    },
  {
      id: 174,
      category: "セールス&マーケティングアプリケーション",
      source: "tysonblog 第175問",
      question: "DreamHouse Realty社(DR)は、新しい住宅管理サービスを発表しました。この商品は、同社が過去に提供したものとは異なるビジネスモデルです。この要件を満たすために、管理者は何を設定すべきでしょうか。",
      choices: ["新しいクイックアクションを作成する。","新しい承認プロセスを作成する。","新しいセールスプロセスを作成する。","新しい商談商品を作成する。"],
      answers: [2],
      explanation: `セールスプロセスは、商談の進行状況を管理し、一貫した販売手順を確立するために使用されます。新しいビジネスモデルに対応するためには、異なるフェーズを持つセールスプロセスが必要です。これにより、営業チームは新しい商品に対して一貫したセールスプロセスを使用でき、データの一貫性と品質が向上し、パフォーマンスの追跡と分析が容易になります。
        ※ クイックアクションは、ユーザーがSalesforceで素早く特定のタスクを実行するためのショートカットを提供する機能です。新しい商品やサービスに対応するためのビジネスモデルの変更には直接関与しません。
        ※ 承認プロセスは、レコードが特定の基準を満たした場合に承認を自動化するためのワークフローです。主にレコードの承認手続きに関与しており、新しいビジネスモデルに対応するための設定には適していません。
        ※ 新しい商談商品を作成することは、新しい商品やサービスを追跡するためには有効ですが、新しいビジネスモデルに対応するための設定には適していません。商談商品は主に商品やサービスの詳細を追跡するためのものであり、ビジネスモデル全体の変更には対応できません。`
    },
  {
      id: 175,
      category: "自動化",
      source: "tysonblog 第176問",
      question: "Universal Containers社は、商談がクローズされた場合、同じ取引先にある他のすべてのオープンな商談がクローズされたものとしてマークされなければならないことを要求しています。管理者は、この要求を実装するためにどの自動化ソリューションを使用する必要がありますか。",
      choices: ["クイックアクション","フロービルダー","フロービルダー","アウトバンドメッセージ"],
      answers: [2],
      explanation: `フロービルダーは、複雑なビジネスプロセスを自動化するためのツールです。商談がクローズされたときに、同じ取引先の他のオープンな商談をすべてクローズとしてマークするフローを作成できます。これにより、関連する複数のレコードを一括で更新することが可能です。フロービルダーの一括処理機能により、一度に多数のレコードを効率的に処理できるため、この要件を満たすのに最適です。
        ※ クイックアクションは、ユーザーが特定のタスクを迅速に実行できるショートカットを提供する機能です。しかし、自動的に他のオープンな商談をクローズとしてマークする機能はありません。
        ※ ワークフロールールは、特定の条件を満たすレコードに対して自動的にアクションを実行するためのルールです。項目自動更新によって1つのレコードの項目を更新することはできますが、関連する複数のレコードを一括で更新するような複雑な処理には適していません。
        ※ アウトバンドメッセージは、Salesforceから外部システムに情報を送信するための機能です。これは内部でレコードを更新するための自動化ソリューションではありません。`
    },
  {
      id: 176,
      category: "設定とセットアップ",
      source: "tysonblog 第177問",
      question: "Universal Containers社のIT管理者がシステムのセキュリティ監査を行っています。管理者は、システムのセキュリティの健全性をどのようにまとめればよいでしょうか。",
      choices: ["組織全体のデフォルトを非公開に変更し、可視性を制限する。","イベントモニタリングをオンにして、ユーザーイベントを追跡する。","過去6か月分のユーザーログインデータをダウンロードする。","セキュリティ状態チェックを実行して脆弱性を特定する。"],
      answers: [3],
      explanation: `セキュリティ状態チェックは、システム全体のセキュリティの健全性を評価し、潜在的な脆弱性を特定するための総合的な手段です。このツールを使用することで、設定の見直し、ベストプラクティスの確認、改善が必要な領域の特定ができます。これにより、システム全体のセキュリティの健全性を効果的にまとめることができます。
        ※ 組織全体のデフォルトを非公開に変更することでデータの可視性を制限し、セキュリティを向上させることはできますが、システム全体のセキュリティの健全性をまとめる手段ではありません。これはセキュリティ強化の一環であり、全体的なセキュリティ監査の一部に過ぎません。
        ※ イベントモニタリングをオンにすることで、ユーザーのアクティビティを追跡し、不正な行動やセキュリティインシデントを検出するのに役立ちますが、これだけではシステム全体のセキュリティの健全性を包括的にまとめることはできません。イベントモニタリングは監査の一部として有用ですが、それだけでは不十分です。
        ※ ユーザーログインデータの分析は、セキュリティ監査の一部として重要な情報を提供しますが、システム全体のセキュリティの健全性をまとめるためには他の多くの要素も考慮する必要があります。ログインデータのダウンロードは監査の一部に過ぎません。`
    },
  {
      id: 177,
      category: "設定とセットアップ",
      source: "tysonblog 第178問",
      question: "Cloud Kicks社の分析ユーザーは、オブジェクトの参照、作成、編集のアクセス権が必要で、レコードの削除を制限する必要があります。この要件を満たすために管理者は何をすべきですか。",
      choices: ["参照、作成、編集を含む権限セットを作成し、割り当てる。","分析ユーザーに標準のシステム管理者プロファイルを割り当てる。","分析ユーザーに[すべて表示]権限を与え、ロール階層で最も高いロールに割り当てる。","各オブジェクトの削除アクセス権が削除されたカスタムプロファイルを作成し、割り当てる。"],
      answers: [3],
      explanation: `カスタムプロファイルを作成し、各オブジェクトの削除権限を外すことで、参照、作成、編集の権限を持たせながら、レコードの削除を制限することができます。この設定により、分析ユーザーが必要な操作を行えるようにしつつ、削除を防ぐことができます。
        ※ 権限セットは既存のプロファイルに追加するためのものであり、既に削除権限を持っているプロファイルに追加しても削除制限を行うことはできません。削除権限を持たせないようにするには、プロファイル自体の設定を変更する必要があります。
        ※ システム管理者プロファイルはすべての権限を持っているため、レコードの削除も許可されてしまいます。この設定では、削除を制限するという要件を満たすことができません。
        ※ [すべて表示]権限はすべてのレコードを表示できますが、参照、作成、編集の権限が含まれません。また、ロール階層の最上位に割り当てると不要な権限が付与され、共有ルールや設定を無視して過剰なアクセスを許可してしまいます。このため、レコードの削除を制限する要件を満たしません。`
    },
  {
      id: 178,
      category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
      source: "tysonblog 第179問",
      question: "主従関係の特徴はどれですか。3つ選びなさい。",
      choices: ["積み上げ集計項目は主従関係でのみサポートされる。","従レコードの所有者項目は、主レコードの所有者である。","各オブジェクトは、最大5つの主従関係を持つことができる。","従レコードの権限は、主従関係とは別に設定される。","標準またはカスタムオブジェクトを主オブジェクトにできる。"],
      answers: [0,1,4],
      explanation: `積み上げ集計項目は主従関係においてのみ使用できます。積み上げ集計項目を使用することで、主レコードに従レコードの情報を集計することができます。
        主従関係において、従レコードの所有者は自動的に主レコードの所有者になります。従レコード自体に独自の所有者を設定することはできません。
        標準オブジェクトおよびカスタムオブジェクトの両方を主オブジェクトにすることができます。ただし、標準オブジェクトを従オブジェクトにすることはできません。
        ※ 各カスタムオブジェクトは、最大2つの主従関係を持つことができます。5つではありません。
        ※ 従レコードの権限は主レコードの権限に従います。従レコード自体の権限を個別に設定することはできません。`
    },
  {
      id: 179,
      category: "サービス&サポートアプリケーション",
      source: "tysonblog 第180問",
      question: "Ursa Solar Major社は、サービスチーム向けにSalesforceを評価しています。サポートのユースケースを考えている管理者が利用できる標準オブジェクトはどれですか。3つ選びなさい。",
      choices: ["リクエスト","チケット","契約","取引先","ケース"],
      answers: [2,3,4],
      explanation: `「契約」はSalesforceの標準オブジェクトであり、サポートユースケースの一部として利用できます。例えば、サービス契約やサポート契約の管理に使用されます。
        「取引先」はSalesforceの標準オブジェクトであり、顧客やパートナーの情報を管理します。サポートユースケースにおいても、取引先情報は重要です。
        「ケース」はSalesforceの標準オブジェクトであり、サポートチケットや顧客の問い合わせを管理するために使用されます。サポートユースケースには必須のオブジェクトです。
        ※ 「リクエスト」はSalesforceの標準オブジェクトとしては存在しません。
        ※ 「チケット」はSalesforceの標準オブジェクトとしては存在しません。`
    },
  {
      id: 180,
      category: "自動化",
      source: "tysonblog 第181問",
      question: "Northern Trail Outfitters社のマーケティングディレクターが、リードの状況項目を”適格”とマークするために予算項目に入力するよう要求しています。この要求を満たすために、管理者はどのツールを使用すべきですか。",
      choices: ["リード変換","入力規則","必須項目","フロービルダー"],
      answers: [1],
      explanation: `入力規則は、レコードが保存される前に特定の条件を満たしているかどうかを確認し、条件を満たさない場合にエラーメッセージを表示して保存を防ぎます。この場合、リードの状況項目が「適格」と設定される前に、予算項目が入力されていることを強制するために、入力規則を使用するのが適切です。
        ※ リード変換は、リードを取引先、取引先責任者、商談に変換するプロセスです。リードの状況項目を「適格」とマークするための特定の条件(この場合は予算項目の入力)を強制するツールではありません。
        ※ 必須項目は特定の項目に必ず値が入力されることを強制しますが、条件付きの強制は行いません。この場合、リードの状況項目が「適格」と設定される前に予算項目が入力されているかどうかをチェックする必要があるため、必須項目の設定だけでは不十分です。
        ※ ワークフロールールは、特定の条件が満たされたときに自動化されたアクションを実行するためのツールです。しかし、リードの状況項目を「適格」と設定する前に予算項目が入力されていることを強制するためのツールではありません。`
    },
  {
      id: 181,
      category: "Agentforce",
      source: "オリジナル問題 第182問",
      question: "Agentforceエージェントが特定のSalesforceオブジェクトのレコードを読み取り・更新できるようにするために必要な設定はどれですか？",
      choices: ["エージェントに専用のSalesforceユーザーライセンスを付与する","エージェントユーザープロファイルに対象オブジェクトのオブジェクト権限（読み取り・編集）を付与する","フロービルダーで読み取りフローを作成する","Apexクラスを作成してエージェントAPIに接続する"],
      answers: [1],
      explanation: `エージェントは「エージェントユーザー」という専用ユーザーとして動作します。そのため、エージェントが操作するオブジェクトへのアクセスは、エージェントユーザーに割り当てられたプロファイルや権限セットで制御します。対象オブジェクトの読み取り・編集権限を付与することで、エージェントがレコードを参照・更新できるようになります。
        ※ エージェントユーザーはSalesforceが自動的に作成する専用ユーザーであり、通常のユーザーライセンスとは異なります。
        ※ フロービルダーはエージェントのアクションとして利用できますが、オブジェクトアクセスの制御はプロファイル・権限セットで行います。
        ※ Apexは高度なカスタマイズに使用できますが、基本的なレコードアクセスの設定には不要です。`
    },
  {
      id: 182,
      category: "Agentforce",
      source: "オリジナル問題 第183問",
      question: "Cloud Kicks社は、Agentforceエージェントに返品ポリシーに関する回答をさせたいと考えています。ただし、エージェントが古いFAQや未承認のメモを根拠に回答することは避けたいと考えています。管理者が最初に行うべき設定はどれですか。",
      choices: ["回答トーン設定","信頼コンテンツ設定","全員に編集権限","Apex回答上書き"],
      answers: [1],
      explanation: `Agentforceで正確な回答を返すには、エージェントが参照する信頼済みコンテンツを明確にすることが重要です。承認済みのナレッジ記事や適切なデータソースをグラウンディングに使用することで、最新かつ会社として承認された情報に基づく回答を促せます。
        ※ 応答トーンは表現の調整であり、参照元の正確性を保証しません。
        ※ すべてのユーザーに編集権限を与えると、未承認情報が混入するリスクが高まります。
        ※ Apexで回答を上書きする方法は過度に複雑で、まずは信頼できる参照元の設定を行うべきです。`
    },
  {
      id: 183,
      category: "Agentforce",
      source: "オリジナル問題 第184問",
      question: "Universal Containers社は、Agentforceエージェントがケースの優先度を変更できるようにしたいと考えています。ただし、エージェントにはケースの削除を許可したくありません。管理者はどのようにアクセスを制御すべきですか。",
      choices: ["ケースの参照・編集のみ許可","トピック指示だけで制御","共有設定を公開/更新可能に変更","全ケース項目を参照のみに変更"],
      answers: [0],
      explanation: `エージェントが実行できるレコード操作は、エージェントユーザーに割り当てられたプロファイルや権限セットのオブジェクト権限・項目権限に従います。優先度を更新させるにはケースの編集権限が必要ですが、削除を禁止するには削除権限を付与しない構成にします。
        ※ 指示文は動作方針として役立ちますが、権限管理の代替にはなりません。
        ※ 共有設定はレコードの可視性を広げるもので、削除権限の制御には不十分です。
        ※ 参照のみでは優先度を更新できません。`
    },
  {
      id: 184,
      category: "Agentforce",
      source: "オリジナル問題 第185問",
      question: "Ursa Major Solar社の管理者は、Agentforceエージェントに「保証交換を開始する」操作を追加したいと考えています。この操作では、画面入力ではなく、ケース情報をもとに複数のレコードを作成・更新する必要があります。管理者がアクションとして利用するのに最も適切なものはどれですか。",
      choices: ["保存時起動フロー","自動起動フロー","画面の動的フォーム","リストビュー操作"],
      answers: [1],
      explanation: `Agentforceのアクションとして、管理者はフローなどの自動化を利用できます。ユーザー画面を表示せず、エージェントから渡された情報をもとに複数レコードを作成・更新する処理には、自動起動フローが適しています。
        ※ レコードトリガーフローはレコード保存を契機に動作するため、エージェントの明示的な操作として呼び出す用途とは異なります。
        ※ 動的フォームはページ上の項目表示を制御する機能です。
        ※ リストビューアクションはリスト上のユーザー操作向けで、エージェントの業務処理アクションとしては適していません。`
    },
  {
      id: 185,
      category: "Agentforce",
      source: "オリジナル問題 第186問",
      question: "Northern Trail Outfitters社は、Agentforceエージェントが顧客に割引を約束しないようにしたいと考えています。割引可否の判断は営業マネージャーの承認が必要です。管理者がエージェント設計で優先すべき対応はどれですか。",
      choices: ["人間への引き継ぎ設計","商談項目の全編集許可","割引提案プロンプト","割引項目の画面非表示"],
      answers: [0],
      explanation: `エージェントに任せてよい業務範囲を明確にし、承認が必要な判断や契約条件の約束は人間に引き継ぐ設計が適切です。Agentforceではトピック、指示、アクションの範囲を調整して、エージェントが実行できる業務を制御します。
        ※ 過剰な編集権限はリスクを高めます。
        ※ 承認なしの割引提案は要件に反します。
        ※ ページレイアウトから項目を外しても、APIや自動化経由のアクセス制御にはなりません。`
    },
  {
      id: 186,
      category: "Agentforce",
      source: "オリジナル問題 第187問",
      question: "Cloud Kicks社の管理者は、Agentforceエージェントが「注文状況」「返品」「製品保証」の質問に対応できるようにしたいと考えています。質問の種類ごとに異なる指示とアクションを関連付けるために、管理者が設定する主要な構成要素はどれですか。",
      choices: ["トピック設定","レコードタイプ設定","共有ルール設定","コンパクト表示設定"],
      answers: [0],
      explanation: `Agentforceでは、エージェントが対応する業務領域をトピックとして整理し、各トピックに説明、指示、利用可能なアクションを関連付けます。質問の種類ごとに動作や利用アクションを分けるにはトピックの設計が重要です。
        ※ レコードタイプはレコードのビジネスプロセスやページレイアウトなどを分けるための機能です。
        ※ 共有ルールはレコードアクセスを拡張するための機能です。
        ※ コンパクトレイアウトはレコードの主要項目表示を制御します。`
    },
  {
      id: 187,
      category: "Agentforce",
      source: "オリジナル問題 第188問",
      question: "Universal Containers社は、Agentforceエージェントの回答が意図した手順に従っているかを本番公開前に確認したいと考えています。管理者が行うべき最も適切な作業はどれですか。",
      choices: ["本番公開後の顧客検証","プレビューでの会話テスト","エージェントユーザー無効化","全トピック無効化"],
      answers: [1],
      explanation: `エージェントは公開前に代表的なユーザー発話でテストし、適切なトピックが選択されるか、指示に沿った回答になるか、必要なアクションが正しく実行されるかを検証する必要があります。これにより、本番公開前に誤回答や権限不足を発見できます。
        ※ 未検証のまま顧客に公開するのはリスクが高すぎます。
        ※ エージェントユーザーを無効化すると動作確認や実行ができません。
        ※ トピックを無効化すると、エージェントが対象業務に対応できません。`
    },
  {
      id: 188,
      category: "Agentforce",
      source: "オリジナル問題 第189問",
      question: "Ursa Major Solar社は、Agentforceエージェントが顧客の問い合わせ内容を要約してケースの説明に保存できるようにしたいと考えています。管理者は、ケースの説明項目だけを更新可能にし、他の機密項目は更新させたくありません。どの設定を確認すべきですか。2つ選びなさい。",
      choices: ["項目レベルセキュリティ","オブジェクト権限","デフォルト言語","ホームページコンポーネント"],
      answers: [0,1],
      explanation: `エージェントがケースを更新するには、ケースオブジェクトに対する編集権限が必要です。さらに、更新可能な項目を制御するには項目レベルセキュリティで対象項目への編集権限を管理します。機密項目を更新させないためには、エージェントユーザーの権限設計が重要です。
        ※ デフォルト言語は権限制御には関係しません。
        ※ ホームページコンポーネントはエージェントの項目更新権限を制御しません。`
    },
  {
      id: 189,
      category: "Agentforce",
      source: "オリジナル問題 第190問",
      question: "Cloud Kicks社は、Agentforceエージェントがナレッジ記事を引用して回答する際、公開済み記事のみを根拠にしたいと考えています。管理者が確認すべき設定はどれですか。",
      choices: ["ナレッジの公開状態と可視性","ユーザーのタイムゾーン","商談のセールスプロセス","ケース割り当て順序"],
      answers: [0],
      explanation: `エージェントの回答品質を保つには、参照元となるナレッジやデータソースの範囲と可視性を確認する必要があります。公開済みで利用対象に含まれる記事だけを参照できるようにすれば、未公開または下書き記事に基づく回答を避けられます。
        ※ タイムゾーンは日時表示に影響しますが、記事の根拠設定には関係しません。
        ※ セールスプロセスは商談フェーズの制御です。
        ※ ケース割り当てルールはケース所有者の割り当てに関する設定です。`
    },
  {
      id: 190,
      category: "Agentforce",
      source: "オリジナル問題 第191問",
      question: "Universal Containers社では、Agentforceエージェントが注文キャンセルを実行する前に、注文状況が「出荷前」であることを確認する必要があります。管理者が最も適切に実装できる方法はどれですか。",
      choices: ["指示文だけで条件を指定","アクション内で条件判定","注文タブを非表示","キャンセル値を削除"],
      answers: [1],
      explanation: `業務ルールを確実に守るには、エージェントの自然言語指示だけでなく、実行されるアクション側にも条件を組み込むことが重要です。自動起動フローなどで注文状況を確認し、出荷前の場合だけキャンセル更新を行う構成が適切です。
        ※ 指示文だけでは実行時のデータ条件を強制する仕組みとして不十分です。
        ※ タブの表示はエージェントのアクション実行条件を制御しません。
        ※ 値を削除すると正当なキャンセル処理もできなくなる可能性があります。`
    },
  {
      id: 191,
      category: "Agentforce",
      source: "オリジナル問題 第192問",
      question: "Northern Trail Outfitters社の管理者は、Agentforceエージェントが顧客から個人情報の削除依頼を受けた場合に、すぐに削除処理を実行せず、プライバシーチームへ引き継ぎたいと考えています。最も適切な設計はどれですか。",
      choices: ["削除アクションを即時実行","ケース作成・キュー引き継ぎ","全データ削除権限を付与","全ナレッジ記事を非公開"],
      answers: [1],
      explanation: `個人情報削除のような高リスク処理は、人間の確認や正式プロセスに引き継ぐ設計が適切です。エージェントは削除そのものではなく、依頼内容を記録し、プライバシーチームのキューへケースを送るアクションに限定します。
        ※ 確認なしの削除はリスクが高く、要件にも反します。
        ※ 過剰な削除権限を付与すべきではありません。
        ※ ナレッジ記事の公開状態は、削除依頼のワークフロー設計とは直接関係しません。`
    },
  {
      id: 192,
      category: "Agentforce",
      source: "オリジナル問題 第193問",
      question: "Cloud Kicks社は、Agentforceエージェントが会話中に顧客の注文番号を受け取り、その注文レコードを検索して回答するようにしたいと考えています。エージェントが正しいレコードを検索できるようにするために必要な考慮事項はどれですか。",
      choices: ["注文番号を入力変数に使用","注文番号を画面から削除","注文番号をランダム化","エスカレーションを無効化"],
      answers: [0],
      explanation: `エージェントが会話から取得した値を使ってレコードを検索するには、その値をアクションの入力として受け渡し、フローやアクション内で検索条件に使用できる設計が必要です。注文番号のような一意に近い識別子を入力として使うと、対象レコードを特定しやすくなります。
        ※ ページレイアウトから削除しても、エージェントの検索条件として使えるようにはなりません。
        ※ ランダム値に置き換えると正しい注文を検索できません。
        ※ エスカレーションルールは注文検索とは関係しません。`
    },
  {
      id: 193,
      category: "Agentforce",
      source: "オリジナル問題 第194問",
      question: "Universal Containers社では、Agentforceエージェントが回答に自信を持てない場合や、顧客が強い不満を示した場合に、サービス担当者へ引き継ぐ必要があります。管理者が設定すべき内容はどれですか。",
      choices: ["担当者引き継ぎ","ケース自動削除","商談トピック化","組織言語固定"],
      answers: [0],
      explanation: `エージェントが対応範囲外や高リスクの会話を処理する場合、人間へ引き継ぐ経路を設計しておく必要があります。ケース作成、キューへの割り当て、担当者へのエスカレーションなどのアクションを用意し、指示で利用条件を明確にします。
        ※ ケース削除は問題解決にならず、データ損失を招きます。
        ※ 商談管理トピックへの変更はサービス問い合わせの引き継ぎ要件に合いません。
        ※ 言語設定はエスカレーション設計の代替ではありません。`
    },
  {
      id: 194,
      category: "Agentforce",
      source: "オリジナル問題 第195問",
      question: "Ursa Major Solar社の管理者は、Agentforceエージェントが利用するフローを更新しました。変更後、エージェントが注文更新に失敗するようになりました。最初に確認すべき原因はどれですか。",
      choices: ["フロー変数の一致確認","ホームタブ順序の確認","メール署名長の確認","キャンペーン階層の確認"],
      answers: [0],
      explanation: `エージェントアクションとしてフローを使用する場合、エージェントから渡す入力やフローから返す出力が定義と一致している必要があります。フロー変更後に失敗する場合は、変数名、データ型、必須入力、実行権限を確認するのが自然です。
        ※ ホームタブの表示順はフロー実行失敗の主因ではありません。
        ※ メール署名は注文更新アクションとは関係しません。
        ※ キャンペーン階層は注文更新フローとは関係しません。`
    },
  {
      id: 195,
      category: "Agentforce",
      source: "オリジナル問題 第196問",
      question: "Cloud Kicks社は、Agentforceエージェントが商品の在庫状況を回答する際、Salesforce外部の在庫システムから最新値を取得したいと考えています。管理者が検討すべき構成はどれですか。",
      choices: ["外部連携アクション","固定ナレッジ記事","ケース優先度の変更","商談チームの有効化"],
      answers: [0],
      explanation: `外部システムの最新値が必要な場合、エージェントが利用できるアクションを通じて外部連携やフローを実行する構成が適しています。静的な記事だけでは、在庫のように変動する情報を正確に回答できません。
        ※ 手入力の固定値はすぐに古くなる可能性があります。
        ※ ケース優先度は在庫取得には関係しません。
        ※ 商談チームは商談の共同作業者を管理する機能です。`
    },
  {
    id: 196,
    category: "設定とセットアップ",
    source: "新方式対策 高難度再改訂 ID196",
    question: "組織では現在1月から12月を会計年度として使用していますが、全社方針の変更により翌年度から2月開始へ統一します。月と四半期は通常の暦月単位のままで、4週、4週、5週のような特殊期間は不要です。売上予測や標準の会計期間検索条件にも新しい年度を反映し、不要な不可逆設定は避けます。適切な対応はどれですか。",
    choices: [
      "標準会計年度の開始月を2月へ変更しレポートと売上予測への影響を確認する",
      "2月1日から始まる営業時間を作成し商談の完了予定日に割り当てる",
      "会計年度は1月開始のままにして商談へ年度判定用の入力規則を追加する",
      "カスタム会計年度を有効化し通常の12か月を年度ごとに手動作成して特殊期間にも備える"
    ],
    answers: [0],
    explanation: "標準会計年度は、開始月だけを変更して通常の月または四半期で年度を構成する要件に適しています。期間構成が年ごとに変わらないため、カスタム会計年度は不要です。\n        ※ 営業時間はケースのエスカレーションやサポート時間の計算などに使用され、会計年度を定義しません。\n        ※ 入力規則は保存値を検証する機能であり、レポートや売上予測で使われる会計期間を設定できません。\n        ※ カスタム会計年度は週基準や特殊な会計期間など、標準会計年度で表せない構成に使用します。有効化後の影響も大きく、この要件には過剰です。"
  },
  {
    id: 197,
    category: "設定とセットアップ",
    source: "新方式対策 高難度再改訂 ID197",
    question: "プレミアムサポートの一次対応期限は、東京窓口が営業する平日の午前9時から午後5時だけ進めます。土日と会社指定の休業日は期限計算から除外しますが、担当者自身のSalesforceログインは時間外にも許可します。期限計算の基盤として必要な設定を2つ選びなさい。",
    choices: [
      "休業日を会社の休日として登録し対象のサポート時間へ関連付ける",
      "平日の受付時間を表すサポート用営業時間を作成して期限計算に使用する",
      "標準会計年度の期間から土日と休業日を除外してケースへ適用する",
      "担当者のプロファイルへ平日の日中だけを許可するログイン時間を設定する"
    ],
    answers: [0, 1],
    explanation: "営業時間で稼働する曜日と時間帯を定義し、休日を関連付けることで、エスカレーション時間から休業日を除外できます。\n        ※ 会計年度はレポートや売上予測の期間を定義する設定で、サポート時間には影響しません。\n        ※ ログイン時間はユーザーがSalesforceへログインできる時間を制限する設定で、ケースの経過時間計算には使用しません。"
  },
  {
    id: 198,
    category: "設定とセットアップ",
    source: "新方式対策 高難度再改訂 ID198",
    question: "複数通貨組織では、月ごとに会社指定の換算レートが変わります。営業責任者は、昨年度に成立した商談の換算額を当時のレートのまま分析しながら、今月作成する商談には今月のレートを適用したいと考えています。利用者に商談ごとのレート入力はさせません。適切な構成はどれですか。",
    choices: [
      "会社情報の現在レートだけを更新し成立済みを含む全商談を最新レートで再計算する",
      "高度な通貨管理を有効化し適用開始日を持つ期間別換算レートを管理する",
      "商談へ手入力の固定レート項目を作り各営業担当者に換算額を計算させる",
      "全利用者の個人通貨を会計通貨へ変更して商談通貨の違いをなくす"
    ],
    answers: [1],
    explanation: "高度な通貨管理では、商談などに期間別換算レートを適用できます。レートの有効期間を分けることで、過去と現在の商談を異なるレートで評価できます。\n        ※ 通常の換算レートを更新すると、期間別に過去の商談を評価する要件を満たせません。\n        ※ カスタム項目による手入力は入力漏れや計算不整合を招き、標準の通貨換算機能とも分離します。\n        ※ ユーザー通貨は表示や新規レコードの既定通貨に関係しますが、期間別レートを管理する設定ではありません。"
  },
  {
    id: 199,
    category: "設定とセットアップ",
    source: "新方式対策 高難度再改訂 ID199",
    question: "退職処理中の利用者が、承認プロセスの既定承認者と定期実行レポートの実行者に残っているため、直ちには無効化できません。依存関係を修正して所有レコードを移管する間もライセンスと利用者設定は保持しますが、今すぐ新しいログインセッションを開始できない状態にする必要があります。最初の対応はどれですか。",
    choices: [
      "利用者からロールだけを外してレコード階層への参加を止める",
      "共通プロファイルのログイン時間を変更して全所属利用者を停止する",
      "対象利用者を凍結して依存関係を解消するまでログインを停止する",
      "依存関係を残したまま利用者を無効化してライセンスを直ちに回収する"
    ],
    answers: [2],
    explanation: "ユーザーの凍結はログインを直ちに停止しながら、ユーザーを有効な状態に保ちます。無効化を妨げる依存関係の整理やレコード移管を行う間の一時措置に適しています。\n        ※ ロールを外してもオブジェクト権限やログイン権限は残るため、ログイン停止にはなりません。\n        ※ ログイン時間の変更はプロファイルを共有する他ユーザーにも影響し、即時かつ個別の停止方法として適切ではありません。\n        ※ 無効化もログインを停止しますが、今回は所有レコードの移管前でライセンスを維持するという条件があります。まず凍結し、依存関係を整理してから無効化します。"
  },
  {
    id: 200,
    category: "設定とセットアップ",
    source: "新方式対策 高難度再改訂 ID200",
    question: "購入済みの分析アドオンを試験利用者へ展開します。専用の権限セットを割り当てようとすると利用資格不足のエラーになり、ライセンスだけを割り当てた別の利用者は分析画面を開けません。同じプロファイルの一部だけへ、他の管理権限を増やさず利用させるために必要なものを2つ選びなさい。",
    choices: [
      "分析対象レコード所有者より上位になる専用ロール",
      "分析レポートを格納するフォルダーの所有者権限",
      "購入した分析機能に対応する権限セットライセンス",
      "分析の機能権限を必要最小限だけ含む権限セット"
    ],
    answers: [2, 3],
    explanation: "権限セットライセンスは対象製品や機能を利用できる資格を付与し、権限セットは実際に必要なユーザー権限を付与します。機能によっては両方が必要です。\n        ※ ロールは主にレコードレベルの参照範囲へ影響し、製品ライセンスや機能権限を付与しません。\n        ※ フォルダー所有者は分析資産の管理には関係しますが、ユーザーへ製品利用資格を付与しません。"
  },
  {
    id: 201,
    category: "設定とセットアップ",
    source: "新方式対策 高難度再改訂 ID201",
    question: "商談の組織の共有設定は非公開です。営業担当者は自分の商談だけを扱い、チームリーダーは担当者の異動や組織変更に追随して直属部下の商談を参照します。同じ階層の別チームや担当者同士へは共有せず、所有者ごとの共有ルールも増やしません。基礎となる設計はどれですか。",
    choices: [
      "全営業担当者を同じ公開グループへ入れグループ内参照を有効にする",
      "所有者に基づく共有ルールで営業部門の全商談を相互に共有する",
      "リーダーのプロファイルへ商談の参照権限だけを追加して部下へ限定する",
      "実際の監督関係に合わせたロール階層を構成して上位アクセスを利用する"
    ],
    answers: [3],
    explanation: "非公開の共有モデルとロール階層を組み合わせると、上位ロールのマネージャーは下位ロールが所有する商談を参照できます。担当者同士への横方向の共有は発生しません。\n        ※ 公開グループへ追加しただけではレコードアクセスは付与されません。別途共有ルールなどが必要です。\n        ※ 部門全体への共有ルールは営業担当者同士にもアクセスを与えるため、要件より広い共有になります。\n        ※ オブジェクトの参照権限だけでは、非公開に設定された個別商談へのレコードアクセスを付与できません。"
  },
  {
    id: 202,
    category: "設定とセットアップ",
    source: "新方式対策 高難度再改訂 ID202",
    question: "委託先の職務には、既存の三つの権限セットを組み合わせて割り当てます。そのうち一つの権限セットが付与する契約削除だけは委託先から除外します。基準プロファイルやグループ外の権限セットから同じ削除権限は付与されておらず、元の権限セットは他職務でも利用中のため変更できません。最も保守しやすい構成はどれですか。",
    choices: [
      "権限セットグループへ三つをまとめ契約削除をミュートする権限セットを適用する",
      "委託先を下位ロールへ移して契約削除をロール階層で拒否する",
      "契約関連リストをページレイアウトから外して削除権限も失わせる",
      "委託先ごとに三つの権限を複製した専用プロファイルを新規作成する"
    ],
    answers: [0],
    explanation: "権限セットグループは職務に必要な権限セットをまとめて割り当てられます。グループ内で不要な権限はミュート権限セットを使用して抑制できます。\n        ※ ロール階層はレコードアクセスを継承する仕組みで、オブジェクト権限を取り除きません。\n        ※ ページ上の表示を外しても、権限があればリストビュー、レポート、APIなどからアクセスできる可能性があります。\n        ※ 利用者ごとのプロファイル増加は保守負荷を高めます。また、追加権限を柔軟に組み合わせる要件には権限セットグループが適しています。"
  },
  {
    id: 203,
    category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
    source: "新方式対策 高難度再改訂 ID203",
    question: "請求書と請求明細を新規設計します。明細は請求書とは別に共有せず、請求書を削除したときは明細も同じライフサイクルで削除します。さらに、承認済み明細だけの金額を請求書上へコードや補助オブジェクトなしで集計します。採用すべき関係はどれですか。",
    choices: [
      "請求書番号を一意なテキストとして明細へ保存しレポートで関連付ける",
      "請求書を親、請求明細を詳細とする主従関係を作成する",
      "請求書への参照関係を作成し削除と集計は標準参照動作へ任せる",
      "請求明細から別の請求明細を親として選ぶ自己参照関係を作成する"
    ],
    answers: [1],
    explanation: "主従関係では、詳細レコードの共有と所有権が親に従い、親の削除時に詳細も削除されます。また、親側に積み上げ集計項目を作成できます。\n        ※ テキスト項目では参照整合性、関連リスト、削除連動、積み上げ集計を実現できません。\n        ※ 参照関係は子レコードの独立性を保てますが、標準の積み上げ集計項目は利用できず、削除連動もこの要件と異なります。\n        ※ 自己参照関係は同じオブジェクト内の階層を表すため、請求書と請求明細という別オブジェクトの関係には適しません。"
  },
  {
    id: 204,
    category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
    source: "新方式対策 高難度再改訂 ID204",
    question: "初回受付時には顧客企業を特定できない問い合わせがあり、後から取引先へ関連付けます。問い合わせは独自の所有者と共有設定を持ち、関連付けた取引先が統合や削除の対象になっても問い合わせ自体は保持して別の取引先へ付け替えられる必要があります。最適な関係はどれですか。",
    choices: [
      "問い合わせを詳細側にした取引先への主従関係を作成する",
      "取引先の利用者階層を参照する階層関係を問い合わせへ作成する",
      "空欄と再設定を許可する取引先への参照関係を作成する",
      "取引先名を固定値として持つ制限付き選択リストを問い合わせへ作成する"
    ],
    answers: [2],
    explanation: "参照関係では親の指定を任意にでき、子レコードは独自の所有者と共有設定を保持できます。親が未確定でも作成できるという要件に合います。\n        ※ 主従関係では詳細レコードが親の所有権と共有に従い、通常は親の指定も必要になるため要件に合いません。\n        ※ 階層関係はユーザーオブジェクトで管理関係を表す特殊な関係で、一般のカスタムオブジェクト間には使用しません。\n        ※ 選択リストでは実際の取引先レコードとの関係を作れず、関連リストや参照整合性も利用できません。"
  },
  {
    id: 205,
    category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
    source: "新方式対策 高難度再改訂 ID205",
    question: "社員は複数の研修コースへ参加でき、各コースにも複数の社員が参加します。同じ社員とコースの組み合わせごとに申込日、受講状態、得点を一組だけ保持し、社員側とコース側のどちらからも参加履歴をレポートします。適切なデータモデルはどれですか。",
    choices: [
      "コースへ社員名の複数選択リストを置き申込日と得点を別テキストへ連結する",
      "社員とコースへ同じ外部IDを割り当てて一致する値をレポートで結合する",
      "社員から一つのコースだけを参照する項目を作り参加のたびに上書きする",
      "社員とコースを二つの関係で結ぶ参加連結オブジェクトを作成する"
    ],
    answers: [3],
    explanation: "多対多関係は、二つの親を持つ連結オブジェクトで表現します。参加日や修了状況は、社員と研修コースの組み合わせを表す連結レコードに保存できます。\n        ※ 複数選択リストは社員レコードとの参照整合性を持たず、参加ごとの属性も保存できません。\n        ※ 外部IDはデータ連携時の照合に使う項目で、オブジェクト間の多対多関係を作成しません。\n        ※ 社員側の参照項目が一つだけでは、一人の社員を複数コースへ関連付ける多対多関係を表現できません。"
  },
  {
    id: 206,
    category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
    source: "新方式対策 高難度再改訂 ID206",
    question: "同じ営業プロファイルの利用者が直販商談と代理店商談の両方を作成します。直販では交渉中を含むフェーズ群、代理店では審査中を含む別のフェーズ群を使い、商談種別などの選択肢と標準編集画面の必須項目も変えます。必要な構成を3つ選びなさい。",
    choices: [
      "各販売方式に必要な項目と必須設定を持つページレイアウト",
      "各販売方式で利用できる商談フェーズを定義する営業プロセス",
      "営業プロセスや選択リスト値を利用者が選び分ける商談レコードタイプ",
      "販売方式ごとに所有者以外の参照範囲を変える組織の共有設定"
    ],
    answers: [0, 1, 2],
    explanation: "営業プロセスで利用可能な商談フェーズを定義し、レコードタイプへ関連付けます。レコードタイプでは選択リスト値を分け、ページレイアウトを割り当てて入力画面を切り替えます。\n        ※ 組織の共有設定は商談レコードへの基準アクセスを定義しますが、フェーズ、選択リスト値、入力画面の切り替えには使用しません。"
  },
  {
    id: 207,
    category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
    source: "新方式対策 高難度再改訂 ID207",
    question: "ケースの機密分析項目は監査担当者だけが、レポート、API、検索を含むすべての経路で参照できます。監査担当者のLightning画面でも、優先度が高かつ状況が調査中のときだけ項目を表示して入力させます。二つの異なる要件を満たす設定を2つ選びなさい。",
    choices: [
      "監査担当者だけへ参照と編集を許可する項目レベルセキュリティ",
      "機密分析を先頭へ置いた監査用コンパクトレイアウト",
      "優先度と状況を評価する動的フォームのコンポーネント表示条件",
      "監査担当者へケースを共有する条件ベース共有ルール"
    ],
    answers: [0, 2],
    explanation: "動的フォームの表示条件で優先度に応じた画面表示を制御し、項目レベルセキュリティで項目そのものの参照可否を制御します。画面上の非表示だけをセキュリティ境界にしてはいけません。\n        ※ コンパクトレイアウトは強調表示パネルなどの主要項目を定義しますが、条件付き表示や項目権限を実現しません。\n        ※ 共有ルールはケースレコードへのアクセスを追加する機能で、特定項目の表示条件や参照権限は制御しません。"
  },
  {
    id: 208,
    category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
    source: "新方式対策 高難度再改訂 ID208",
    question: "取引先責任者には、親取引先で現在選択されている顧客ランクを表示します。親のランクを変更した直後から全子レコードで新しい値が見えればよく、変更時点の値を履歴として固定保存したり、利用者に同期操作をさせたりする必要はありません。最適な項目設計はどれですか。",
    choices: [
      "親取引先の顧客ランクを参照するクロスオブジェクト数式項目を作成する",
      "取引先責任者を集計対象にした積み上げ集計項目でランクを取得する",
      "顧客ランクを連番へ変換する自動採番項目を取引先責任者へ作成する",
      "作成時の親ランクを保存する編集可能テキスト項目を使い親変更時は担当者が同期する"
    ],
    answers: [0],
    explanation: "クロスオブジェクト数式は、関連する親レコードの値を計算時に参照します。親の顧客ランクが変わると、子側の表示も手動コピーなしで更新されます。\n        ※ 積み上げ集計項目は詳細レコードの件数や数値を親側で集計する機能で、子側に親の文字列を表示する用途ではありません。\n        ※ 自動採番項目は一意な連番を生成し、関連レコードの値を参照しません。\n        ※ 編集可能なテキストへ値を固定保存する方式では、親の変更を自動反映できません。担当者による同期は入力漏れや不整合も招きます。"
  },
  {
    id: 209,
    category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
    source: "新方式対策 高難度再改訂 ID209",
    question: "申請種別が設備なら故障と交換、出張なら交通と宿泊だけを申請理由として選択させます。データ連携や利用者が定義外の理由を保存することも拒否し、種別を変更したときは許可された候補だけを入力画面に提示します。必要な設定を2つ選びなさい。",
    choices: [
      "申請種別を一意な外部IDとして重複を禁止する",
      "申請理由を定義済み値以外を拒否する制限付き選択リストにする",
      "申請理由を複数選択リストにして全種別の値を同時に選べるようにする",
      "申請種別を制御項目、申請理由を連動項目として値の対応を定義する"
    ],
    answers: [1, 3],
    explanation: "項目の連動関係で制御項目の値ごとに有効な申請理由を定義できます。制限付き選択リストにすると、APIなどからも定義外の値が保存されることを防げます。\n        ※ 外部IDはデータ連携の照合キーに使用し、選択リスト値の依存関係を作りません。\n        ※ 複数選択リストは複数値の選択を可能にしますが、定義外値の制御や依存値の設定を単独では満たしません。"
  },
  {
    id: 210,
    category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
    source: "新方式対策 高難度再改訂 ID210",
    question: "営業担当者は取引先を確認中に、その会社についての訪問報告を作成します。新規画面では起点の取引先を自動的に関連付け、取引先ページに必要な入力項目だけを表示します。ホームや別オブジェクトから独立して起動する導線は不要です。採用すべき機能はどれですか。",
    choices: [
      "関連先を利用者に毎回選ばせるグローバル作成アクション",
      "取引先を起点として関係を引き継ぐオブジェクト固有クイックアクション",
      "取引先の主要項目だけを表示するコンパクトレイアウト",
      "訪問報告の選択リスト値だけを切り替えるレコードタイプ"
    ],
    answers: [1],
    explanation: "オブジェクト固有の作成アクションは、起点となる取引先との関係を自動的に設定でき、取引先ページから素早く子レコードを作成する用途に適しています。\n        ※ グローバルアクションは関連レコードに依存せず広い場所から起動できますが、起点の取引先を自動的に関連付ける今回の要件には劣ります。\n        ※ コンパクトレイアウトは主要項目の表示を制御し、新規レコード作成処理を提供しません。\n        ※ レコードタイプは業務プロセスや選択リスト値、ページレイアウトを分けますが、取引先から関連レコードを作る起動手段ではありません。"
  },
  {
    id: 211,
    category: "セールス&マーケティングアプリケーション",
    source: "新方式対策 高難度再改訂 ID211",
    question: "リードで収集した導入希望日は、取引開始時に新規作成される取引先責任者へ引き継ぎます。変換後は取引先責任者側で編集でき、元リードへの数式参照や変換後フローには依存させません。変換を本番利用する前に管理者が行う設定はどれですか。",
    choices: [
      "導入希望日ごとのキャンペーンメンバー状況を作成する",
      "取引先責任者の検索結果へ導入希望日の列を追加する",
      "互換性のある対象項目を作りリード変換時の項目対応を設定する",
      "導入希望日を条件にリード所有者を決める割り当てルールを作成する"
    ],
    answers: [2],
    explanation: "リードのカスタム項目を取引開始後の標準またはカスタム項目へ引き継ぐには、リードの項目設定で変換時の項目対応を定義します。\n        ※ キャンペーンメンバー状況はキャンペーンへの反応を追跡する値で、リード変換の項目対応には使いません。\n        ※ 検索レイアウトは検索結果に表示する列を決めるため、変換時のデータ転記には影響しません。\n        ※ リード割り当てルールは作成時の所有者を決定し、取引開始時の項目値転記を定義しません。"
  },
  {
    id: 212,
    category: "セールス&マーケティングアプリケーション",
    source: "新方式対策 高難度再改訂 ID212",
    question: "公開フォームから作成されるリードは、国と従業員規模の組み合わせにより地域キューへ割り当てます。大企業向けの具体条件を一般的な国条件より優先し、どの条件にも一致しない場合だけ既定所有者を使います。管理者が中心に構成するものはどれですか。",
    choices: [
      "同じ条件を持つケース割り当てルールをリード作成時に呼び出す",
      "取引先が作成された後に適用されるテリトリー割り当てルールを使う",
      "各地域の担当者を商談チームのデフォルトメンバーとして登録する",
      "具体条件から順に並べた有効なリード割り当てルールを使用する"
    ],
    answers: [3],
    explanation: "リード割り当てルールは、順序付けた条件に基づいてリードをユーザーまたはキューへ割り当てます。Web-to-リードでは有効な割り当てルールと既定所有者も確認します。\n        ※ ケース割り当てルールはケースを対象とするため、リードには適用されません。\n        ※ テリトリー管理は主に取引先と商談へのテリトリー割り当てやアクセスに使用し、新規リードの標準振り分け機能ではありません。\n        ※ 商談チームは商談へ共同作業者を追加する機能で、リード所有者を決定しません。"
  },
  {
    id: 213,
    category: "セールス&マーケティングアプリケーション",
    source: "新方式対策 高難度再改訂 ID213",
    question: "営業部門は、資格確認済みのリードだけを変換済みとして記録します。既存顧客からの追加問い合わせでは既存取引先と取引先責任者へ関連付け、案件化しない場合は新しい商談を作りません。管理者が変換設定と利用者手順で確認すべき内容を2つ選びなさい。",
    choices: [
      "変換画面で商談を作成しない選択が利用できること",
      "既存商談の売上予測カテゴリが達成予測になっていること",
      "既存顧客のケースに変換済みを表すクローズ状況があること",
      "資格確認済みの値が取引開始済みのリード状況として定義されていること"
    ],
    answers: [0, 3],
    explanation: "リードプロセスでは、取引開始済みとして扱う状況を定義します。変換時には商談を作成するかどうかを選択できるため、業務要件に合わせて運用を確認します。\n        ※ 予測カテゴリは商談の売上予測上の分類で、リードを取引開始済みにする設定ではありません。\n        ※ ケースのクローズ状況はサポートプロセスに関係し、リード変換条件を定義しません。"
  },
  {
    id: 214,
    category: "セールス&マーケティングアプリケーション",
    source: "新方式対策 高難度再改訂 ID214",
    question: "ウェビナーでは招待済みを初期値とし、登録済みと参加済みを反応として集計します。展示会では訪問済みと商談化を反応として扱い、ウェビナーとは別の段階を使います。リード状況や商談フェーズを変更せず実現する設定はどれですか。",
    choices: [
      "各キャンペーンで既定値と反応フラグを持つキャンペーンメンバー状況を定義する",
      "キャンペーン種別ごとに商談フェーズを追加して反応段階として利用する",
      "キャンペーンメンバーへ種別別のレコードタイプと営業プロセスを割り当てて段階を制御する",
      "リード状況の値を全キャンペーンへ共通の反応段階として強制する"
    ],
    answers: [0],
    explanation: "キャンペーンメンバー状況はキャンペーンへの反応段階を表し、キャンペーンごとに利用する値と回答済み扱いを設定できます。\n        ※ 商談フェーズは販売案件の進捗を表すため、ウェビナー参加状況には使用しません。\n        ※ キャンペーンメンバーには通常のレコードタイプで反応段階を分けるのではなく、キャンペーンメンバー状況を使います。\n        ※ リード状況は営業上のリード進行を表し、キャンペーンごとの反応を管理するものではありません。"
  },
  {
    id: 215,
    category: "セールス&マーケティングアプリケーション",
    source: "新方式対策 高難度再改訂 ID215",
    question: "一つの商談へウェビナー、展示会、メール施策が影響しています。主キャンペーンソースは営業が選んだ展示会のままにしつつ、マーケティングは別モデルで三施策それぞれの貢献率と売上貢献をレポートします。使用すべき機能はどれですか。",
    choices: [
      "社内担当者向けの商談分割へ各マーケティング施策を利用者として登録する",
      "複数キャンペーンと商談の貢献をモデル別に持つキャンペーンインフルエンス",
      "主キャンペーンソース一件へ三施策の名称と割合を連結して保存する",
      "キャンペーン階層の親へ商談金額を均等配分する標準集計だけを利用する"
    ],
    answers: [1],
    explanation: "キャンペーンインフルエンスでは、一つの商談へ複数のキャンペーンを関連付け、影響モデルに基づいて貢献を分析できます。\n        ※ 商談分割は営業担当者間で売上や貢献を分配する機能で、マーケティングキャンペーンの影響を表しません。\n        ※ 主キャンペーンソースは商談に対する主要な一キャンペーンを示しますが、複数施策の影響分析には不足します。\n        ※ キャンペーン階層は関連キャンペーンの実績を集約するために役立ちますが、商談との複数の影響関係を記録する機能ではありません。"
  },
  {
    id: 216,
    category: "サービス&サポートアプリケーション",
    source: "新方式対策 高難度再改訂 ID216",
    question: "未対応の問い合わせは製品別の共有受け皿に置き、担当者個人へ割り当てるまでは誰の所有にも固定しません。受け皿のメンバーは一覧から引き取れますが、引受け後はその担当者が所有者となります。ケース上の共同役割は不要です。使用すべき機能はどれですか。",
    choices: [
      "レコード共有先をまとめる公開グループ",
      "所有者を変えず共同担当者と役割を各未対応ケースへ追加して引受け状況も管理するケースチーム",
      "対応待ちレコードを所有して担当者が引き取れるケースキュー",
      "上位利用者へ下位所有レコードを見せるロール階層"
    ],
    answers: [2],
    explanation: "キューはケースなどの対応待ちレコードを所有でき、キューメンバーが一覧からレコードを引き取る運用に適しています。\n        ※ 公開グループは共有ルールなどの宛先として利用者をまとめますが、ケースの所有者にはなりません。\n        ※ ケースチームは個別ケースで共同作業する利用者とアクセスを管理しますが、未対応ケースの共通所有者ではありません。\n        ※ ロール階層は上位ユーザーへのレコードアクセス継承に使われ、作業待ちレコードを保持しません。"
  },
  {
    id: 217,
    category: "サービス&サポートアプリケーション",
    source: "新方式対策 高難度再改訂 ID217",
    question: "新規ケースは、最上位契約かつ日本語なら専用キュー、それ以外の日本語なら国内キュー、残りは既定キューへ送ります。条件が重なる場合は具体的な条件を先に評価し、一件の所有者だけを決定します。設定すべきものはどれですか。",
    choices: [
      "三つの担当役割を登録した定義済みケースチーム",
      "全キューへ同時に参照権限を付与する所有者ベース共有ルール",
      "期限経過後に所有者を変更するケースエスカレーションルール",
      "優先順位を付けたルールエントリを持つケース割り当てルール"
    ],
    answers: [3],
    explanation: "ケース割り当てルールでは、順序を持つルールエントリに条件と割り当て先を設定します。有効なルールのうち最初に一致したエントリで所有者を決定します。\n        ※ 事前定義ケースチームは共同作業者を追加しますが、ケース所有者を条件別に決定しません。\n        ※ 共有ルールは既存レコードへのアクセスを追加しますが、ケース所有者をキューへ割り当てません。\n        ※ エスカレーションルールは一定時間未解決のケースを通知または再割り当てするための機能で、作成直後の初期振り分けとは異なります。"
  },
  {
    id: 218,
    category: "サービス&サポートアプリケーション",
    source: "新方式対策 高難度再改訂 ID218",
    question: "Webフォームからケースを受け付けた直後、製品カテゴリと希望言語に応じた受付メールを顧客へ一度送ります。ケースの所有者は別の割り当てルールで決め、SLA超過時の通知とも分離して管理します。受付メールに使用すべき機能はどれですか。",
    choices: [
      "条件とテンプレートを順序付きで評価するケース自動レスポンスルール",
      "自動化処理の差出人だけを決めるワークフロー送信ユーザー",
      "製品別キューへの所有権移動を行うケース割り当てルール",
      "営業時間経過後に管理者へ通知するケースエスカレーションルール"
    ],
    answers: [0],
    explanation: "ケース自動レスポンスルールは、ケースの条件に応じて送信者とメールテンプレートを選び、受付時の自動返信を行います。\n        ※ 自動化の送信ユーザー設定だけでは、ケース条件別の受付メール処理を定義できません。\n        ※ ケース割り当てルールはケース所有者を決定します。受付メールのテンプレート選択と送信は自動レスポンスルールの役割です。\n        ※ エスカレーションルールは対応時間を超えたケースの通知や再割り当てに使われ、受付直後の返信には使用しません。"
  },
  {
    id: 219,
    category: "サービス&サポートアプリケーション",
    source: "新方式対策 高難度再改訂 ID219",
    question: "重要度が高いケースは、担当窓口の営業時間で2時間進展がなければマネージャーへ通知し、専用キューへ所有者を変更します。夜間や会社休業日は2時間へ算入せず、受信直後の顧客メールは別機能で処理します。必要な設定を2つ選びなさい。",
    choices: [
      "ケースではなくリードを振り分ける割り当てルール",
      "経過時間から非稼働時間を除外するサポート営業時間",
      "時間条件と通知および再割り当てを持つケースエスカレーションルール",
      "ケース作成直後の顧客返信を送る自動レスポンスルール"
    ],
    answers: [1, 2],
    explanation: "エスカレーションルールで対象条件、経過時間、通知や再割り当てのアクションを設定します。営業時間を関連付けることで、休業時間を除いた経過時間で評価できます。\n        ※ リード割り当てルールはリード所有者の初期割り当てに使用し、ケースのSLA管理には適用されません。\n        ※ 自動レスポンスルールはケース受付時の返信メールを送る機能で、未更新時間を監視しません。"
  },
  {
    id: 220,
    category: "サービス&サポートアプリケーション",
    source: "新方式対策 高難度再改訂 ID220",
    question: "製品問い合わせと請求問い合わせでは、利用できるケース状況の集合、標準編集画面の項目と必須設定を変えます。同じサポートプロファイルの担当者が両方を処理し、共有範囲は問い合わせ種別で変更しません。構成すべきものを3つ選びなさい。",
    choices: [
      "問い合わせ種別ごとにレコードアクセスを増やすケース共有ルール",
      "利用者が二つの業務種別を選び分けるケースレコードタイプ",
      "各業務の入力項目と必須設定を定義するページレイアウト",
      "各業務で選択可能なケース状況を定義するサポートプロセス"
    ],
    answers: [1, 2, 3],
    explanation: "サポートプロセスで利用可能なケース状況を定義し、それをケースレコードタイプへ関連付けます。プロファイルとレコードタイプの組み合わせに対応するページレイアウトを割り当てて入力画面を分けます。\n        ※ 共有ルールはケースへの参照範囲を拡張する機能で、状況値やページレイアウトの切替には使いません。"
  },
  {
    id: 221,
    category: "生産性向上とコラボレーション",
    source: "新方式対策 高難度再改訂 ID221",
    question: "営業担当者は来週火曜日の午後2時から顧客との打合せを予定し、社内の技術担当と顧客側参加者を招待します。開始時刻と終了時刻を各参加者のカレンダーへ反映し、完了期限だけを持つ作業とは区別して活動履歴へ残します。作成すべき活動はどれですか。",
    choices: [
      "参加者をキャンペーンメンバーとして登録し実施日時をメンバー状況へ保存する",
      "開始日時と終了日時および参加者を持つ行動を作成する",
      "全参加者へ同じ期日のToDoを個別作成して一つの予定として扱う",
      "商談のChatterへ開始時刻を投稿してカレンダー招待の代わりにする"
    ],
    answers: [1],
    explanation: "行動は開始日時、終了日時、参加者を持つ予定を表します。時間枠が決まった顧客との会議には行動が適しています。\n        ※ キャンペーンメンバーはマーケティング施策への参加者と反応を管理し、個別会議の予定ではありません。\n        ※ ToDoは期限までに完了する作業を表しますが、開始時刻と終了時刻を持つ会議や参加者招待には行動を使用します。\n        ※ Chatter投稿は情報共有や議論に使われ、カレンダー上の予定として参加者を招待しません。"
  },
  {
    id: 222,
    category: "生産性向上とコラボレーション",
    source: "新方式対策 高難度再改訂 ID222",
    question: "営業担当者は、顧客企業の担当者へ電話するフォローアップ作業を一件作成します。その作業は特定の更新商談に関するもので、後から取引先責任者の活動履歴と商談の活動履歴の双方から同じToDoを確認します。設定する関連先を2つ選びなさい。",
    choices: [
      "電話相手の取引先責任者を活動の名前へ設定する",
      "対象となる更新商談を活動の関連先へ設定する",
      "商談所有者を活動の割り当て先へ変更して顧客との関連を表す",
      "顧客企業を親キャンペーンとして活動へ設定する"
    ],
    answers: [0, 1],
    explanation: "活動の名前には取引先責任者やリードなどの人物を、関連先には商談や取引先などの業務レコードを設定できます。これにより両方の活動履歴から追跡できます。\n        ※ 割り当て先はToDoを実行する利用者です。商談所有者と一致させる必要はなく、人物との関係を表す項目でもありません。\n        ※ 親キャンペーンはキャンペーン階層を作る項目で、ToDoと取引先の関連付けには使用しません。"
  },
  {
    id: 223,
    category: "生産性向上とコラボレーション",
    source: "新方式対策 高難度再改訂 ID223",
    question: "買収検討チームの会話スペースは、招待された社内利用者だけが内容を閲覧できます。さらに、招待されていない利用者にはグループ名自体を検索結果、一覧、候補に表示せず、参加申請の入口も与えません。選択すべきChatterグループ種別はどれですか。",
    choices: [
      "組織内の利用者が検索して自由に参加できる公開グループ",
      "管理者だけが投稿できる公開のブロードキャストグループ",
      "メンバー以外には存在も表示しないリストに記載しないグループ",
      "内容はメンバー限定だがグループ自体は検索できる非公開グループ"
    ],
    answers: [2],
    explanation: "リストに記載しないChatterグループは招待されたメンバーだけが参加でき、メンバー以外の一覧や検索結果にも表示されません。グループの存在自体を限定する要件に適します。\n        ※ 公開グループは組織内の利用者がグループとコンテンツを参照でき、極秘チームの要件に合いません。\n        ※ ブロードキャストのみでは投稿者を制限できますが、公開グループの可視性をメンバーだけに限定できません。\n        ※ 非公開グループは投稿をメンバーへ限定できますが、グループ自体は検索や一覧で見つけられるため、存在も非表示にする要件を満たしません。"
  },
  {
    id: 224,
    category: "生産性向上とコラボレーション",
    source: "新方式対策 高難度再改訂 ID224",
    question: "販売代理店の外部利用者と社内営業が同じChatterグループで案件資料を共有します。外部利用者が参加できる一方、社内限定の投稿やファイルを誤って閲覧させず、元の商談レコードの共有範囲も自動的には広げない運用が必要です。重視すべき内容を2つ選びなさい。",
    choices: [
      "外部メンバーへ社内利用者と同じオブジェクト権限と全レコード参照を付与する",
      "既存の社内グループをすべて公開へ変更して外部参加者を同じ場所へ招待する",
      "外部メンバーを含める用途に対応したChatterグループ種別を選択する",
      "投稿、ファイル、リンク先のアクセスを確認し外部共有可能な内容だけを掲載する"
    ],
    answers: [2, 3],
    explanation: "外部ユーザーを含むグループでは、グループ種別とメンバーを適切に管理し、投稿やファイルが外部共有可能かを確認する必要があります。Chatterの参加と業務レコードのアクセスは別に制御します。\n        ※ 外部メンバーへ一律に内部ユーザーと同じ権限を与えると、必要以上のレコードアクセスを許可する可能性があります。\n        ※ 既存の社内グループを公開にしても安全な外部コラボレーションにはならず、社内情報の露出を広げます。"
  },
  {
    id: 225,
    category: "生産性向上とコラボレーション",
    source: "新方式対策 高難度再改訂 ID225",
    question: "営業マネージャーは、自分が注視する商談だけを購読し、フェーズまたは金額が更新された場合に、利用者の手動投稿なしでレコード上の会話ストリームと自分の購読一覧から変更を把握します。監査用の変更履歴は別途保持済みで、すべての更新をフロー投稿へ変換する保守は避けます。最適な構成はどれですか。",
    choices: [
      "項目履歴管理を有効にし商談履歴関連リストの内容を購読一覧へ自動配信する",
      "商談共有ルールで購読者へ参照権限を付け共有処理から変更通知も生成する",
      "保存後フローで全商談更新を判定し変更の有無にかかわらずChatter投稿を作成する",
      "商談の対象項目でフィード追跡を有効にし利用者が必要な商談をフォローする"
    ],
    answers: [3],
    explanation: "正解はDです。フィード追跡では、管理者が選択した項目の変更がレコードフィードへ自動投稿されます。利用者が商談をフォローすれば、注視するレコードの変更をフォロー中フィードでも確認でき、項目履歴とは別の共同作業向け通知を標準機能で構成できます。\n        ※ A：項目履歴管理は変更前後の値、変更者、日時を監査用に記録します。履歴関連リストの記録をフォロワーのフィードへ自動配信する機能ではありません。\n        ※ B：共有ルールはレコードアクセスを追加します。参照できることと、そのレコードの項目変更が会話ストリームへ投稿されることは別の制御です。\n        ※ C：保存後フローからChatter投稿を作る設計も可能な場合がありますが、全更新で投稿すると不要な通知が増えます。選択項目の標準追跡と利用者ごとのフォローという要件には過剰です。"
  },
  {
    id: 226,
    category: "データ管理&分析",
    source: "新方式対策 高難度再改訂 ID226",
    question: "外部顧客基盤から50万件の取引先責任者を毎晩同期します。ファイルにはSalesforce IDがなく一意な外部顧客IDがあり、既存行は更新、新規行は作成します。自動処理では成功行と失敗行を分け、失敗ファイルだけを修正して再投入できる必要があります。使用すべきツールと操作はどれですか。",
    choices: [
      "外部顧客IDを照合項目にしたデータローダーのUpsertをバッチ処理で実行する",
      "一括レコード移行で外部顧客IDごとに取引先責任者の所有者を変更する",
      "レポートエクスポートへ更新値を追加してSalesforceへ自動的に書き戻す",
      "データインポートウィザードで50万件を分割し既存照合を使わず毎回新規レコードとして追加する"
    ],
    answers: [0],
    explanation: "データローダーは大規模データを処理でき、外部IDを照合キーとしたUpsertおよび成功、失敗結果ファイルの出力に対応します。\n        ※ 一括レコード移行は所有者を変更する機能で、外部データによる項目更新やUpsertを行いません。\n        ※ レポートエクスポートはデータを出力する機能で、Salesforceレコードを更新できません。\n        ※ データインポートウィザードは比較的小規模な対話型取込に向き、50万件の夜間処理と詳細な結果ファイル管理には適しません。"
  },
  {
    id: 227,
    category: "データ管理&分析",
    source: "新方式対策 高難度再改訂 ID227",
    question: "商品マスターを日次連携します。外部側はSalesforce IDを保持せず、変更されない商品コードだけを送信します。初回の商品は作成し、翌日以降の同一商品は更新し、別の商品に同じコードが保存されることも防ぎます。必要な準備を2つ選びなさい。",
    choices: [
      "商品コードを照合項目として指定したUpsertを実行する",
      "商品コードをレポート内だけで分類するバケット項目にする",
      "商品コード項目を外部IDとして定義し必要に応じて一意性も設定する",
      "製品の名前項目を自動採番へ変更し連携側の商品コードを破棄する"
    ],
    answers: [0, 2],
    explanation: "外部ID項目は外部システムのキーでSalesforceレコードを照合するために使用できます。Upsertは一致するレコードを更新し、一致しない場合は新規作成します。\n        ※ バケットはレポート上で値を分類する機能で、データ取込時の照合キーにはなりません。\n        ※ 自動採番はSalesforce側で識別子を生成するため、既存の外部商品コードによる照合には使えません。"
  },
  {
    id: 228,
    category: "データ管理&分析",
    source: "新方式対策 高難度再改訂 ID228",
    question: "監査部門は、Salesforce内の業務データ一式を毎週決まった日にファイルとして取得し、暗号化した組織外保管庫へ7年間保持します。個別レポートの購読ではなく、複数オブジェクトと添付対象を含む定期バックアップの入口を標準機能で用意します。最初に構成すべきものはどれですか。",
    choices: [
      "監査用レポートを一件ずつメール送信するレポートの定期購読",
      "週次スケジュールと対象データを指定するデータエクスポートサービス",
      "メタデータ変更だけを記録する設定変更履歴の定期ダウンロード",
      "選択した項目の変更イベントだけを残す項目履歴管理"
    ],
    answers: [1],
    explanation: "データエクスポートサービスでは、組織データと添付ファイルなどをエクスポートし、利用可能な間隔で定期実行できます。保存、暗号化、復元手順は別途運用設計が必要です。\n        ※ レポート購読は条件に基づく分析結果の通知に向き、全組織データのバックアップにはなりません。\n        ※ 設定変更履歴はメタデータ設定の変更を追跡するもので、業務データのバックアップではありません。\n        ※ 項目履歴管理は選択した項目の変更履歴を保持しますが、全レコードの復元用コピーを作成しません。"
  },
  {
    id: 229,
    category: "データ管理&分析",
    source: "新方式対策 高難度再改訂 ID229",
    question: "営業組織の再編で、ある担当者が所有する数百件の取引先を後任へまとめて移します。取引先だけでなく、関連する未完了商談やケースなど、標準移管画面で選べる関連レコードの扱いも確認して実行します。適切な機能はどれですか。",
    choices: [
      "所有者変更を重複候補として抽出する重複ジョブ",
      "対象レコードをファイルへ保存するだけのデータエクスポート",
      "所有者と関連レコードの移管オプションを持つ一括レコード移行",
      "組織全体の参照範囲を変更して所有者変更を不要にする共有設定"
    ],
    answers: [2],
    explanation: "一括レコード移行では、条件に該当するレコードの所有者を別ユーザーへ変更でき、対象オブジェクトに応じて関連レコードの扱いも指定できます。実行前に影響範囲を確認します。\n        ※ 重複ジョブは一致ルールに基づいて重複候補を検出し、所有権移管には使用しません。\n        ※ データエクスポートはレコードをファイルへ出力する機能で、Salesforce内の所有者を更新しません。\n        ※ 共有設定はレコードへのアクセス範囲を制御しますが、所有者を新担当者へ変更しません。"
  },
  {
    id: 230,
    category: "データ管理&分析",
    source: "新方式対策 高難度再改訂 ID230",
    question: "一時施策で作成されたリードだけを大量に削除します。条件指定を誤っても復旧判断できる証跡を残し、対象を少量で検証してから同じ抽出条件を本番件数へ適用します。適切な手順を2つ選びなさい。",
    choices: [
      "リードのオブジェクト定義を削除して関連する一時データだけを除去する",
      "削除前にIDと必要項目を含む対象レコードをエクスポートして保管する",
      "対象リードのページレイアウトを非表示にしてデータ削除の代わりにする",
      "条件を検証したうえで一括削除またはデータローダーの削除を実行する"
    ],
    answers: [1, 3],
    explanation: "大量削除の前には対象レコードと識別子をバックアップし、条件と件数を検証します。その後、標準の一括削除またはデータローダーを使用し、結果とごみ箱の扱いを確認します。\n        ※ 標準リードオブジェクト自体を削除することはできず、必要なレコードだけを削除する要件とも異なります。\n        ※ ページレイアウトから見えなくしてもレコードは残り、データ量や保管要件は解決しません。"
  },
  {
    id: 231,
    category: "データ管理&分析",
    source: "新方式対策 高難度再改訂 ID231",
    question: "取引先責任者の作成時に、氏名のあいまい一致と正規化したメールアドレスから既存候補を提示します。営業担当者には候補を表示して保存継続を許可し、どの値を比較するかと保存時の動作を別々に保守します。必要な構成を2つ選びなさい。",
    choices: [
      "候補表示と保存許可の動作を定義する重複ルール",
      "メール項目を外部IDにするだけで氏名のあいまい一致も有効にする",
      "入力規則から既存の取引先責任者全件を検索して重複候補を返す",
      "氏名とメールをどの方式で比較するか定義する一致ルール"
    ],
    answers: [0, 3],
    explanation: "一致ルールはどの項目をどの照合方法で比較するかを定義します。重複ルールは一致した場合に警告、許可、ブロックなどの動作を制御します。\n        ※ 外部IDは完全一致による連携キーとして有用ですが、氏名とメールの類似性を組み合わせた重複判定を単独では実現しません。\n        ※ 入力規則は現在保存するレコードの値を評価しますが、標準的に他レコードを検索して類似一致を行う機能ではありません。"
  },
  {
    id: 232,
    category: "データ管理&分析",
    source: "新方式対策 高難度再改訂 ID232",
    question: "一般営業が取引先を作成するときは同一の一致条件に該当すれば保存をブロックします。データ管理チームが移行修正を行うときは、同じ候補を警告表示しながら保存継続を許可します。一致ロジックを重複作成せず、利用者属性で動作を分ける設計はどれですか。",
    choices: [
      "全利用者へ一つのブロック動作だけを持つ重複ルールを適用する",
      "照合項目を一意に設定し一般営業は標準エラー、データ管理チームだけ例外保存できるようにする",
      "データ管理チームの操作中は一致ルールそのものを無効化する",
      "同じ一致ルールを使い利用者条件が異なるブロック用と警告用の重複ルールを作る"
    ],
    answers: [3],
    explanation: "一致ルールで共通の比較方法を定義し、対象ユーザー条件を相互に分けた重複ルールで、一般担当者にはブロック、データ管理チームには警告して許可を設定します。\n        ※ ブロックルールを全員へ適用すると、データ管理チームも重複候補を保存できず要件を満たしません。\n        ※ 一意属性は一致する値をデータベース側で拒否するため、ユーザーごとに警告とブロックを切り替えられません。\n        ※ 一致ルールは比較方法を定義し、特定チームだけ有効または無効にして保存動作を変える設定ではありません。"
  },
  {
    id: 233,
    category: "データ管理&分析",
    source: "新方式対策 高難度再改訂 ID233",
    question: "値引率が30パーセントを超える商談は入力規則で拒否します。承認済みデータを修正する少数の担当者だけは、異動や担当交代に追随できる形で例外とし、利用者名やプロファイル名を数式へ列挙せず、他の入力規則でも同じ例外を再利用します。最適な方法はどれですか。",
    choices: [
      "権限セットで付与するカスタム権限を入力規則の例外条件として参照する",
      "例外担当者のページレイアウトから値引率を外してAPI更新も許可する",
      "現在の例外担当者のユーザー名を入力規則へ直接列挙して管理する",
      "例外担当者へすべてのデータの編集を付与して入力規則も無効にする"
    ],
    answers: [0],
    explanation: "カスタム権限をプロファイルまたは権限セットで付与し、入力規則でその権限を持たない場合だけエラーにすると、例外対象を設定として管理できます。\n        ※ ページレイアウトの変更はAPIや別経路の保存へ適用されず、入力規則の実行可否も変更しません。\n        ※ ユーザー名の直接列挙は人員変更のたびに数式修正が必要で、保守性と監査性が低下します。\n        ※ すべてのデータの編集権限はレコードアクセスを広げますが、入力規則を一般的に迂回するための最小権限設計ではありません。"
  },
  {
    id: 234,
    category: "データ管理&分析",
    source: "新方式対策 高難度再改訂 ID234",
    question: "取引先を母集団にした一つのレポートで、ケースがある会社にはケース情報を表示し、ケースが一件もない会社も欠落させずに並べます。空のケースを作成したり、別レポートを手作業で結合したりせず、レポート作成者が同じ列集合を利用できる設計はどれですか。",
    choices: [
      "ケースを主オブジェクトにした標準ケースレポートへ取引先列を追加する",
      "取引先を主にしてケースの有無を含めるカスタムレポートタイプを作成する",
      "取引先ブロックとケースブロックを持つ結合レポートだけを利用する",
      "取引先とケースの共有設定を公開へ変更して欠落行を生成する"
    ],
    answers: [1],
    explanation: "カスタムレポートタイプでは、主オブジェクトの各レコードについて関連オブジェクトが存在する場合だけ含めるか、存在しない場合も含めるかを定義できます。\n        ※ ケースを主とするレポートでは、ケースが存在しない取引先は結果に現れません。\n        ※ 結合レポートは複数のレポートブロックを並べる用途ですが、取引先とケースの有無を表す基礎データ集合はカスタムレポートタイプで適切に定義できます。\n        ※ 共有設定を公開にしても、関連ケースがない取引先をレポートタイプへ含める構造は作れません。"
  },
  {
    id: 235,
    category: "自動化",
    source: "新方式対策 高難度再改訂 ID235",
    question: "商談の保存時に、入力された金額と確度から社内評価区分を算出し、同じ商談の項目へ保存します。関連レコード、メール、外部サービスは扱わず、不要な二度目の更新とデータベース操作を避けます。最も効率的なフロー構成はどれですか。",
    choices: [
      "利用者に評価区分を確認させてから保存する画面フロー",
      "全商談を後から再計算するスケジュールトリガーフロー",
      "高速項目更新として保存前に実行するレコードトリガーフロー",
      "保存後に同じ商談をもう一度更新するレコードトリガーフロー"
    ],
    answers: [2],
    explanation: "同じレコードの項目だけを更新する処理には、保存前の高速項目更新を使うレコードトリガーフローが適しています。追加の更新処理を発行せず、保存トランザクション内で値を設定できます。\n        ※ 画面フローは利用者との対話が必要な処理向けで、レコード保存時の自動計算には適しません。\n        ※ スケジュールトリガーフローは指定時刻に対象を処理するため、保存直後に値を確定する要件を満たしません。\n        ※ 保存後フローでも同じレコードを更新できますが、追加の更新処理や再実行への配慮が必要になり、この要件には過剰です。"
  },
  {
    id: 236,
    category: "自動化",
    source: "新方式対策 高難度再改訂 ID236",
    question: "商談が初めて成立した後、関連取引先の導入状況を更新し、商談所有者へフォローアップToDoを作成します。商談自身の項目変更だけでは完結せず、成立が保存された後のIDと関係レコードを使います。適切なフロー構成はどれですか。",
    choices: [
      "営業担当者が成立のたびに手動起動する画面フローだけを使う",
      "関連レコード作成も許される保存前レコードトリガーフローを使う",
      "利用者のログイン時に前回成立した商談を検索するログインフローを使う",
      "関連更新とToDo作成を行う保存後レコードトリガーフローを使う"
    ],
    answers: [3],
    explanation: "関連レコードの更新や新規レコードの作成には、保存後に実行するレコードトリガーフローを使用します。元の商談が保存され、レコードIDが確定した後に取引先とタスクを処理できます。\n        ※ 画面フローだけでは利用者が起動しない限り実行されず、成立時の確実な自動処理になりません。\n        ※ 保存前フローは同じレコードの高速項目更新に向き、関連取引先の更新やタスク作成はできません。\n        ※ ログインフローはユーザーのログイン時に実行するため、商談成立を契機にできません。"
  },
  {
    id: 237,
    category: "自動化",
    source: "新方式対策 高難度再改訂 ID237",
    question: "ケースの優先度が低または中から高へ変化した一度だけ、エスカレーションToDoを作成します。高のまま件名を編集した場合や、高で新規作成されたケースには作成せず、後から中へ戻して再び高になった場合は新しいToDoを許可します。開始条件の中心となる設定はどれですか。",
    choices: [
      "更新のみを契機とし条件を満たすよう変更された場合だけ実行する開始条件を使用する",
      "優先度が高である限り作成と更新のすべてで実行する",
      "新規作成時だけ優先度が高かを評価して以後の変更を無視する",
      "すべてのケース更新でToDoを作成してからToDo側の一致ルールと重複ルールで余分な作成を止める"
    ],
    answers: [0],
    explanation: "更新後に条件を満たすようになった場合だけ実行する設定なら、優先度が高へ遷移した更新で起動し、高のまま行われる後続編集では起動しません。\n        ※ 条件を満たす更新のたびに実行すると、高のまま別項目を変更した場合にもタスクが作成されます。\n        ※ 新規作成時だけでは、既存ケースの優先度が後から高へ変わる場面を処理できません。\n        ※ 重複タスクを許す設計は要件に反し、不要なデータと利用者の混乱を生みます。"
  },
  {
    id: 238,
    category: "自動化",
    source: "新方式対策 高難度再改訂 ID238",
    question: "契約終了日の30日前に更新確認ToDoを作成します。終了日を延期した場合は古い予定を使わず新しい日付から30日前へ再予約し、契約が対象外の状況になれば保留中の処理も実行しません。適切な自動化はどれですか。",
    choices: [
      "保存時に現在の終了日から30日前を期日とするToDoを即時作成する",
      "終了日を時間ソースにしたレコードトリガーフローのスケジュール済みパス",
      "利用者の次回ログイン時に対象契約だけを検索するログインフロー",
      "契約担当者が日付変更ごとに起動し直す画面フロー"
    ],
    answers: [1],
    explanation: "レコードトリガーフローのスケジュール済みパスでは、レコードの日付項目を時間源として、その前後に処理を予約できます。対象日が変わる運用にも対応できます。\n        ※ 保存前フローは将来時点まで処理を待機できず、保存時にタスクを作成してしまいます。\n        ※ ログインフローはログイン時の処理であり、契約ごとの終了日を基準に予約する機能ではありません。\n        ※ 画面フローは利用者の起動に依存するため、30日前の処理を確実に実行できません。"
  },
  {
    id: 239,
    category: "自動化",
    source: "新方式対策 高難度再改訂 ID239",
    question: "コールセンター担当者へ質問を一画面ずつ提示し、製品と障害内容の回答により後続入力を切り替えます。最後に入力内容を確認させてケースと関連明細を作成し、担当者がレコード編集画面の項目順を覚える必要をなくします。最適な自動化はどれですか。",
    choices: [
      "作成済みケースを承認者へ回す承認プロセス",
      "利用者画面を持たない保存前レコードトリガーフロー",
      "分岐と条件付き表示を持つ対話型の画面フロー",
      "夜間に未処理データをまとめて作成するスケジュールトリガーフロー"
    ],
    answers: [2],
    explanation: "画面フローは利用者から入力を受け取り、条件に応じて画面やコンポーネントを表示し分け、完了時にレコードを作成する対話型処理に適しています。\n        ※ 承認プロセスはレコードの承認経路を管理する機能で、段階的なデータ入力画面を提供しません。\n        ※ レコードトリガーフローには利用者へ質問を表示する画面がなく、入力支援の要件を満たしません。\n        ※ スケジュールトリガーフローは時刻に基づくバックグラウンド処理で、対話型入力には使いません。"
  },
  {
    id: 240,
    category: "自動化",
    source: "新方式対策 高難度再改訂 ID240",
    question: "取引先のリスク判定は、二つのレコードトリガーフローと一つの画面フローから同じ入力で呼び出します。判定規則を一か所で変更でき、呼出し元ごとに画面やトリガー条件は維持します。コードを追加せず再利用する構成はどれですか。",
    choices: [
      "三つの呼出し元へ同じ決定要素と数式を複製し変更時は全バージョンを同時に修正する",
      "判定結果を呼出し元の利用者が毎回同じ基準で手入力する",
      "一つの判定を三つの承認プロセスへ分割して順番に実行する",
      "共通ロジックを自動起動フローへ置き各フローからサブフローとして呼ぶ"
    ],
    answers: [3],
    explanation: "入出力変数を持つ自動起動フローへ共通ロジックを集約し、サブフローとして呼び出すと、一か所の変更をすべての利用元へ反映できます。\n        ※ ロジックの複製は修正漏れや判定差異を生みやすく、保守性を下げます。\n        ※ 手入力では一貫した判定を保証できず、自動化という要件も満たしません。\n        ※ 承認プロセスは承認経路の管理機能で、汎用的な判定ロジックの再利用先にはなりません。"
  },
  {
    id: 241,
    category: "自動化",
    source: "新方式対策 高難度再改訂 ID241",
    question: "ケース作成フローでは、関連契約の更新や外部通知が失敗する可能性があります。失敗後に通常の成功処理へ進めず、運用担当へ対象ケース、失敗要素、エラー内容を知らせ、後から調査可能な記録も残します。実装すべき内容を2つ選びなさい。",
    choices: [
      "開発時のデバッグ画面だけを本番障害の永続ログとして利用する",
      "対象IDと障害情報を記録して運用担当へ通知する処理を用意する",
      "失敗し得るデータ要素とアクションから障害パスを接続する",
      "障害を無視して成功経路へ戻しフロー全体を完了として扱う"
    ],
    answers: [1, 2],
    explanation: "障害パスを用意し、エラーメッセージや対象レコードなどの診断情報を記録したうえで通知すると、利用者への影響を把握しながら原因を追跡できます。\n        ※ デバッグ画面は設計時の確認手段であり、本番実行の障害履歴を継続的に保存しません。\n        ※ 障害を無視すると処理の欠落を検知できず、データ不整合を放置することになります。"
  },
  {
    id: 242,
    category: "自動化",
    source: "新方式対策 高難度再改訂 ID242",
    question: "フローは取得した多数の商談を一度だけループし、条件に合うレコードの更新値を準備します。データ操作要素の実行回数を商談件数に比例させず、同じ一覧の再取得も避けます。ガバナ制限を考慮した設計はどれですか。",
    choices: [
      "更新対象をコレクションへ蓄積しループ終了後に一つの更新要素へ渡す",
      "各周回で条件に合う商談一覧をもう一度取得して最新状態を確認する",
      "ループ内の各周回で現在の商談だけをデータベースへ個別更新する",
      "商談ごとに別のフローインタビューを手動で開始して処理を分散する"
    ],
    answers: [0],
    explanation: "ループでは対象レコードを更新用コレクションへ集め、ループ終了後に一度のレコード更新で処理すると、データ操作回数を抑えたバルク対応になります。\n        ※ ループ内で同じ一覧を再取得すると不要なクエリが増え、制限と性能の両面で不利です。\n        ※ 各周回で更新するとデータ操作が繰り返され、大量データでガバナ制限へ達しやすくなります。\n        ※ 手動起動へ分割しても処理効率と一貫性が下がり、バルク処理の解決にはなりません。"
  },
  {
    id: 243,
    category: "Agentforce",
    source: "新方式対策 高難度再改訂 ID243",
    question: "顧客は会話形式で配送状況を確認し、条件を満たす注文では続けて返品を依頼します。回答は承認済みナレッジと顧客自身の注文データで根拠付け、返品時は本人確認結果と期限を評価して実処理を呼び出します。単一の文章生成だけではなく会話と行動を担う構成はどれですか。",
    choices: [
      "ナレッジ本文を都度手作業で入力に追加するプロンプトテンプレートを匿名チャネルへ直接公開する",
      "検索、根拠付け、返品アクションを持つAgentforceサービスエージェント",
      "注文番号を毎回入力する画面フローだけを顧客チャネルへ公開する",
      "返品条件を指示文に記載し実行可能なアクションは一切追加しない"
    ],
    answers: [1],
    explanation: "Agentforceは自然言語の意図を解釈し、許可されたデータで回答をグラウンディングし、定義されたアクションを選択して業務処理まで進める対話型の用途に適しています。\n        ※ プロンプトテンプレートは文章生成に使えますが、それだけでは複数回の会話を管理し、検索と返品処理を選択して実行できません。\n        ※ 画面フローは定めた画面遷移で入力を集められますが、自然言語の依頼を解釈してナレッジ回答と処理を切り替える用途ではありません。\n        ※ トピック指示は判断方針を示しますが、返品を実行するアクションがなければ業務データを更新できません。"
  },
  {
    id: 244,
    category: "Agentforce",
    source: "新方式対策 高難度再改訂 ID244",
    question: "顧客の依頼は会話途中で配送照会から住所変更へ移ることがあります。システムは発話と会話状態を解釈し、適切なサブエージェントへ経路を選び、その中のアクションを順に使って最終応答を組み立てます。この全体の推論とオーケストレーションを担うものはどれですか。",
    choices: [
      "一つの外部処理だけを実行する個別エージェントアクション",
      "ナレッジを検索可能にするAgentforceデータライブラリ",
      "サブエージェントとアクションの選択を導くAtlas推論エンジン",
      "一つのサブエージェントを分類する説明文だけ"
    ],
    answers: [2],
    explanation: "Atlas推論エンジンは会話の意図とコンテキストを解釈し、適切なトピックとアクションを選択しながら処理と応答を進めます。\n        ※ 個別のアクションは一つの処理能力を提供しますが、どのトピックやアクションをいつ使うかは決定しません。\n        ※ データライブラリは回答を根拠付ける情報源であり、会話の意図判定や処理順序を制御する推論機構ではありません。\n        ※ 分類説明はトピック選択の手掛かりを与えますが、会話全体を通じた推論とアクションのオーケストレーションを行う主体ではありません。"
  },
  {
    id: 245,
    category: "Agentforce",
    source: "新方式対策 高難度再改訂 ID245",
    question: "注文管理サブエージェントを設計します。配送照会は扱いますが返金判断は扱わないという責任範囲を分類時と実行中の両方で明確にし、注文番号がない場合の質問、照会後の説明、禁止事項という判断手順も定義します。中心となる設定を2つ選びなさい。",
    choices: [
      "サブエージェント内で判断手順と行動規則を定義する指示",
      "分類説明とスコープで対象依頼および責任境界を定義する設定",
      "すべての注文データを検索対象にするデータライブラリだけ",
      "処理の境界を記述せずサブエージェントへ追加したアクション一覧だけ"
    ],
    answers: [0, 1],
    explanation: "分類説明とスコープはトピックを選ぶべき依頼と対象外の境界を示し、指示は選択後にどのような条件と順序でアクションを使うかを導きます。\n        ※ データライブラリは回答の根拠となる情報を提供しますが、トピックの対象範囲やアクション選択手順を定義しません。\n        ※ アクションはトピックで実行可能な処理を定義しますが、どの依頼を扱うかという境界や処理判断そのものは分類説明と指示で定めます。"
  },
  {
    id: 246,
    category: "Agentforce",
    source: "新方式対策 高難度再改訂 ID246",
    question: "返品可否を規則で判定し、条件を満たす場合だけケースを作成する既存の自動起動フローがあります。Agentforceから同じ検証済みロジックを再利用し、注文番号を入力として渡して結果を会話へ返します。フローを複製しない実装はどれですか。",
    choices: [
      "自動起動フローのAPI名をサブエージェントの指示へ文章として記載する",
      "返品判定とケース作成をプロンプトテンプレートの文章生成だけで再現する",
      "標準レコード要約アクションを名前だけ返品処理へ変更して追加する",
      "既存フローを参照処理とするカスタムエージェントアクションを作成する"
    ],
    answers: [3],
    explanation: "自動起動フローを基にカスタムエージェントアクションを作成し、対象トピックへ追加すると、推論エンジンが会話の中で入力を渡して業務処理を呼び出せます。\n        ※ フロー名を指示へ書くだけでは、推論エンジンから呼び出せるツールとしてフローが公開されません。\n        ※ プロンプトテンプレートは生成処理に使いますが、既存フローが行う資格判定とケース作成を同じ取引処理として代替しません。\n        ※ レコード要約アクションは情報を要約するためのもので、返品資格を判定してケースを作成する処理ではありません。"
  },
  {
    id: 247,
    category: "設定とセットアップ",
    source: "新方式対策 高難度再改訂 ID247",
    question: "内部監査から、過去6か月に共有設定、権限セット、ログインポリシーを変更した操作者、日時、変更内容の一覧を求められました。業務レコードの項目変更やログイン成功履歴ではなく、設定画面で行われた構成変更を最初に調べます。確認すべき場所はどれですか。",
    choices: [
      "組織設定の変更者と内容を時系列で記録する設定変更履歴",
      "業務レコードの変更前後の値を保存する項目履歴管理",
      "期限付き権限セット割り当ての現在状態だけを表示する関連リスト",
      "認証の成功と失敗および接続元を記録するログイン履歴"
    ],
    answers: [0],
    explanation: "設定変更履歴では、組織設定を誰がいつ変更したかを確認でき、履歴をダウンロードして監査資料として利用できます。\n        ※ 項目履歴管理は業務レコードの項目値変更を追跡する機能で、設定画面の変更は対象外です。\n        ※ 権限セット割り当ての有効期限は一時的な権限付与に使用するもので、組織全体の設定変更履歴ではありません。\n        ※ ログイン履歴はログイン日時、接続元、成功または失敗などを記録しますが、設定変更の内容は示しません。"
  },
  {
    id: 248,
    category: "設定とセットアップ",
    source: "新方式対策 高難度再改訂 ID248",
    question: "サポート担当者は平日の午前7時から午後7時だけ対話ログインを許可します。同じ社内IPから接続する夜間連携利用者は24時間稼働し、営業時間やケースSLAは変えません。二つの利用者群は現在同じプロファイルです。最も直接的な構成はどれですか。",
    choices: [
      "社内IPを組織の信頼済み範囲へ登録して時間帯も自動判定させる",
      "ログイン時間が異なるプロファイルへ利用者群を分けて割り当てる",
      "組織の営業時間を午前7時から午後7時にして認証へ適用する",
      "サポート担当者のセッションタイムアウトを12時間へ変更する"
    ],
    answers: [1],
    explanation: "ログイン時間はプロファイル単位で設定されます。異なるログイン可能時間が必要なユーザーを別プロファイルに分けることで、それぞれの要件を満たせます。\n        ※ ネットワークアクセスは信頼済みIPからの本人確認に関係しますが、時間帯によるログイン制限にはなりません。\n        ※ 営業時間はケース処理などの時間計算に使われ、ユーザーのログイン可否を制御しません。\n        ※ セッションタイムアウトは操作がないセッションを終了するまでの時間で、ログインできる時間帯を定義しません。"
  },
  {
    id: 249,
    category: "設定とセットアップ",
    source: "新方式対策 高難度再改訂 ID249",
    question: "機密契約を扱う管理者について、盗まれたパスワードだけではログインを完了できず、かつ会社指定ネットワーク以外からは追加認証を成功させてもログイン自体を拒否します。画面レイアウトや監査記録ではなく認証時に強制する対策を2つ選びなさい。",
    choices: [
      "管理者用ページレイアウトで機密項目を読み取り専用にする",
      "機密契約の項目履歴管理を有効にして変更者を記録する",
      "管理者のプロファイルへ許可するログインIP範囲を設定する",
      "管理者のユーザーインターフェースログインに多要素認証を要求する"
    ],
    answers: [2, 3],
    explanation: "多要素認証はパスワード以外の要素による本人確認を追加します。プロファイルのログインIP範囲は、許可した接続元以外からのログインを拒否できます。\n        ※ ページレイアウトは画面上の項目やアクションを調整する機能で、認証を強化しません。\n        ※ 項目履歴管理はログイン後のレコード変更を追跡しますが、本人確認や接続元の制御は行いません。"
  },
  {
    id: 250,
    category: "設定とセットアップ",
    source: "新方式対策 高難度再改訂 ID250",
    question: "営業利用者のアプリケーションランチャーには、契約管理アプリと人事アプリを表示しません。ただし、別の許可済みアプリやURLから到達した場合のオブジェクト権限、項目権限、レコード共有は一切変更しない要件です。管理者が調整すべきものはどれですか。",
    choices: [
      "営業プロファイルから対象オブジェクトの参照権限を削除する",
      "各Lightningページのコンポーネント表示条件でアプリ名を判定する",
      "アプリケーションメニューとプロファイルまたは権限セットのアプリ表示設定",
      "対象オブジェクトの組織の共有設定と共有ルールを非公開へ変更する"
    ],
    answers: [2],
    explanation: "アプリケーションメニューでは、アプリの表示や並び順を管理できます。アプリへの表示権限もプロファイルなどで調整でき、データアクセスとは分けて設計できます。\n        ※ オブジェクト権限を削除するとデータアクセスまで変わるため、今回の要件を超えます。\n        ※ コンポーネント表示条件はLightningページ内の表示を制御し、アプリケーションランチャーの一覧は管理しません。\n        ※ 共有設定と共有ルールはレコードレベルのアクセスを制御するため、アプリ一覧の整理には使いません。"
  },
  {
    id: 251,
    category: "設定とセットアップ",
    source: "新方式対策 高難度再改訂 ID251",
    question: "営業担当者には地域パイプラインレポートフォルダーの閲覧権限がありますが、レポートを実行すると別担当者の非公開商談が除外されます。レポート定義は全地域を対象とし、フォルダー所有者には全件が見えています。追加共有を行わない場合の正しい説明はどれですか。",
    choices: [
      "フォルダーを管理可能へ変更すれば基礎商談の非公開設定も上書きされる",
      "レポートフォルダーを管理可能として共有すれば参照する非公開商談も閲覧者へ暗黙に共有される",
      "保存者が参照できる行集合をすべてのレポート閲覧者が同じように継承する",
      "レポート定義へのアクセスと実行者が参照できる基礎レコードは別に評価される"
    ],
    answers: [3],
    explanation: "レポートフォルダーへのアクセスと、レポート結果に含まれるレコードへのアクセスは別です。利用者のオブジェクト権限、項目権限、共有モデルに従って結果が絞られます。\n        ※ フォルダー管理権限はレポートの保存や編集に関する権限で、商談の共有設定を上書きしません。\n        ※ フォルダー共有は分析資産を利用可能にするだけで、基になる業務レコードを共有しません。\n        ※ 通常のレポート結果はレポート所有者ではなく、実行する利用者のデータアクセスに従います。"
  },
  {
    id: 252,
    category: "設定とセットアップ",
    source: "新方式対策 高難度再改訂 ID252",
    question: "管理者は、どのレコードを開いているかに関係なく利用者が経費申請を作成できるグローバルアクションを用意しました。利用者には経費申請の作成権限があり、デスクトップとモバイルの共通アクションメニューにだけ新しい操作が現れません。最初に確認すべき設定はどれですか。",
    choices: [
      "グローバルアクションを配置するグローバルパブリッシャーレイアウト",
      "経費申請レコードの主要項目を決めるコンパクトレイアウト",
      "利用者を配置したロールと上位ロールの階層関係",
      "経費申請レコードへ利用者を共有する組織の共有設定"
    ],
    answers: [0],
    explanation: "作成したグローバルアクションをユーザーへ表示するには、グローバルパブリッシャーレイアウトへ配置する必要があります。権限があってもレイアウトにないアクションは表示されません。\n        ※ コンパクトレイアウトはレコードの強調表示パネルなどに表示する主要項目を定義し、グローバルアクションを配置しません。\n        ※ ロールは主にレコード共有へ影響し、グローバルメニューの構成を決めません。\n        ※ 組織の共有設定はレコードへの基準アクセスを定義しますが、アクションの表示場所は制御しません。"
  },
  {
    id: 253,
    category: "設定とセットアップ",
    source: "新方式対策 高難度再改訂 ID253",
    question: "各地域の運用リーダーへ、担当ロール以下の利用者だけの作成、編集、ロック解除、パスワードリセットを任せます。割り当て可能なプロファイルと権限セットは本社が承認したものに限定し、共有設定や権限定義そのものは変更させません。最も適切な構成はどれですか。",
    choices: [
      "地域利用者を公開グループへ集めリーダーをグループ所有者にする",
      "対象ロールと割り当て項目を制限した委任管理に必要なリセット権限を組み合わせる",
      "地域リーダーを組織の最上位ロールへ置き広範なユーザー管理権限を直接付与して地域は運用で守る",
      "利用者管理用の権限セットグループへすべての設定変更権限をまとめる"
    ],
    answers: [1],
    explanation: "委任管理では、管理対象とするユーザーやロール、および委任する管理作業を限定できます。システム管理者権限を与えずに一部のユーザー管理を任せられます。\n        ※ 公開グループは共有ルールなどの宛先としてユーザーをまとめる機能です。管理操作は委任できません。\n        ※ ロール階層はレコードアクセスの継承を表し、パスワードリセットなどの管理権限を付与しません。\n        ※ 権限セットグループは利用機能やデータ操作権限をまとめて付与しますが、管理対象ユーザーの範囲を限定してユーザー管理を委任する機能ではありません。"
  },
  {
    id: 254,
    category: "設定とセットアップ",
    source: "新方式対策 高難度再改訂 ID254",
    question: "買収した会社の利用者を作成すると、同じ文字列は自社組織に存在しないのにユーザー名重複エラーになります。メール通知先は既存の会社メールを維持し、別名や氏名ではなく認証に使う値だけを修正して保存します。対応はどれですか。",
    choices: [
      "利用者の別名だけへ部署コードを付けユーザー名はそのまま再保存する",
      "自社組織内で重複していなければエラーを無視して同じユーザー名を強制する",
      "メール形式を保ちながら全Salesforce組織で一意になる別ユーザー名を指定する",
      "他組織の利用者を無効化すれば同じユーザー名を直ちに再利用できると判断する"
    ],
    answers: [2],
    explanation: "Salesforceのユーザー名は、組織をまたいで一意である必要があります。実際のメールアドレスと一致させる必要はないため、識別用の文字列を加えたメール形式の値を使用できます。\n        ※ 別名は画面表示などに使われる短い識別子で、ユーザー名重複の解消にはなりません。\n        ※ ユーザー名の一意性は同じ組織内に限定されないため、保存できません。\n        ※ ユーザーを無効化してもユーザー名の一意性要件は残り、同じ値を別ユーザーへそのまま割り当てることはできません。"
  },
  {
    id: 255,
    category: "設定とセットアップ",
    source: "新方式対策 高難度再改訂 ID255",
    question: "一般利用者だけで発生する画面表示とレコードアクセスの問題を調査します。管理者権限のセッションでは再現せず、本人は管理者による一時的な代理ログインを許可済みです。パスワードを聞き取らず、所有権やプロファイルも変更せず再現する対応はどれですか。",
    choices: [
      "本人のパスワードを管理者がリセットし新しい値を共有してもらう",
      "本人へシステム管理者プロファイルを一時付与して同じ画面を開かせる",
      "本人の所有レコードを管理者へ移管して管理者セッションで確認する",
      "許可されたログインアクセスを利用して対象利用者としてログインする"
    ],
    answers: [3],
    explanation: "ユーザーとしてログインする機能を使うと、対象ユーザーの権限や画面設定に近い状態で問題を再現できます。必要なログインアクセスと管理権限を確認して利用します。\n        ※ パスワードを変更して共有する方法は本人の認証情報を不適切に扱い、監査性も低下させます。\n        ※ 管理者権限を付与すると問題が再現しなくなる可能性があり、過剰権限にもなります。\n        ※ 所有者移管は業務上の責任と共有範囲を変更するため、画面トラブルの再現方法として適切ではありません。"
  },
  {
    id: 256,
    category: "設定とセットアップ",
    source: "新方式対策 高難度再改訂 ID256",
    question: "法務担当者の構成は頻繁に変わります。共有ルールではメンバーを一件ずつ列挙せず法務部門を一つの宛先として再利用し、対象レコードの所有者にはせず参照アクセスだけを付与します。作成すべきものはどれですか。",
    choices: [
      "利用者やロールをまとめて共有先にできる公開グループ",
      "上司へ部下所有レコードを自動表示する新しいロール階層",
      "複数の機能権限を利用者へ配布する権限セットグループ",
      "未割り当てレコードを共同所有して引き取らせるキュー"
    ],
    answers: [0],
    explanation: "公開グループは、共有ルールなどで複数のユーザー、ロール、他のグループを一つの共有先として扱うために適しています。\n        ※ ロール階層は上下関係に基づくアクセス継承を表します。部門横断の任意メンバーを共有先としてまとめる用途には柔軟性が不足します。\n        ※ 権限セットグループは複数の権限セットをまとめて割り当てる機能で、レコード共有の宛先にはなりません。\n        ※ キューは対応待ちのレコードを所有できる共有の受け皿です。単に共有ルールの宛先として法務メンバーをまとめる要件では公開グループが適切です。"
  },
  {
    id: 257,
    category: "設定とセットアップ",
    source: "新方式対策 高難度再改訂 ID257",
    question: "同じ営業プロファイルを使う50人のうち、3か月の試験運用に参加する5人だけへ新しい見積審査オブジェクトの参照と作成を追加します。試験終了時には5人からまとめて外し、残り45人や既存プロファイルへ影響させません。適切な方法はどれですか。",
    choices: [
      "対象オブジェクトのタブを5人の既定アプリだけへ表示する",
      "必要なオブジェクト権限を持つ権限セットを5人へ割り当てる",
      "共通プロファイルへ権限を追加し45人はページレイアウトで隠す",
      "5人を上位ロールへ移してオブジェクト作成権限を継承させる"
    ],
    answers: [1],
    explanation: "権限セットは、共通プロファイルを変更せず一部ユーザーへ追加権限を付与する用途に適しています。対象者が増えた場合も同じ権限セットを割り当てられます。\n        ※ タブの表示設定はナビゲーション上の見え方であり、オブジェクト権限の代わりにはなりません。\n        ※ 共通プロファイルを変更すると対象外の45人にも作成権限が付与されます。\n        ※ ロールはレコードレベルのアクセスへ影響しますが、オブジェクトの作成権限を付与しません。"
  },
  {
    id: 258,
    category: "設定とセットアップ",
    source: "新方式対策 高難度再改訂 ID258",
    question: "利用者は取引先タブと自分が所有する取引先を開けますが、同じ項目構成を持つ同僚所有の一件だけ開けません。項目名は見えており、アプリとオブジェクトの参照権限も確認済みです。次に調査すべきアクセス層はどれですか。",
    choices: [
      "取引先各項目の項目レベルセキュリティだけ",
      "取引先の強調表示を決めるコンパクトレイアウト",
      "組織の共有設定とロール階層や共有ルールなど追加の共有手段",
      "アプリケーションランチャーの表示アプリと並び順を変更して対象取引先への参照経路を増やす"
    ],
    answers: [2],
    explanation: "オブジェクト自体へアクセスでき、一部レコードだけ見えない場合はレコードレベルアクセスの問題です。組織の共有設定を基準に、ロール階層、共有ルール、チーム、手動共有などを確認します。\n        ※ 項目レベルセキュリティは個々の項目の参照や編集を制御し、取引先レコード全体の可視性は決めません。\n        ※ コンパクトレイアウトは強調表示する項目を決める表示設定で、レコードアクセスを付与しません。\n        ※ アプリケーションメニューはアプリの表示と順序を管理し、個別レコードの共有には影響しません。"
  },
  {
    id: 259,
    category: "設定とセットアップ",
    source: "新方式対策 高難度再改訂 ID259",
    question: "退職者が所有する進行中商談と未完了ToDoは後任が引き継ぎます。一方、成立済み商談などに保存された作成者と更新者の監査情報は退職者の利用者レコードを参照したまま残します。退職者名を後任名へ変更せずライセンスを回収する手順はどれですか。",
    choices: [
      "退職利用者レコードを削除して同じ名前の後任利用者を作成する",
      "組織の共有設定を公開へ変更し所有者は退職者のまま無効化しない",
      "退職者の氏名とメールを後任者の情報へ上書きして同一利用者を再利用する",
      "必要な所有レコードを後任へ移管した後に退職利用者を無効化する"
    ],
    answers: [3],
    explanation: "Salesforceではユーザーを削除せず無効化することで過去の監査情報を保持します。業務継続が必要な所有レコードや活動は、適切な移管機能を使って後任者へ引き継ぎます。\n        ※ ユーザーレコードは通常削除できず、履歴を保持するためにも無効化を使用します。\n        ※ 共有範囲を広げても所有者や未完了作業の責任は移らず、不要なデータ公開も発生します。\n        ※ 既存ユーザーを後任者名へ変更すると、過去の操作主体と後任者の操作が混在し、監査性を損ないます。"
  },
  {
    id: 260,
    category: "設定とセットアップ",
    source: "新方式対策 高難度再改訂 ID260",
    question: "SAMLシングルサインオンでは、メールアドレスや姓が変わっても変化しない人事システムの社員キーをIdPから送信し、その値でSalesforce利用者を特定します。ユーザー名とは別に対応付けへ使用する標準ユーザー項目はどれですか。",
    choices: [
      "IdPの不変識別子を保存してSSO照合に使う統合ID",
      "Experience Cloud上で重複しない表示名となるコミュニティニックネーム",
      "一覧表示やレポートで利用者名を短縮する別名",
      "組織独自に追加した従業員番号項目だけを標準照合として自動使用する"
    ],
    answers: [0],
    explanation: "統合IDは、SAMLシングルサインオンで外部IDプロバイダーの利用者とSalesforceユーザーを対応付ける識別子として使用できます。構成によってはユーザー名など別の識別方式も選べます。\n        ※ コミュニティニックネームはExperience Cloudなどで表示される名前に使われ、SSOの照合には使用しません。\n        ※ 別名はリストなどで使われる短い表示名で、標準的なSAMLユーザー対応付け項目ではありません。\n        ※ 従業員番号を組織内の管理項目として使うことはできますが、そのままSAMLの標準照合項目になるわけではありません。"
  },
  {
    id: 261,
    category: "設定とセットアップ",
    source: "新方式対策 高難度再改訂 ID261",
    question: "東京とロンドンの利用者が同じ会議レコードを開きます。保存される瞬間は一つですが、各利用者には開始日時を現地時刻で表示し、日付、数値、小数点、通貨記号の書式も地域慣習に合わせます。個人単位で確認すべき属性を2つ選びなさい。",
    choices: [
      "日付や数値などの表示形式を決めるロケール",
      "レコード階層上の参照範囲を決めるロール",
      "日時を現地表示へ変換するタイムゾーン",
      "商談金額の換算基準だけを決めるデフォルト通貨"
    ],
    answers: [0, 2],
    explanation: "タイムゾーンは保存された日時をユーザーの現地時間へ変換して表示します。ロケールは日付、時刻、数値、氏名などの表示形式に影響します。\n        ※ ロールはレコードアクセスやレポート階層に関係し、地域別の表示書式を変更しません。\n        ※ デフォルト通貨は新規レコードの通貨や金額表示に関係しますが、日時や一般的な数値書式を地域化する設定ではありません。"
  },
  {
    id: 262,
    category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
    source: "新方式対策 高難度再改訂 ID262",
    question: "同じケースレコードでも、営業アプリでは簡潔な一列ページ、サービスコンソールではナレッジと関連リストを含む三列ページを使います。さらに特定のレコードタイプとプロファイルだけに専用版を優先します。項目必須設定ではなくページ構成を切り替える設定はどれですか。",
    choices: [
      "アプリケーションメニュー内のナビゲーション項目順序",
      "Lightningレコードページの有効化とアプリなどを使う割り当て",
      "ケースレコードへの参照権限を増やす共有ルール",
      "ケースページレイアウトを一つの組織デフォルトへ固定する設定"
    ],
    answers: [1],
    explanation: "Lightningレコードページは、有効化時に組織の既定、アプリ、レコードタイプ、プロファイルの組み合わせへ割り当てられます。用途ごとにページ構成を分ける要件に適しています。\n        ※ アプリケーションメニューはアプリの表示と順序を管理し、アプリ内のレコードページ構成を切り替えません。\n        ※ 共有ルールはケースへのレコードアクセスを追加し、画面構成には影響しません。\n        ※ ページレイアウトは項目や関連リスト、アクションを制御しますが、アプリごとにLightningページ全体を割り当てる機能ではありません。"
  },
  {
    id: 263,
    category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
    source: "新方式対策 高難度再改訂 ID263",
    question: "取引先の法人顧客と個人顧客で標準編集画面を分け、営業プロファイルとサポートプロファイルにも異なるレイアウトを使います。同じ利用者が別アプリを開いても、この標準ページレイアウトの選択規則は変えません。割り当て表の軸となる組み合わせはどれですか。",
    choices: [
      "ユーザーライセンスと取引先の共有ルール",
      "利用者ロールと個々の取引先所有者",
      "利用者のプロファイルと取引先のレコードタイプ",
      "現在のLightningアプリと利用者の公開グループ"
    ],
    answers: [2],
    explanation: "ページレイアウトの割り当ては、プロファイルとレコードタイプの組み合わせで決まります。同じプロファイルでもレコードタイプごとに異なるレイアウトを使用できます。\n        ※ ユーザーライセンスは利用可能な機能の上限、共有ルールはレコードアクセスに関係し、ページレイアウトを直接決めません。\n        ※ ロールと所有者は主にレコードアクセスや責任範囲に関係し、ページレイアウト割り当ての軸ではありません。\n        ※ LightningアプリはLightningページ割り当ての条件になり得ますが、標準のページレイアウト割り当ては公開グループとの組み合わせでは決まりません。"
  },
  {
    id: 264,
    category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
    source: "新方式対策 高難度再改訂 ID264",
    question: "ケースの販売代理店項目では、有効で種別がパートナーの取引先だけを検索候補にします。利用者がURLやAPI経由で条件外の取引先IDを渡した場合も保存を拒否し、必要権限を持つ利用者にも同じ整合性を強制します。最適な設定はどれですか。",
    choices: [
      "警告を表示して条件外の値も保存できる省略可能な参照検索条件",
      "候補画面の列と並び順だけを変更する取引先検索レイアウト",
      "取引先レコードの参照可能範囲を広げるケース共有設定",
      "条件外の値の保存を拒否する必須の参照検索条件"
    ],
    answers: [3],
    explanation: "必須の参照検索条件は検索候補を指定条件へ絞り、条件外のレコードが指定された場合は保存を拒否します。有効状態と取引先種別を条件に設定します。\n        ※ 省略可能な参照検索条件では利用者が条件外の候補も保存できるため、保存を拒否する要件を満たしません。\n        ※ 検索レイアウトは検索結果に表示する列を定義しますが、候補レコードの条件や保存可否を制御しません。\n        ※ 組織の共有設定は取引先レコードの参照範囲を決めますが、有効状態や種別に基づく参照項目の選択条件にはなりません。"
  },
  {
    id: 265,
    category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
    source: "新方式対策 高難度再改訂 ID265",
    question: "プロジェクトと作業明細は主従関係です。親プロジェクトには、状況が承認済みである明細だけの工数を合計し、明細の追加、更新、削除時に自動再計算します。明細全件をフローで走査せず実現する機能はどれですか。",
    choices: [
      "承認済みを条件にしたプロジェクトの積み上げ集計項目",
      "プロジェクト作成時に工数を生成する自動採番項目",
      "作業明細の状況と工数を絞る項目の連動関係",
      "一件の明細値だけを親へ表示するクロスオブジェクト数式項目"
    ],
    answers: [0],
    explanation: "積み上げ集計項目では、主従関係の詳細レコードを条件で絞り、件数、合計、最小値、最大値を親に表示できます。\n        ※ 自動採番項目は識別用の連番を生成する機能で、工数を集計しません。\n        ※ 項目の連動関係は選択リスト値を絞り込む機能で、数値集計には使用しません。\n        ※ クロスオブジェクト数式は一つの関連レコードの値を参照できますが、複数の作業明細を集計できません。"
  },
  {
    id: 266,
    category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
    source: "新方式対策 高難度再改訂 ID266",
    question: "設備カスタムオブジェクトのレコード名は利用者が入力せず、設備が作成されるたびに重複しない連番を組織側で生成します。番号は表示形式に接頭辞と桁数を持ち、作成者による書き換えを許しません。オブジェクト作成時に名前項目へ選択すべきデータ型はどれですか。",
    choices: [
      "子レコード件数から設備番号を求める積み上げ集計",
      "表示形式と開始番号を指定できる自動採番",
      "作成日時と利用者名を連結する数式",
      "外部システムから値を受け取る一意な外部ID"
    ],
    answers: [1],
    explanation: "カスタムオブジェクトの名前項目は、テキストまたは自動採番として定義できます。連続した管理番号を自動生成する要件には自動採番が適しています。\n        ※ 積み上げ集計は詳細レコードを親で集計する項目で、識別番号を生成しません。\n        ※ 名前項目のデータ型として数式は選択できず、数式項目は別のカスタム項目として作成します。\n        ※ 外部IDは外部システムとの照合に使うカスタム項目の属性で、自動的な連番生成を意味しません。"
  },
  {
    id: 267,
    category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
    source: "新方式対策 高難度再改訂 ID267",
    question: "利用されていないように見える契約のカスタム項目を削除します。ページレイアウトにはありませんが、本番障害や分析列の欠落を避けるため、参照関係を確認してからバックアップと削除を行います。削除前に重点確認すべきものを2つ選びなさい。",
    choices: [
      "対象オブジェクトのタブが各アプリで既定表示か非表示か",
      "レポート、フロー、メールテンプレートなどでの項目利用",
      "項目を最初に作成した利用者が現在所属するロール",
      "数式、入力規則、参照検索条件などメタデータからの参照"
    ],
    answers: [1, 3],
    explanation: "項目は数式、入力規則、フロー、レポートなど複数のメタデータから参照される可能性があります。依存関係と利用箇所を確認し、影響を解消してから削除します。\n        ※ タブ表示はオブジェクトへのナビゲーション設定であり、個別項目が参照されているかの判断材料にはなりません。\n        ※ 作成者のロールは項目の依存関係や削除可否を決定しません。"
  },
  {
    id: 268,
    category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
    source: "新方式対策 高難度再改訂 ID268",
    question: "管理者は既存組織のオブジェクトと関係を図で俯瞰しながら、新しい審査オブジェクトを追加して二つの参照関係を作成します。レポートやLightningページではなく、データモデルを視覚的に編集する標準ツールを使います。適切なツールはどれですか。",
    choices: [
      "レコード更新の処理順を設計するプロセスビルダー",
      "集計列と検索条件を組み立てるレポートビルダー",
      "オブジェクトと関係を図上で表示および編集するスキーマビルダー",
      "コンポーネントを配置して画面を作るLightningアプリケーションビルダー"
    ],
    answers: [2],
    explanation: "スキーマビルダーはデータモデルを図として表示し、カスタムオブジェクト、項目、関係を視覚的に作成できます。\n        ※ プロセスビルダーは旧来の自動化ツールで、オブジェクト関係を作成する機能ではありません。\n        ※ レポートビルダーは既存データを抽出、集計、可視化するためのツールで、項目や関係を作成しません。\n        ※ Lightningアプリケーションビルダーはホーム、アプリ、レコードページの画面構成を作るツールで、データモデルを設計しません。"
  },
  {
    id: 269,
    category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
    source: "新方式対策 高難度再改訂 ID269",
    question: "更新依頼は契約へ関連付けますが、契約が誤って削除されても依頼レコードは保持します。契約が更新統合された場合には既存依頼を別契約へ付け替え、依頼は独自の所有者と共有設定を維持します。適切な関係はどれですか。",
    choices: [
      "契約番号を動的に表示するだけの数式項目",
      "更新依頼を詳細側にして削除を連動させる主従関係",
      "契約と更新依頼の間へ二つの親を持つ連結オブジェクト",
      "削除時動作と再設定を構成できる契約への参照関係"
    ],
    answers: [3],
    explanation: "参照関係では子レコードを独立して保持でき、参照先の変更も可能です。親の削除時に参照をクリアする設定など、保持要件に沿った動作を選べます。\n        ※ 数式項目は値を表示するだけで、契約レコードとの参照関係や付け替えを提供しません。\n        ※ 主従関係では親の削除時に詳細レコードも削除されるため、更新依頼を保持する要件に反します。\n        ※ 連結オブジェクトは多対多関係を表す用途で、今回の一対多関係には不要です。"
  },
  {
    id: 270,
    category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
    source: "新方式対策 高難度再改訂 ID270",
    question: "モバイル利用者は取引先の検索結果からレコードを開く前と、開いた直後の上部領域で、レコード名、所有者、顧客ランクを確認します。詳細画面のセクション順や検索結果列そのものは変えず、主要情報の要約だけを調整します。編集すべきものはどれですか。",
    choices: [
      "モバイルの強調表示とプレビューへ主要項目を供給するコンパクトレイアウト",
      "グローバル検索結果の表形式列だけを定義する検索レイアウト",
      "標準編集画面の項目と関連リストを定義するページレイアウト",
      "モバイルアプリのタブ順と起動項目を変更し取引先の主要三項目も同じ設定から表示する"
    ],
    answers: [0],
    explanation: "コンパクトレイアウトは、Lightning Experienceやモバイルアプリの強調表示パネルなどに表示される主要項目を定義します。\n        ※ 検索レイアウトは検索結果やルックアップダイアログに表示する列を制御します。\n        ※ ページレイアウトは詳細ページの項目、セクション、関連リスト、アクションを管理しますが、強調表示パネルの主要項目はコンパクトレイアウトで決まります。\n        ※ モバイルナビゲーションメニューはアプリ内で表示するナビゲーション項目と順序を管理します。"
  },
  {
    id: 271,
    category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
    source: "新方式対策 高難度再改訂 ID271",
    question: "取引先ページからケースを作るアクションでは、発生源を電話、優先度を中として利用者に見せず自動設定します。一方、件名と説明だけは利用者が入力し、アクションの小さな入力画面に表示します。構成する内容を2つ選びなさい。",
    choices: [
      "発生源と優先度へ設定するアクションの定義済み項目値",
      "新規ケース候補の一覧列を変更する検索レイアウト",
      "作成後ケースの強調表示項目を変更するコンパクトレイアウト",
      "利用者が入力する件名と説明を配置するアクションレイアウト"
    ],
    answers: [0, 3],
    explanation: "アクションレイアウトで利用者に表示する入力項目を決め、定義済み項目値で発生源や優先度の初期値を設定できます。\n        ※ 検索レイアウトは検索結果や参照検索の列を管理するもので、アクションの初期値を設定しません。\n        ※ コンパクトレイアウトはレコードの主要項目表示に使用され、クイックアクションの入力画面を構成しません。"
  },
  {
    id: 272,
    category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
    source: "新方式対策 高難度再改訂 ID272",
    question: "商談レコードページの承認申請アクションは、値引率が20パーセントを超え、フェーズが交渉中で、現在の利用者が申請権限を持つ場合だけ表示します。ページレイアウトやレコードタイプを条件の組み合わせごとに増やしません。使用すべき機能はどれですか。",
    choices: [
      "商談上部の主要項目を切り替えるコンパクトレイアウト",
      "項目値と利用者条件を評価する動的アクションの表示条件",
      "プロファイル単位で固定されるページレイアウトのアクションセクションだけ",
      "項目コンポーネントだけを対象とする動的フォームの表示条件"
    ],
    answers: [1],
    explanation: "動的アクションではレコード項目などを使った表示条件を設定し、同じLightningレコードページ上で条件に合うアクションだけを表示できます。\n        ※ コンパクトレイアウトは強調表示パネルなどの主要項目を定義し、アクションの条件付き表示を制御しません。\n        ※ ページレイアウトのアクションセクションだけでは、同じレイアウト内で値引率とフェーズに応じた動的表示を行えません。\n        ※ 動的フォームの表示条件は項目や項目セクションを出し分けます。アクションの表示制御には動的アクションを使用します。"
  },
  {
    id: 273,
    category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
    source: "新方式対策 高難度再改訂 ID273",
    question: "靴スタイル項目を複数選択リストから単一選択リストへ変換します。既存レコードには二つ以上の値が保存され、レポートや自動化も項目を参照しています。変換時のデータ損失と後続処理への影響を管理するため、最初に行うべきことはどれですか。",
    choices: [
      "項目履歴管理だけを無効にすれば複数値をそのまま一値として保持できる",
      "対象レコードタイプを削除して既存の選択値を自動的に一つへ統合する",
      "既存値をバックアップし単一値への変換規則と依存先の修正方針を決める",
      "複数値が保存されたまま型を変更しSalesforceの任意選択へ任せる"
    ],
    answers: [2],
    explanation: "項目データ型の変更では既存データが切り捨てられたり変換できなかったりする可能性があります。バックアップを取得し、複数値をどの単一値へ変換するか決めてから実施します。\n        ※ 項目履歴管理の無効化は既存値の保護や変換方針にはなりません。\n        ※ レコードタイプは選択可能な値やレイアウトに関係しますが、データ型変更の前提として削除する必要はありません。\n        ※ 複数の既存値を保持したまま単一選択へ自動変換することはできません。採用する一値を事前に決める必要があります。"
  },
  {
    id: 274,
    category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
    source: "新方式対策 高難度再改訂 ID274",
    question: "外部商品システムは商品コードだけをキーとして製品レコードを毎晩Upsertします。Salesforce側で同じコードが二件存在すると照合が曖昧になるため、画面入力とAPIの両方でコード重複も拒否します。商品コード項目に必要な属性を2つ選びなさい。",
    choices: [
      "Salesforce自身が連番を生成する自動採番",
      "外部システムの照合キーとして使用できる外部ID",
      "同じコードを複数レコードへ保存させない一意性",
      "空値を禁止する必須設定だけで照合キーと重複防止を兼ねる"
    ],
    answers: [1, 2],
    explanation: "外部IDを指定するとデータローダーなどのUpsertで照合キーとして利用できます。一意属性を併用すると、同じ商品コードを複数レコードへ登録できません。\n        ※ 自動採番はSalesforce側で値を生成するため、外部システムの商品コードをそのまま照合する要件に適しません。\n        ※ 必須属性は空白を防ぎますが、重複値を防止したりUpsertの照合キーにしたりするものではありません。"
  },
  {
    id: 275,
    category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
    source: "新方式対策 高難度再改訂 ID275",
    question: "一般利用者のプロファイルへ新しい審査レコードタイプと対応ページレイアウトを割り当てました。新規作成画面には審査オブジェクト自体が現れず、直接URLでも権限エラーになります。共有設定を変える前に理解すべきアクセス原則はどれですか。",
    choices: [
      "タブを既定表示へ変更するとオブジェクト参照と作成も自動付与される",
      "レコードタイプを利用可能にするとオブジェクト権限も同時に付与される",
      "ページレイアウトを割り当てるとその項目とオブジェクトの作成権限を得る",
      "レコードタイプとレイアウトの割り当てだけではオブジェクト権限を得ない"
    ],
    answers: [3],
    explanation: "レコードタイプは業務プロセス、選択リスト値、ページレイアウトを分けます。対象オブジェクトを利用するには、プロファイルや権限セットによるオブジェクト権限が別途必要です。\n        ※ タブの表示はナビゲーション上の設定であり、オブジェクト権限やレコード共有を上書きしません。\n        ※ レコードタイプの利用可否とオブジェクト権限は別の制御です。\n        ※ ページレイアウトは画面構成を決めますが、作成や参照の権限を付与しません。"
  },
  {
    id: 276,
    category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
    source: "新方式対策 高難度再改訂 ID276",
    question: "技術者とプロジェクトを結ぶ参加連結オブジェクトには二つの主従関係があります。最初に作成したプロジェクト側関係を参照関係へ変換し、技術者側を主関係として残す変更を検討しています。特に評価すべき影響はどれですか。",
    choices: [
      "連結レコードがどの親から所有権と共有の基準を継承するか",
      "連結オブジェクトタブに表示される色だけが変わるか",
      "親オブジェクトのグローバル検索結果列が再配置されるか",
      "各利用者のデフォルトLightningアプリが自動的に切り替わるか"
    ],
    answers: [0],
    explanation: "連結オブジェクトでは最初の主従関係が主関係となり、連結レコードの所有権や共有への影響を持ちます。関係変更時は既存データとアクセスモデルを確認する必要があります。\n        ※ タブ色はユーザーインターフェース上の表示で、主従関係のデータ所有や共有動作には影響しません。\n        ※ 検索レイアウトは検索結果の列を制御する設定で、連結レコードの所有権を決めません。\n        ※ デフォルトアプリはログイン後に開くアプリに関係し、関係項目の主従動作とは無関係です。"
  },
  {
    id: 277,
    category: "セールス&マーケティングアプリケーション",
    source: "新方式対策 高難度再改訂 ID277",
    question: "一件の商談は一人の所有者が管理しますが、成立に貢献した二人の営業担当者へ60パーセントと40パーセントの売上クレジットを付けます。この割合は担当者別の売上レポートと共同売上予測へ反映し、商談金額自体を二件へ複製しません。使用すべき機能はどれですか。",
    choices: [
      "マネージャー判断で集計後の予測額だけを変える売上予測の調整",
      "一件の商談金額を利用者別のクレジットへ配分する商談分割",
      "商談商品の数量を二つの納品スケジュールへ分ける数量配分",
      "共同担当とレコードアクセスだけを付与する商談チーム"
    ],
    answers: [1],
    explanation: "商談分割では、一つの商談の売上または貢献に対するクレジットを複数メンバーへ割合で配分できます。商談の所有者や元の金額を分割せずに貢献を集計できます。\n        ※ 予測の調整はマネージャーが予測金額を補正する機能で、商談単位の担当者別貢献割合を保存しません。\n        ※ 商談商品の数量は顧客へ販売する製品数を表し、営業担当者間の売上貢献を配分する項目ではありません。\n        ※ 商談チームは共同作業者、役割、アクセスを管理しますが、それだけでは売上クレジットの割合を記録しません。"
  },
  {
    id: 278,
    category: "セールス&マーケティングアプリケーション",
    source: "新方式対策 高難度再改訂 ID278",
    question: "営業担当者が商談を開くと、現在のフェーズを視覚的に確認し、そのフェーズで必ず確認する主要項目と、次へ進むための成功ガイダンスを同じ上部領域で参照します。選択可能なフェーズ集合そのものは既存の営業プロセスを維持します。使用すべき機能はどれですか。",
    choices: [
      "共同担当者とアクセスレベルを管理する商談チーム",
      "レコードタイプで利用可能なフェーズ値を定義する営業プロセス",
      "フェーズごとの主要項目と成功ガイダンスを表示する商談のパス",
      "売上予測で商談を集計する区分を決める売上予測カテゴリ"
    ],
    answers: [2],
    explanation: "パスでは、選択リストの各段階に主要項目と成功ガイダンスを設定し、レコード上で業務の進め方を案内できます。\n        ※ 商談チームは共同作業者と役割を管理し、フェーズ別の案内を提供しません。\n        ※ 営業プロセスは利用できる商談フェーズを定義しますが、主要項目や成功ガイダンスを表示しません。\n        ※ 予測カテゴリは商談を予測上の区分へまとめる値で、画面上の業務ガイダンスではありません。"
  },
  {
    id: 279,
    category: "セールス&マーケティングアプリケーション",
    source: "新方式対策 高難度再改訂 ID279",
    question: "営業副社長は、担当者からマネージャーへ積み上がる商談金額を予測カテゴリ別に確認します。各マネージャーは元の商談を変更せず、自身の判断による調整額を上位へ提出します。報告ラインと予測画面の両方を構成するため必要なものを2つ選びなさい。",
    choices: [
      "予測カテゴリ別集計とマネージャー調整を提供する共同売上予測",
      "担当者から上位者への予測ロールアップを定義する売上予測階層",
      "取引先ごとの共同担当者を保持する取引先チーム",
      "親子施策のマーケティング結果を集計するキャンペーン階層"
    ],
    answers: [0, 1],
    explanation: "共同売上予測では商談の予測カテゴリに基づく金額を集計し、売上予測階層に沿ってマネージャーが部下の予測を確認、調整できます。\n        ※ 取引先チームは取引先に関わる利用者とアクセスを管理しますが、予測金額の集計や調整を提供しません。\n        ※ キャンペーン階層はマーケティング施策の親子関係と実績集計に使用し、営業予測の管理階層ではありません。"
  },
  {
    id: 280,
    category: "セールス&マーケティングアプリケーション",
    source: "新方式対策 高難度再改訂 ID280",
    question: "全国規模の取引先は、東日本と西日本、さらに製品Aと製品Bという複数の営業範囲へ同時に属します。利用者は一つのロールのまま、取引先所有者を変えずに割り当て範囲に応じたアクセスを得て、同じ区分で売上予測も行います。検討すべき機能はどれですか。",
    choices: [
      "新規見込客の所有者だけを決めるリード割り当てルール",
      "企業の親子関係を表示する取引先階層",
      "利用者一人を一つの位置へ置く標準ロール階層を製品と地域の組み合わせごとに複製して運用する",
      "取引先と利用者を複数の販売領域へ割り当てるエンタープライズテリトリー管理"
    ],
    answers: [3],
    explanation: "エンタープライズテリトリー管理では、条件に基づいて取引先を複数テリトリーへ割り当て、テリトリーのメンバーへ取引先や商談へのアクセスを提供できます。\n        ※ リード割り当てルールは新規リードの所有者を決定する機能で、既存取引先の担当地域を管理しません。\n        ※ 取引先階層は親会社と子会社などの関係を表示しますが、担当テリトリーやアクセスを割り当てません。\n        ※ ロール階層は組織上の管理関係によるアクセス継承であり、一つの取引先を複数の製品別、地域別担当へ柔軟に割り当てる用途には向きません。"
  },
  {
    id: 281,
    category: "セールス&マーケティングアプリケーション",
    source: "新方式対策 高難度再改訂 ID281",
    question: "大型商談ごとに社内の営業技術、法務、財務担当者を参加させます。参加者ごとに役割と商談への参照または参照更新アクセスを持たせますが、売上クレジットの割合は別機能で管理します。最も適切な機能はどれですか。",
    choices: [
      "商談単位の社内共同担当者とアクセスを管理する商談チーム",
      "成立金額の担当者別クレジットを管理する商談分割",
      "取引先レベルで既定の共同担当者を管理する取引先チーム",
      "共有ルールの宛先としてだけ利用する公開グループ"
    ],
    answers: [0],
    explanation: "商談チームでは、個別商談へ共同作業者を追加し、チーム内の役割と商談アクセスを設定できます。\n        ※ 商談分割は商談の売上や貢献を分配する機能です。共同作業者へアクセスを付与する主目的には商談チームを使用します。\n        ※ 取引先チームは取引先レコードを中心とした共同作業者を管理し、商談ごとのメンバー構成には商談チームが適しています。\n        ※ 公開グループは共有ルールなどの宛先として利用者をまとめますが、商談ごとの役割を記録しません。"
  },
  {
    id: 282,
    category: "セールス&マーケティングアプリケーション",
    source: "新方式対策 高難度再改訂 ID282",
    question: "同じ製品を国内商談では標準価格、海外代理店商談では契約済みの別価格で販売します。製品レコードは重複させず、営業担当者が商談に選択した価格表と商談通貨に合う販売価格を商品追加画面で選びます。必要な標準構成を2つ選びなさい。",
    choices: [
      "販売価格ごとに同じ製品を複製する商談レコードタイプ",
      "販売地域を値として持つキャンペーンメンバー状況",
      "販売チャネルや地域に対応する複数の価格表",
      "各価格表と製品と通貨を結ぶ有効な価格表エントリ"
    ],
    answers: [2, 3],
    explanation: "価格表は販売目的や市場ごとに異なる製品価格を管理します。価格表エントリは製品と価格表を結び付け、その価格表で使用する価格を保持します。\n        ※ 商談レコードタイプは営業プロセスやページレイアウトを分けますが、製品ごとの販売価格を保持しません。\n        ※ キャンペーンメンバー状況はマーケティング施策への反応を追跡し、製品価格には関係しません。"
  },
  {
    id: 283,
    category: "セールス&マーケティングアプリケーション",
    source: "新方式対策 高難度再改訂 ID283",
    question: "営業担当者は数百件の進行中商談から、過去に成立した類似商談、活動履歴、現在の商談属性に基づき成約可能性が高い案件を優先します。管理者が固定確度を手作業で再設計するのではなく、予測型の指標を利用します。検討すべき機能はどれですか。",
    choices: [
      "フェーズに一対一で対応する静的な売上予測カテゴリ",
      "過去データと現在のシグナルから算出されるEinstein商談スコア",
      "営業担当者へ手順を示すパスの成功ガイダンス",
      "フェーズの既定確度へ営業活動の件数を担当者が手動加算して優先順位として利用する運用"
    ],
    answers: [1],
    explanation: "Einstein商談スコアは、商談データや活動などのパターンを用いて成約可能性を示し、担当者の優先順位付けを支援します。利用可否は組織のライセンスや要件を確認します。\n        ※ 予測カテゴリはパイプライン、最善達成予測、達成予測などに分類する値で、AIによる案件スコアではありません。\n        ※ 成功ガイダンスは担当者へ手順を示しますが、商談の成約可能性を計算しません。\n        ※ 確度はフェーズなどに基づく手動または設定値であり、過去データから案件ごとの指標を算出する要件とは異なります。"
  },
  {
    id: 284,
    category: "セールス&マーケティングアプリケーション",
    source: "新方式対策 高難度再改訂 ID284",
    question: "大型商談には顧客企業の意思決定者、技術評価者、請求担当者が関与します。各人はSalesforce利用者ではなく取引先責任者であり、商談ごとの関与役割と主担当者を記録します。社内レコードアクセスを付与しない機能はどれですか。",
    choices: [
      "マーケティング施策への反応を記録するキャンペーンメンバー",
      "社内利用者へ商談アクセスを付与する商談チーム",
      "顧客側人物の関与を記録する商談取引先責任者の役割",
      "社内利用者へ取引先アクセスを付与する取引先チーム"
    ],
    answers: [2],
    explanation: "商談取引先責任者の役割では、商談に関与する取引先責任者、各人の役割、主担当者を記録できます。これは顧客側の関係者を表し、Salesforceユーザーへのアクセス付与とは別です。\n        ※ キャンペーンメンバーはマーケティング施策に参加するリードや取引先責任者を追跡し、個別商談での役割を表しません。\n        ※ 商談チームは商談へ協力する社内Salesforceユーザーとアクセスレベルを管理し、顧客側の関係者を表しません。\n        ※ 取引先チームは取引先を担当する社内ユーザーを管理しますが、商談ごとの顧客関係者と役割を記録する機能ではありません。"
  },
  {
    id: 285,
    category: "セールス&マーケティングアプリケーション",
    source: "新方式対策 高難度再改訂 ID285",
    question: "リード変換画面で、同じ会社名と住所を持つ既存取引先が候補として表示されました。営業担当者は既存取引先へ新しい取引先責任者を関連付け、具体的案件がある場合だけ商談を作成し、重複取引先は増やしません。行うべき操作はどれですか。",
    choices: [
      "必ず新しい取引先を作成し変換完了後に管理者が統合する",
      "リードを削除して活動と項目値を既存取引先へ手入力する",
      "リード所有者を既存取引先所有者へ変えて変換処理を省略する",
      "変換画面で既存取引先を選び商談を作成するかどうか指定する"
    ],
    answers: [3],
    explanation: "リード変換では既存取引先を選択でき、商談を新規作成するかどうかも指定できます。重複候補を確認して既存データを活用することで、不要な重複を避けられます。\n        ※ 新規取引先を必ず作成すると、既存候補があるにもかかわらず重複を増やします。\n        ※ リード削除では標準の変換履歴や項目対応を利用できず、活動の引き継ぎも手作業になります。\n        ※ 所有者変更だけではリードを取引先や取引先責任者へ変換できません。"
  },
  {
    id: 286,
    category: "セールス&マーケティングアプリケーション",
    source: "新方式対策 高難度再改訂 ID286",
    question: "年間マーケティング計画の下に四半期施策、その下に個別イベントを配置します。各イベントの反応数や影響商談金額を下位で記録し、上位計画では子孫キャンペーンを含む集計値を確認します。使用すべき機能はどれですか。",
    choices: [
      "親子キャンペーンを構成して結果を集計するキャンペーン階層",
      "営業利用者の報告関係を定義する売上予測階層",
      "キャンペーンメンバーへ社内役割を付与する設定",
      "顧客企業の親会社と子会社を表示する取引先階層"
    ],
    answers: [0],
    explanation: "キャンペーン階層では関連するキャンペーンを親子構造で整理し、子キャンペーンの主要な統計を上位キャンペーンで集計して確認できます。\n        ※ 売上予測階層は営業予測を管理者構造に沿って集計するためのものです。\n        ※ キャンペーンメンバーには状況を設定しますが、キャンペーンを階層化するためのロールは使用しません。\n        ※ 取引先階層は企業グループの親子関係を表し、マーケティング施策を集約しません。"
  },
  {
    id: 287,
    category: "サービス&サポートアプリケーション",
    source: "新方式対策 高難度再改訂 ID287",
    question: "顧客がsupport@example.comへ送ったメールをケースとして受け付けます。メールサーバーからSalesforce生成のサービスアドレスへ転送でき、添付ファイルも扱います。社内ネットワークへメール処理エージェントを常駐させない構成はどれですか。",
    choices: [
      "担当者のメール画面だけを連携するOutlookインテグレーション",
      "転送先サービスアドレスを利用するオンデマンドメール-to-ケース",
      "匿名Webフォームからケースを生成するWeb-to-ケース",
      "作成済みケースから送信するフローのメールアラート"
    ],
    answers: [1],
    explanation: "オンデマンドメール-to-ケースではSalesforceがサービスアドレスを生成し、確認済みのサポートアドレスから転送された受信メールをクラウド側でケース化します。ローカルのメール処理エージェントは不要です。\n        ※ Outlookインテグレーションは利用者のメール作業とSalesforceを連携しますが、共有サポートアドレスへの受信メールを無人でケース化する仕組みではありません。\n        ※ Web-to-ケースはWebフォームの送信内容からケースを作成し、通常の受信メールを処理する入口ではありません。\n        ※ メールアラートはSalesforceから通知を送信する自動化であり、外部から届いたメールをケースへ変換しません。"
  },
  {
    id: 288,
    category: "サービス&サポートアプリケーション",
    source: "新方式対策 高難度再改訂 ID288",
    question: "製品サイトに簡易問い合わせフォームを置き、氏名、メール、製品、説明からケースを作成します。送信者にSalesforceアカウントやサイトログインを要求せず、標準のHTML生成とケース受付機能を利用します。適切な機能はどれですか。",
    choices: [
      "専用メールアドレスへ転送された受信メールを処理するメール-to-ケース",
      "認証済み外部利用者へケース参照を付与するExperience Cloud共有セット",
      "匿名Webフォームの送信からケースを作成するWeb-to-ケース",
      "作成後ケースの会話と履歴を表示するケースフィード"
    ],
    answers: [2],
    explanation: "Web-to-ケースは外部Webフォームの入力からケースを作成でき、送信者にSalesforceユーザーとしてのログインを要求しません。\n        ※ メール-to-ケースは受信メールを入口にする機能で、Webフォームから直接ケースを作成する要件とは異なります。\n        ※ 共有セットは認証済みExperience Cloudユーザーへレコードアクセスを与える機能で、匿名フォームの受付機能ではありません。\n        ※ ケースフィードはケース上の活動やコミュニケーションを表示しますが、外部フォームを提供しません。"
  },
  {
    id: 289,
    category: "サービス&サポートアプリケーション",
    source: "新方式対策 高難度再改訂 ID289",
    question: "個別の重大ケースでは、所有者とは別に技術責任者、顧客連絡担当、法務担当が共同作業します。案件ごとに参加者、役割、ケースアクセスレベルを保持しますが、待機案件の共同所有や全ケースへの一括共有は行いません。最も適切な機能はどれですか。",
    choices: [
      "共有ルールの宛先だけをまとめる公開グループ",
      "新規ケースの単独所有者を決めるケース割り当てルール",
      "未引受けケースを所有してメンバーへ配信するケースキュー",
      "ケース単位の共同担当者と役割を保持するケースチーム"
    ],
    answers: [3],
    explanation: "ケースチームでは、個別ケースへ共同作業者を追加し、メンバーの役割とケースへのアクセスレベルを管理できます。\n        ※ 公開グループは共有ルールなどの宛先に使われますが、ケースごとのチーム役割を記録しません。\n        ※ 割り当てルールはケース所有者を一つのユーザーまたはキューへ設定する機能です。\n        ※ キューは未割り当てケースの所有者となる受け皿で、個別ケースの複数共同作業者と役割を管理しません。"
  },
  {
    id: 290,
    category: "サービス&サポートアプリケーション",
    source: "新方式対策 高難度再改訂 ID290",
    question: "サポート担当者は、ケースの製品と症状から承認済みの解決手順を検索し、公開対象や言語が管理された記事を顧客回答へ利用します。個人が保存した定型文ではなく、版管理と公開プロセスを持つ組織の知識基盤を使います。適切な機能はどれですか。",
    choices: [
      "記事の版と公開チャネルを管理できるSalesforce Knowledge",
      "ケース上の変更者と変更前後値を記録する項目履歴管理",
      "担当者が個人または共有フォルダーで管理するクイックテキストだけを正式な解決手順として利用する",
      "一件のケース参加者へだけ見えるケースコメント"
    ],
    answers: [0],
    explanation: "Salesforce Knowledgeでは、承認、公開、検索可能な記事として解決手順を管理し、ケースから関連記事を参照して一貫した回答に利用できます。\n        ※ 項目履歴管理は値の変更を監査し、解決策を蓄積または検索する機能ではありません。\n        ※ クイックテキストは定型句の入力を効率化しますが、版管理された解決手順の検索、公開、ライフサイクル管理には不足します。\n        ※ ケースコメントは個別ケースのやり取りを記録するもので、再利用可能な解決手順の体系的な管理には向きません。"
  },
  {
    id: 291,
    category: "サービス&サポートアプリケーション",
    source: "新方式対策 高難度再改訂 ID291",
    question: "担当者は電話対応中に複数ケースをタブで保持し、各ケースから取引先、取引先責任者、過去ケース、ナレッジへ移動します。作業を切り替えても親タブと関連タブの文脈を残し、画面下部には通話ツールも常設します。適切なアプリ構成はどれですか。",
    choices: [
      "各レコードを独立したブラウザー画面で開く標準ナビゲーションアプリ",
      "ワークスペースタブとユーティリティを使うLightningサービスコンソール",
      "キャンペーンとメンバー管理に特化したマーケティングアプリ",
      "デスクトップ業務を除外してSalesforceモバイルだけを利用する構成"
    ],
    answers: [1],
    explanation: "サービスコンソールはタブとサブタブによる複数レコード処理、関連情報の表示、ユーティリティなど、ケース担当者向けの効率的な作業環境を提供します。\n        ※ 標準ナビゲーションアプリでもケースは処理できますが、複数ケースと関連レコードを同じワークスペースで扱う要件にはコンソールが適しています。\n        ※ キャンペーン管理アプリはマーケティング施策を中心とするため、ケース処理用の構成ではありません。\n        ※ モバイルアプリは外出先で有効ですが、デスク上で複数ケースを並行処理する主なコンソール要件を満たしません。"
  },
  {
    id: 292,
    category: "サービス&サポートアプリケーション",
    source: "新方式対策 高難度再改訂 ID292",
    question: "新規ケースの件名と説明を過去の分類結果と比較し、カテゴリと優先度の候補を担当者へ提示します。最初は担当者が候補を確認して保存し、精度を検証してから自動適用を検討します。ルールをすべて手作業で列挙しない機能はどれですか。",
    choices: [
      "所有者を決める条件だけを持つケース割り当てルール",
      "記事の閲覧範囲を分類するナレッジデータカテゴリ",
      "過去ケースから項目値を予測するEinsteinケース分類",
      "営業案件の成約可能性を予測するEinstein商談スコア"
    ],
    answers: [2],
    explanation: "Einsteinケース分類は過去のケースデータから項目値を予測し、担当者の確認を伴う提案としてケース処理を支援できます。利用可能な項目、データ量、ライセンスを確認します。\n        ※ 割り当てルールは既にある項目値を条件に所有者を決めますが、ケース本文からカテゴリ候補を予測しません。\n        ※ ナレッジのデータカテゴリは記事の分類と可視性に使われ、ケース項目値を予測する機能ではありません。\n        ※ Einstein商談スコアは商談の成約可能性を支援するSales向け機能で、ケース項目を分類しません。"
  },
  {
    id: 293,
    category: "サービス&サポートアプリケーション",
    source: "新方式対策 高難度再改訂 ID293",
    question: "ケースは調査中の間、解決理由を空欄で保存できます。状況を解決済みへ変更する保存だけは、画面、API、データローダーのいずれからでも理由が空なら拒否し、担当者へ修正メッセージを返します。最も適切な設定はどれですか。",
    choices: [
      "サポートプロセスから解決済み状況を削除してクローズ操作自体をなくす",
      "ページレイアウトで解決理由を常時必須にして調査中にも入力させる",
      "解決理由の項目レベルセキュリティを参照のみにして変更を防ぐ",
      "状況が解決済みかつ理由が空かを評価する入力規則"
    ],
    answers: [3],
    explanation: "入力規則では、状況が解決済みで解決理由が空白という条件を保存時に拒否できます。画面、データ取込、APIなど複数の保存経路に同じ業務ルールを適用できます。\n        ※ 解決済みを選べなくするとケースを正常に完了できないため、業務要件に反します。\n        ※ ページレイアウトの必須設定は状況に関係なく入力を要求し、APIなどページレイアウトを通らない経路には適用されません。\n        ※ 参照のみにすると担当者が解決理由を入力できず、条件付き必須の要件を満たしません。"
  },
  {
    id: 294,
    category: "サービス&サポートアプリケーション",
    source: "新方式対策 高難度再改訂 ID294",
    question: "ケースが解決済みになった3日後、現在も解決済みである場合だけ所有者へ満足度確認ToDoを作成します。3日以内に再オープンされたケースの保留処理は取り消し、日付変更にも追随します。適切な自動化はどれですか。",
    choices: [
      "ケースを起点に解決時刻から3日後を設定するスケジュール済みパス",
      "ケースエスカレーションルールへ解決から3日後の処理を置き再オープン後も期限計算を継続する",
      "新規受付時に顧客メールを送るケース自動レスポンスルール",
      "日次レポート購読から担当者が手作業でToDoを作成する運用"
    ],
    answers: [0],
    explanation: "レコードトリガーフローのスケジュール済みパスは、ケースの変更を起点として将来時点の処理を予約できます。実行時にクローズ状態を再確認する条件も設計できます。\n        ※ エスカレーションルールは未解決ケースの時間管理に使用するため、クローズ後の満足度フォローには適しません。\n        ※ 自動レスポンスルールはケース作成時の顧客向け返信を扱い、3日後の内部ToDo作成には使いません。\n        ※ レポート購読は情報を通知できますが、ケースごとの関連ToDoを自動作成せず、手動対応も要件に合いません。"
  },
  {
    id: 295,
    category: "サービス&サポートアプリケーション",
    source: "新方式対策 高難度再改訂 ID295",
    question: "Webフォームのケースには有効な割り当てルールを適用しますが、将来追加される製品値などによりどのエントリにも一致しない場合があります。それでも所有者を空欄にせず、受付時の最後の受け皿を組織設定として保証します。確認すべきものはどれですか。",
    choices: [
      "フローやAPI失敗メールの送信元となる自動化処理ユーザー",
      "Web-to-ケースで一致しないケースを受け取る既定のケース所有者",
      "ケース作成後に共同担当を追加する定義済みケースチーム",
      "リード受付だけに使用される既定のリード所有者"
    ],
    answers: [1],
    explanation: "サポート設定の既定ケース所有者は、自動作成されたケースを他の仕組みで所有者へ割り当てられない場合の受け皿になります。\n        ※ 自動化処理ユーザーは一部の自動処理の実行や所有に関係しますが、未一致ケースの標準の既定所有者ではありません。\n        ※ 既定ケースチームは共同作業者を追加する設定で、ケース所有者そのものを決めません。\n        ※ 既定リード所有者はWeb-to-リードなどで作成されたリードに使用され、ケースには適用されません。"
  },
  {
    id: 296,
    category: "サービス&サポートアプリケーション",
    source: "新方式対策 高難度再改訂 ID296",
    question: "画面から手動作成したケースは有効な割り当てルールの条件に一致しますが、保存後も作成者が所有者です。同じデータをWeb-to-ケースで作ると正しいキューへ送られます。ルール自体やキュー構成を変更する前に確認すべきものはどれですか。",
    choices: [
      "ケースレポートを最後に実行した利用者の権限",
      "ケース作成者がロール階層の最下位にいるかどうか",
      "手動保存時に有効な割り当てルールを使用する指定",
      "ケース上部へ表示する項目を決めるコンパクトレイアウト"
    ],
    answers: [2],
    explanation: "画面から手動作成または編集する場合、アクティブなケース割り当てルールを適用するためのチェックボックスやページレイアウト上の設定を確認します。条件一致だけでは呼び出し経路によって自動適用されない場合があります。\n        ※ レポートの実行ユーザーは分析結果のデータ範囲に関係し、ケース保存時の割り当て処理には影響しません。\n        ※ 所有者のロール位置は上位ユーザーへの共有に関係しますが、割り当てルールを起動する条件ではありません。\n        ※ コンパクトレイアウトは主要項目の表示を制御し、割り当てルールの実行を決めません。"
  },
  {
    id: 297,
    category: "生産性向上とコラボレーション",
    source: "新方式対策 高難度再改訂 ID297",
    question: "現場担当者がモバイルアプリを開いた直後、訪問先リスト、未完了ToDo、取引先をこの順に移動できるようにします。各オブジェクト内の検索結果列、共有範囲、デスクトップのユーティリティは変更しません。最初に調整すべきものはどれですか。",
    choices: [
      "デスクトップアプリ下部に固定するユーティリティバー",
      "取引先検索結果の列を決める検索レイアウト",
      "各レコードを参照できる利用者を決める組織の共有設定",
      "モバイルで利用できる項目と順序を決めるモバイルナビゲーション"
    ],
    answers: [3],
    explanation: "モバイルナビゲーションでは、Salesforceモバイルアプリに表示する項目と順序を設定できます。現場で頻繁に使う機能を上位へ配置できます。\n        ※ ユーティリティバーは主にLightningアプリのデスクトップ画面で常時利用するツールを配置する領域です。\n        ※ 検索レイアウトは検索結果や参照検索の列に影響し、モバイルの主要ナビゲーション順序は変更しません。\n        ※ 共有設定はレコードアクセスを制御しますが、モバイルメニューの順序を決めません。"
  },
  {
    id: 298,
    category: "生産性向上とコラボレーション",
    source: "新方式対策 高難度再改訂 ID298",
    question: "同じ取引先Lightningページをデスクトップと電話で利用します。大きな分析グラフはデスクトップだけ、軽量な関連リストは電話だけに表示し、アプリやページを二重保守しません。利用者プロファイルではなく端末種別でコンポーネントを切り替える機能はどれですか。",
    choices: [
      "フォームファクターを条件にしたコンポーネント表示設定",
      "端末ごとに別のLightningアプリと別ページを必ず作る構成",
      "ダッシュボードデータの参照範囲を決める実行ユーザー",
      "標準編集画面の項目を決めるページレイアウト割り当て"
    ],
    answers: [0],
    explanation: "Lightningページではコンポーネントの表示条件としてデスクトップや電話などのフォームファクターを使用でき、端末に適した構成を提供できます。\n        ※ 別アプリを作成する方法では同じレコードページ内の出し分けにならず、構成の重複も生じます。\n        ※ ダッシュボード実行ユーザーは表示データの範囲に関係し、レコードページの端末別表示には影響しません。\n        ※ ページレイアウトは項目や関連リストを制御しますが、同じLightningページ上のコンポーネントを端末別に切り替える主機能ではありません。"
  },
  {
    id: 299,
    category: "生産性向上とコラボレーション",
    source: "新方式対策 高難度再改訂 ID299",
    question: "モバイル利用者は、取引先、ケース、ホームのどこを開いていても同じ経費申請を作成します。起点レコードのIDは引き継がず、必要な既定値と入力項目だけを共通の新規作成画面へ表示します。適切な操作はどれですか。",
    choices: [
      "経費申請のレコードタイプをモバイル利用者専用として割り当てる",
      "経費申請を作成するグローバルアクションをモバイルのアクションへ配置する",
      "取引先との関連を必須にしたオブジェクト固有アクションを各起点オブジェクトへ個別作成する",
      "検索結果の列だけを定義する検索レイアウトへ新規ボタンを追加する"
    ],
    answers: [1],
    explanation: "グローバルアクションは特定レコードに依存せず、モバイルを含むグローバルアクション領域から起動できます。\n        ※ レコードタイプは業務プロセスや入力画面を分けますが、起動場所を提供しません。\n        ※ 取引先固有アクションでは取引先ページが起点となり、どこからでも作成する要件を満たしません。\n        ※ 検索レイアウトは検索結果の列やボタンに関係しますが、常時アクセスできるモバイルアクションにはなりません。"
  },
  {
    id: 300,
    category: "生産性向上とコラボレーション",
    source: "新方式対策 高難度再改訂 ID300",
    question: "外部提供元のアプリを導入します。提供元は名前空間とバージョンを管理し、顧客組織へ検証済みアップグレードを継続配布します。顧客管理者がパッケージ構成要素を直接編集して派生版を保守する方式は採りません。適切なパッケージ種別はどれですか。",
    choices: [
      "導入先で構成要素を自由編集し提供元更新を受けない未管理パッケージ",
      "関連のない組織間でメタデータを一度移送する変更セット",
      "提供元がバージョンとアップグレードを管理する管理パッケージ",
      "画像やスクリプトを一つの参照先へ格納する静的リソース"
    ],
    answers: [2],
    explanation: "管理パッケージは名前空間やアップグレード機構を持ち、提供元が保護したコンポーネントを配布、更新する製品型のAppExchangeアプリに適しています。\n        ※ 未管理パッケージのコンポーネントはインストール先で編集できますが、提供元からの継続的なアップグレード配布には向きません。\n        ※ 変更セットは関連組織間でメタデータを移行する機能で、AppExchange製品の配布と更新を管理するパッケージ種別ではありません。\n        ※ 静的リソースは画像やスクリプトなどのファイルを保存する機能で、アプリ全体の配布形式ではありません。"
  },
  {
    id: 301,
    category: "生産性向上とコラボレーション",
    source: "新方式対策 高難度再改訂 ID301",
    question: "AppExchangeの住所検証アプリを本番導入します。候補には取引先と取引先責任者の広い参照権限を要求する管理パッケージが含まれ、外部サービスへデータを送る可能性もあります。業務部門の納期を守りながら自社の最小権限基準を確認する対応を2つ選びなさい。",
    choices: [
      "サンドボックスへ限定導入し代表データと各利用者権限で動作を検証する",
      "初回から全利用者へアクセスを付与し利用後に不要権限を探す",
      "発行元、セキュリティ情報、要求権限、外部連携内容を導入前に確認する",
      "本番へ直接導入して実データでしか確認できないと判断する"
    ],
    answers: [0, 2],
    explanation: "AppExchangeリスト、セキュリティレビュー、提供元サポート、要求権限を確認し、サンドボックスで機能、データアクセス、既存設定への影響を検証してから本番導入します。\n        ※ 全ユーザーへの一律アクセスは最小権限に反します。インストール後も必要な利用者へ限定してアクセスを付与します。\n        ※ 本番先行では問題発生時の影響が大きく、権限やデータ変更を安全に評価できません。"
  },
  {
    id: 302,
    category: "生産性向上とコラボレーション",
    source: "新方式対策 高難度再改訂 ID302",
    question: "未管理パッケージをサンドボックスへ導入後、管理者が含まれるフローと項目を自社仕様へ変更しました。提供元は後日新しい版を公開しますが、現在の構成要素には提供元管理のアップグレード関係がありません。理解すべき保守責任はどれですか。",
    choices: [
      "アンインストール時にも関連データが必ず無条件で残る",
      "提供元の新バージョンが自社変更を解析して自動統合する",
      "未管理パッケージの全構成要素は導入先でも編集できない",
      "導入後に変更した構成要素は導入組織が比較と保守を担当する"
    ],
    answers: [3],
    explanation: "未管理パッケージはテンプレートとしてコンポーネントを配布し、インストール後は導入組織で編集できます。その後の変更と保守は基本的に導入組織の責任です。\n        ※ アンインストール時のデータや依存関係には個別の影響があるため、必ず保持されるとは限らず事前確認が必要です。\n        ※ 未管理パッケージには管理パッケージのような提供元主導のアップグレード経路がありません。\n        ※ 編集可能であることが未管理パッケージの特徴の一つです。"
  },
  {
    id: 303,
    category: "生産性向上とコラボレーション",
    source: "新方式対策 高難度再改訂 ID303",
    question: "営業部門は住所正規化を短期間で導入したいと考えています。標準機能だけでは要件を満たさない可能性がありますが、独自Apexの開発と長期保守へ着手する前に、既存製品の権限、対応地域、費用、サポートを比較します。管理者が最初に行うべきことはどれですか。",
    choices: [
      "要件に近いAppExchangeソリューションを調査して適合性を評価する",
      "既存製品の権限や対応地域を調べず直ちにカスタムApexの設計と長期保守契約を開始する",
      "住所を複数選択リストへ変更して入力値を手作業で列挙する",
      "共有ルールで住所入力者を減らして正規化の必要をなくす"
    ],
    answers: [0],
    explanation: "一般的な業務要件では、まずAppExchangeに実績あるソリューションがないか確認し、機能、費用、セキュリティ、サポート、保守性を評価します。\n        ※ 既存製品で満たせるかを確認せず開発を始めると、期間と保守コストが増える可能性があります。\n        ※ 複数選択リストは住所の構造化や検証に適さず、標準住所項目の代替にはなりません。\n        ※ 共有ルールはレコードアクセスを追加する機能で、住所値の正当性を検証しません。"
  },
  {
    id: 304,
    category: "生産性向上とコラボレーション",
    source: "新方式対策 高難度再改訂 ID304",
    question: "既存Agentforceエージェントには契約相談を扱うサブエージェントがあります。AgentExchangeから、電子署名サービスへ契約を送信する一つの実行能力だけを追加し、既存の分類、指示、会話開始処理は維持します。探すべき資産種別はどれですか。",
    choices: [
      "既存の責任範囲と競合する新しいサブエージェント一式",
      "既存サブエージェントへ追加できるエージェントアクション",
      "文章生成だけを行い電子署名処理を呼べないプロンプトテンプレート",
      "既存エージェント全体を置き換えるエージェントテンプレート"
    ],
    answers: [1],
    explanation: "エージェントアクションは、フロー、Apex、API、プロンプトなどを通じてエージェントが実行できる個別の処理能力を追加します。既存構成へ一つの外部処理を加える要件に合います。\n        ※ 新しいサブエージェント一式は固有の責任範囲、指示、アクション群を追加する単位です。既存の契約相談サブエージェントへ一能力だけを足す要件には範囲が広く、分類競合も招きます。\n        ※ プロンプトテンプレートは再利用可能な生成指示ですが、電子署名サービスへ契約を送る外部処理そのものを表すとは限りません。\n        ※ エージェントテンプレートは複数のサブエージェント、アクション、変数などを含むエージェント全体の土台であり、一処理だけの追加には範囲が広すぎます。"
  },
  {
    id: 305,
    category: "生産性向上とコラボレーション",
    source: "新方式対策 高難度再改訂 ID305",
    question: "営業担当者は重要商談の進捗を継続して受け取り、更新投稿では法務担当一人へ明示的に回答を依頼します。レコードアクセスは既に付与済みで、所有権や全営業部門への公開は変更しません。利用すべきChatter機能を2つ選びなさい。",
    choices: [
      "投稿内の項目値を隠す項目レベルセキュリティだけ",
      "特定の同僚へ投稿を知らせ会話へ招くメンション",
      "公開グループを商談の新しい所有者として登録する設定",
      "利用者がその商談の更新を購読するレコードのフォロー"
    ],
    answers: [1, 3],
    explanation: "レコードをフォローするとフィードの更新を受け取れます。投稿でメンションすると、特定の利用者へ会話への参加を促せます。\n        ※ 項目レベルセキュリティは項目の参照と編集を制御する設定で、Chatter通知や会話への招待には使いません。\n        ※ 公開グループはレコード所有者にはならず、Chatterの更新通知を直接実現しません。"
  },
  {
    id: 306,
    category: "生産性向上とコラボレーション",
    source: "新方式対策 高難度再改訂 ID306",
    question: "複数の営業担当者が同じ顧客訪問へ参加します。開始時刻を変更した場合は一つの予定の変更として全参加者へ反映し、各人のカレンダーから確認できるようにします。同じ件名の作業を人数分複製しない場合、作成すべき活動はどれですか。",
    choices: [
      "各担当者へ個別作成して相互同期しない複数のToDo",
      "予定日時を持たない商談のChatter投稿",
      "複数の参加者を追加した一つの行動",
      "イベント参加をマーケティング反応として表すキャンペーンメンバー状況"
    ],
    answers: [2],
    explanation: "行動には日時と参加者を設定でき、一つの会議予定として招待と更新を管理できます。参加者のカレンダーにも予定を反映できます。\n        ※ 複数のToDoは個別作業として管理され、共通の開始時刻、終了時刻、会議招待を一つに同期しません。\n        ※ Chatter投稿は情報共有に使われますが、参加者のカレンダーへ会議予定を作成しません。\n        ※ キャンペーンメンバー状況はマーケティング施策への反応を追跡する値で、社内会議の予定管理ではありません。"
  },
  {
    id: 307,
    category: "データ管理&分析",
    source: "新方式対策 高難度再改訂 ID307",
    question: "一つの商談レポートで明細行を残しながら、営業担当者ごとの商談金額小計とレポート全体の総計を表示します。列方向の別分類や異なるレポートタイプの比較は不要で、一つの行グループだけを使います。適切なレポート形式はどれですか。",
    choices: [
      "行と列の二方向へグループ化するマトリックスレポート",
      "複数の独立したブロックを並べる結合レポート",
      "グループ小計を持たない明細中心の表形式レポート",
      "一方向のグループ小計と総計を持つサマリーレポート"
    ],
    answers: [3],
    explanation: "サマリーレポートは行を一つ以上の項目でグループ化し、小計と総計を表示できます。営業担当者別の一方向集計に適しています。\n        ※ マトリックスレポートは行と列の二方向でグループ化する場合に適します。今回は担当者という一方向だけなのでサマリーが簡潔です。\n        ※ 結合レポートは異なるレポートタイプや条件の複数ブロックを比較する用途で、一つの商談集合の担当者別集計には不要です。\n        ※ 表形式レポートは基本的に詳細行の一覧で、担当者ごとのグループ小計を表示する要件には不足します。"
  },
  {
    id: 308,
    category: "データ管理&分析",
    source: "新方式対策 高難度再改訂 ID308",
    question: "営業責任者は、取引先ごとに未完了商談の金額と未解決ケースの件数を並べ、二つの値から指標も計算します。商談とケースは異なるレポートタイプを使い、共通の取引先で対応付けます。一つのレポートで実現する形式はどれですか。",
    choices: [
      "取引先でブロック横断グループ化できる結合レポート",
      "同じレコードの過去値と現在値を比べる履歴トレンドレポート",
      "一種類の明細行だけを並べる表形式レポート",
      "一つのレポートタイプを一方向に集計するサマリーレポート"
    ],
    answers: [0],
    explanation: "結合レポートは複数のレポートブロックを持ち、共通項目でグループ化して異なるデータ集合を同じ画面で比較できます。\n        ※ 履歴トレンドは特定項目の時間経過による変化を追跡する機能で、商談とケースの現在値比較を目的としません。\n        ※ 表形式レポートは単一データ集合の詳細一覧で、異なるレポートタイプをブロックとして比較できません。\n        ※ サマリーレポートは一つのレポートタイプ内のグループ集計には適しますが、商談とケースの別ブロック比較には結合レポートが適しています。"
  },
  {
    id: 309,
    category: "データ管理&分析",
    source: "新方式対策 高難度再改訂 ID309",
    question: "商談金額を0円から500万円、500万円超から2000万円、2000万円超の三帯へ分類し、帯ごとの件数を同じレポートで集計します。この分類は分析時だけ必要で、オブジェクト項目や保存済みデータとしてAPIへ公開しません。使用すべき機能はどれですか。",
    choices: [
      "商談へ永続保存して全画面に公開するカスタム選択リスト",
      "レポート内で値を範囲分類するバケット項目",
      "各行の算術計算だけを行う行レベルの数式",
      "集計値の色だけを変える条件付き強調表示"
    ],
    answers: [1],
    explanation: "バケット項目はレポート内で値を範囲やグループへ分類でき、元オブジェクトへカスタム項目を追加せずに集計へ利用できます。\n        ※ カスタム選択リストでも分類を保存できますが、元データへ項目を追加しないという条件に反します。\n        ※ 行レベルの数式でも文字列分類を作れる場合がありますが、範囲を手早くグループ化する標準機能としてバケットが適しています。\n        ※ 条件付き強調表示は集計値を色などで目立たせますが、レコードを三つの分類へグループ化しません。"
  },
  {
    id: 310,
    category: "データ管理&分析",
    source: "新方式対策 高難度再改訂 ID310",
    question: "商談レポートの各明細行に、金額から原価を引いた粗利益を追加します。計算はこのレポートだけで使い、オブジェクトへ項目を追加せず、グループ小計を参照しません。各商談の二項目から値を求める機能はどれですか。",
    choices: [
      "連続値を名称付きの範囲へ分類するバケット項目",
      "オブジェクト定義へ追加するクロスオブジェクト数式項目",
      "レポートの各明細レコードで計算する行レベルの数式",
      "グループ集計値同士を計算するカスタム集計数式"
    ],
    answers: [2],
    explanation: "行レベルの数式はレポート内の各レコード行で計算を行います。レポート固有の粗利益を表示し、オブジェクトへ項目を追加しない要件に合います。\n        ※ バケット項目は値を分類しますが、二つの数値項目の差を計算しません。\n        ※ クロスオブジェクト数式はオブジェクトのカスタム項目として作成されるため、レポートだけで使う条件に反します。\n        ※ 集計数式はグループや総計に対する計算に使用し、個々の商談行の粗利益を表示する用途とは異なります。"
  },
  {
    id: 311,
    category: "データ管理&分析",
    source: "新方式対策 高難度再改訂 ID311",
    question: "取引先を母集団として、過去30日以内のToDoまたは行動が一件もない取引先だけを抽出します。活動が古い取引先と活動自体がない取引先を含め、活動明細の空行を作らず関連レコードの存在条件で絞ります。使用すべき条件はどれですか。",
    choices: [
      "取引先所有者へ過去30日の相対日付条件を設定する",
      "取引先名が空でないという標準項目フィルターを追加する",
      "活動件名を直近と過去という二つのバケットへ分ける",
      "過去30日の活動を持たない取引先を指定するクロス条件"
    ],
    answers: [3],
    explanation: "クロス条件では、関連レコードを持つまたは持たない主レコードを抽出できます。関連する活動の日付条件を追加して、直近30日間の活動がない取引先を求められます。\n        ※ 取引先所有者は日付項目ではなく、活動日の条件にもなりません。\n        ※ 取引先名のフィルターでは、関連活動の有無を判定できません。\n        ※ バケットは取得済みの値を分類する機能で、関連活動が存在しない取引先を抽出しません。"
  },
  {
    id: 312,
    category: "データ管理&分析",
    source: "新方式対策 高難度再改訂 ID312",
    question: "管理者と一般利用者は同じ契約レポートタイプと同じフォルダーを利用しています。一般利用者は契約レコード自体を参照できますが、契約終了日を列へ追加できず、管理者が保存したレポートでもその値だけ見えません。最初に確認すべき設定はどれですか。",
    choices: [
      "一般利用者に対する契約終了日の項目レベルセキュリティ",
      "レポート定義を格納するフォルダーの共有レベル",
      "各契約レコードの所有者とロール階層",
      "ダッシュボードを表示するときの実行ユーザー"
    ],
    answers: [0],
    explanation: "同じレポートタイプで特定項目だけがユーザーによって見えない場合、項目レベルセキュリティを確認します。レポートビルダーで利用可能な項目も項目権限の影響を受けます。\n        ※ フォルダー共有はレポート自体の参照や編集を制御しますが、ビルダー内の個別項目を表示可能にはしません。\n        ※ レコード所有者はレコードレベルの可視性に関係しますが、項目定義の表示可否とは別です。\n        ※ ダッシュボード実行ユーザーはダッシュボードに表示するデータ範囲へ影響しますが、レポートビルダーの項目一覧には関係しません。"
  },
  {
    id: 313,
    category: "データ管理&分析",
    source: "新方式対策 高難度再改訂 ID313",
    question: "全国の営業マネージャーへ一つのダッシュボードを共有します。各マネージャーが開くと、自身のレコード共有で許可された商談だけを集計し、地域ごとのコピーや固定実行ユーザーの変更は行いません。適切な機能はどれですか。",
    choices: [
      "公開フォルダーへ保存した固定実行ユーザーのダッシュボード",
      "閲覧中のログイン利用者として表示する動的ダッシュボード",
      "複数レポートタイプを並べるだけの結合レポートダッシュボード",
      "本社管理者を固定実行ユーザーにした全社ダッシュボード"
    ],
    answers: [1],
    explanation: "動的ダッシュボードはログイン中のユーザーとして実行でき、同じダッシュボード定義でも閲覧者の権限と共有範囲に応じたデータを表示します。\n        ※ 公開フォルダーはダッシュボードへのアクセスを広げますが、表示データを閲覧者ごとに切り替えません。\n        ※ 結合レポートは複数データ集合を比較する形式で、閲覧者ごとの実行コンテキストを提供しません。\n        ※ 固定実行ユーザーでは全閲覧者がそのユーザーのデータ範囲を基準に見るため、各自のアクセス範囲へ自動的に切り替わりません。"
  },
  {
    id: 314,
    category: "データ管理&分析",
    source: "新方式対策 高難度再改訂 ID314",
    question: "営業ダッシュボードには商談金額、活動件数、取引先数の各コンポーネントがあります。閲覧者が一度地域を選ぶと、対応項目を持つすべてのコンポーネントを同じ地域へ絞り、ソースレポートを個別編集しません。使用すべき機能はどれですか。",
    choices: [
      "集計値の閾値に応じて色を変える条件付き強調表示",
      "各ソースレポートへ地域別のクロス条件を追加しコンポーネントごとに利用者が選び直す",
      "複数コンポーネントへ同じ選択値を渡すダッシュボード検索条件",
      "閲覧者の共有範囲だけを切り替える動的ダッシュボード"
    ],
    answers: [2],
    explanation: "ダッシュボード検索条件は、共通項目を使って複数コンポーネントの表示を利用者が切り替える機能です。各ソースレポートの対応項目を設定します。\n        ※ 条件付き強調表示は値に応じて表示を目立たせますが、コンポーネントを絞り込みません。\n        ※ クロス条件は一つのレポートで関連レコードの有無を絞り込む機能で、ダッシュボード全体の対話的な地域選択ではありません。\n        ※ 動的ダッシュボードは閲覧者のデータアクセス範囲を反映しますが、地域を選択する共通フィルターそのものではありません。"
  },
  {
    id: 315,
    category: "データ管理&分析",
    source: "新方式対策 高難度再改訂 ID315",
    question: "営業責任者は、毎週月曜日の朝にパイプラインダッシュボードの最新スナップショットをメールで確認します。元データは通常どおり更新され、組織全体のバックアップやレポートタイプ変更は不要です。設定または案内すべき機能はどれですか。",
    choices: [
      "全業務データをファイル化するデータエクスポートサービス",
      "レポート作成可否を決めるカスタムレポートタイプのリリース状況",
      "閲覧時に地域を手動選択するダッシュボード検索条件",
      "指定曜日に更新結果を配信するダッシュボードの登録"
    ],
    answers: [3],
    explanation: "ダッシュボードの登録や更新スケジュールを利用すると、指定したタイミングで最新情報を通知できます。利用可能な方法、受信者、組織上限を確認します。\n        ※ データエクスポートはバックアップ用ファイルを作成する機能で、ダッシュボードの定期配信ではありません。\n        ※ レポートタイプのリリース状況は利用者がレポートタイプを選べるかに関係し、定期メールを送りません。\n        ※ ダッシュボード検索条件は画面上で表示対象を絞る機能で、配信周期を設定しません。"
  },
  {
    id: 316,
    category: "データ管理&分析",
    source: "新方式対策 高難度再改訂 ID316",
    question: "経営ダッシュボードは専用の経営分析利用者を実行者として保存されています。一般閲覧者は自分では参照できない地域の商談も含む全社集計を確認できますが、元レポートを開くと自身の共有範囲だけになります。この差を説明するものはどれですか。",
    choices: [
      "固定された実行ユーザーのデータアクセスでダッシュボードを計算するため",
      "ソースレポートをサマリー形式にすると共有設定を自動的に無視するため",
      "ダッシュボード検索条件がレコード参照権限を追加するため",
      "ダッシュボードフォルダーの閲覧権限が商談共有も付与するため"
    ],
    answers: [0],
    explanation: "固定実行ユーザーのダッシュボードは、そのユーザーが参照できるデータを基準に表示します。フォルダーを閲覧できる利用者が同じレコードアクセスを持つとは限りません。\n        ※ サマリー形式はレポートの集計方法であり、レコード共有を上書きしません。\n        ※ 検索条件は選択された値で表示を絞りますが、元となるデータアクセスは実行ユーザーに従います。\n        ※ フォルダー共有はダッシュボードを開く権限を与えますが、表示データ範囲を直接決めるのは実行コンテキストです。"
  },
  {
    id: 317,
    category: "データ管理&分析",
    source: "新方式対策 高難度再改訂 ID317",
    question: "営業責任者は各月末時点の地域別パイプライン合計を12か月後にも再現します。商談が翌月に成立または金額変更されても過去月の値を変えず、月次集計結果を分析用カスタムオブジェクトへ自動保存します。使用すべき機能はどれですか。",
    choices: [
      "限られた商談項目の現在値と過去値を比較する履歴トレンドを使い月末集計値も永続保存する",
      "集計レポート結果を定期的に保存先へ格納するレポートスナップショット",
      "商談ごとの個別変更イベントを記録する項目履歴管理",
      "現在のレポート結果をメール送信するレポートの定期購読"
    ],
    answers: [1],
    explanation: "レポートスナップショットは、表形式またはサマリーレポートの結果を指定時点に実行し、対応付けたカスタムオブジェクトへ定期的に保存します。これにより月末集計の推移を後から比較できます。\n        ※ 履歴トレンドは選択した項目の過去値比較に使えますが、指定した月次レポート結果をカスタムオブジェクトへ保存する要件にはレポートスナップショットを使います。\n        ※ 項目履歴管理は個別商談の項目変更を記録しますが、月末ごとの集計レポート結果をカスタムオブジェクトへ保存しません。\n        ※ レポート購読は結果を通知できますが、各月の集計値を分析用レコードとして蓄積しません。"
  },
  {
    id: 318,
    category: "データ管理&分析",
    source: "新方式対策 高難度再改訂 ID318",
    question: "商談の組織の共有設定は非公開です。同じレポート定義を管理者と営業担当者が実行すると、管理者には全件、担当者には所有または共有された商談だけが表示されます。検索条件やレポートフォルダー共有は同一です。原因はどれですか。",
    choices: [
      "レポートフォルダーが非公開のため行単位の結果も所有者別になる",
      "表形式レポートでは他利用者所有のレコードを表示できない",
      "通常のレポート結果が実行利用者のレコード共有モデルに従う",
      "商談の検索レイアウトがレポート行の可視性も決定する"
    ],
    answers: [2],
    explanation: "レポートで取得できるレコードは、実行ユーザーのオブジェクト権限とレコードレベルアクセスに従います。非公開共有モデルでは、所有、階層、共有ルールなどでアクセスできる商談に限定されます。\n        ※ フォルダー設定はレポートを開けるかを制御します。既に開けているレポート内の商談件数が限定される理由とは異なります。\n        ※ 表形式かサマリー形式かは表示と集計方法の違いで、レコードアクセス範囲を変えません。\n        ※ 検索レイアウトは検索結果の表示列を制御し、レポートに含まれるレコードを決めません。"
  },
  {
    id: 319,
    category: "データ管理&分析",
    source: "新方式対策 高難度再改訂 ID319",
    question: "ケースレポートは、いつ実行しても実行日から遡った90日間の作成ケースを表示します。月が変わっても開始日と終了日を編集せず、時刻ではなく日付範囲を動的に評価します。使用すべきものはどれですか。",
    choices: [
      "ケースを作成月ごとの名称へ分類するバケット項目",
      "ダッシュボードのレコードアクセスを決める実行ユーザー",
      "作成時点で入力した固定の開始日と終了日",
      "実行日を基準に期間を移動させる相対日付検索条件"
    ],
    answers: [3],
    explanation: "相対日付検索条件は今日や現在の期間を基準に範囲を評価するため、レポート実行日が変わっても直近90日間を自動的に抽出できます。\n        ※ バケット項目は取得した値を分類する機能で、実行日に応じて日付範囲を移動しません。\n        ※ 実行ユーザーはデータアクセス範囲に影響しますが、日付条件を動的に変更しません。\n        ※ 固定日付では時間の経過に合わせて条件を手動更新する必要があります。"
  },
  {
    id: 320,
    category: "データ管理&分析",
    source: "新方式対策 高難度再改訂 ID320",
    question: "データローダーで取引先を更新したところ、8万行のうち入力規則に違反した350行だけが失敗しました。成功済み行を再投入せず、失敗したID、元値、エラー理由を基に修正ファイルを作成して再実行します。利用すべき出力はどれですか。",
    choices: [
      "失敗行とエラーメッセージを含むエラー結果ファイル",
      "更新対象を表示する通常レポートの詳細行",
      "成功した行だけを含む成功結果ファイルの再投入",
      "設定メタデータの変更だけを記録する設定変更履歴"
    ],
    answers: [0],
    explanation: "データローダーのエラー結果ファイルには、失敗した入力行とエラーメッセージが含まれます。原因を修正し、その行だけを再処理できます。\n        ※ レポートは保存済みレコードを表示しますが、取込に失敗して保存されなかった入力行のエラー内容は示しません。\n        ※ 成功結果ファイルの再投入は既に更新済みの行を再処理することになり、失敗行の原因解消にもなりません。\n        ※ 設定変更履歴は組織設定の変更を記録し、データローダーの行単位エラーを保存しません。"
  },
  {
    id: 321,
    category: "データ管理&分析",
    source: "新方式対策 高難度再改訂 ID321",
    question: "マーケティング担当者が4万件の新規リードを一度だけCSVから取り込みます。デスクトップツールの導入や定期処理は不要で、ブラウザー上で項目対応を確認し、標準重複処理を選択してインポートします。適切なツールはどれですか。",
    choices: [
      "既存レコードの所有者をまとめて変更する一括レコード移行へCSVの新規リードも同時投入する",
      "ブラウザーで対象オブジェクトと重複処理を案内するデータインポートウィザード",
      "既存データを外部保管用ファイルへ出力するデータエクスポートサービス",
      "データを参照および集計するだけのレポートビルダー"
    ],
    answers: [1],
    explanation: "データインポートウィザードはブラウザーから比較的小規模な標準オブジェクトデータを取り込み、項目対応や重複処理を対話的に指定する用途に適しています。\n        ※ 一括レコード移行は既存レコードの所有者を変更する機能で、新規リードをCSVから作成しません。\n        ※ データエクスポートサービスはSalesforceからデータを出力するための機能です。\n        ※ レポートビルダーはデータの表示と分析に使用し、CSVデータを登録しません。"
  },
  {
    id: 322,
    category: "データ管理&分析",
    source: "新方式対策 高難度再改訂 ID322",
    question: "完了から5年を超えたケースを本番の主要データ集合から減らしますが、法令上7年間は監査担当者が検索でき、誤削除や開示請求時には定めた手順で復元できる必要があります。ツール選定や削除実行より前に決めるべきことはどれですか。",
    choices: [
      "アーカイブ後にも変えないケース番号の表示形式",
      "本番ページ上部に残すケースのコンパクトレイアウト",
      "保持期間、保存先、検索方法、復元試験を含むアーカイブと復元の運用方針",
      "ケースタブを一般利用者のアプリから非表示にする方法"
    ],
    answers: [2],
    explanation: "アーカイブでは、削除前に対象条件、保存先、保持期間、セキュリティ、検索可能性、復元手順を定義する必要があります。単なる削除や非表示とは異なります。\n        ※ ケース番号の書式は識別表示に関係しますが、保存期間や復元性を確保しません。\n        ※ コンパクトレイアウトは主要項目の表示を制御し、データのアーカイブには影響しません。\n        ※ タブを非表示にしてもレコードは本番に残り、データ量削減や長期保管方針を満たしません。"
  },
  {
    id: 323,
    category: "データ管理&分析",
    source: "新方式対策 高難度再改訂 ID323",
    question: "注文と注文明細は主従関係です。大量注文を削除するジョブの試験前に、親注文を削除した際の注文明細、ごみ箱、復元範囲への影響を評価します。関係の基本動作として正しいものはどれですか。",
    choices: [
      "親削除時に明細は自動的に別の注文へ再設定される",
      "明細は独立した所有者を持つため親削除後も必ず残る",
      "親削除は明細所有者だけを変更し明細データを保持する",
      "親を削除すると関連明細も連動して削除される"
    ],
    answers: [3],
    explanation: "主従関係では詳細レコードが親に強く従属するため、親レコードの削除時に関連する詳細レコードも連動して削除されます。事前の件数確認とバックアップが重要です。\n        ※ 別の親への自動付け替えは行われません。必要なら削除前に明示的なデータ更新が必要です。\n        ※ 独立して残せる可能性があるのは参照関係などであり、主従関係の削除動作とは異なります。\n        ※ 削除時に所有者だけを変更する動作ではありません。詳細レコードは親の所有権にも従います。"
  },
  {
    id: 324,
    category: "自動化",
    source: "新方式対策 高難度再改訂 ID324",
    question: "商談フェーズが前回値から変わった場合だけ分岐し、交渉中から成立への変更と、提案中から成立への変更で処理を変えます。現在値だけでなく同じ更新トランザクション直前の値を使い、履歴レコードを別途検索しません。フローで比較する情報はどれですか。",
    choices: [
      "現在のレコードと変更前のレコードを表すグローバル変数",
      "保存後の現在レコードだけを使い以前の値はフェーズ名から推測する",
      "商談作成者のユーザーレコードと現在フェーズ",
      "フロー実行日時と商談の完了予定日だけ"
    ],
    answers: [0],
    explanation: "更新を起点とするレコードトリガーフローでは、現在値と変更前の値を比較できます。両方を使うことで、特定ステージから別のステージへの遷移を正確に判定できます。\n        ※ 現在値だけでは、その値へ今回変更されたのか、以前から同じ値だったのかを区別できません。\n        ※ 作成者情報はステージの変更前後を示さず、遷移判定には利用できません。\n        ※ 実行日時から項目の以前の値を復元することはできません。"
  },
  {
    id: 325,
    category: "自動化",
    source: "新方式対策 高難度再改訂 ID325",
    question: "同じ商談の保存後段階で、フローAが割引判定レコードを作成し、フローBがその結果を取得して通知します。二つを一つへ統合せず、同じ実行段階内でAをBより先に動かし、フロー名や作成日時には依存させません。管理方法はどれですか。",
    choices: [
      "作成日が古いフローから実行されるという暗黙順序へ任せる",
      "フロートリガーエクスプローラーでトリガー順序を設定する",
      "フロー画面に表示される要素の縦位置を変更する",
      "フロー表示ラベルの先頭へ番号を付け辞書順に並べる"
    ],
    answers: [1],
    explanation: "フロートリガーエクスプローラーでは、同じオブジェクトと実行タイミングのレコードトリガーフローを確認し、トリガー順序を使って実行順を制御できます。\n        ※ 作成日は実行順序を保証する設定ではなく、意図した依存関係を表現できません。\n        ※ 画面表示順は画面フローの見え方に関するもので、保存後フローの実行順とは無関係です。\n        ※ 表示ラベルの並びはフローの実行順序を決定しません。"
  },
  {
    id: 326,
    category: "自動化",
    source: "新方式対策 高難度再改訂 ID326",
    question: "未有効化のレコードトリガーフローを実在するサンドボックスレコードでデバッグし、各要素の入力と出力を確認します。作成や更新要素も通過させますが、試験終了後にデータ変更を残さず、同じレコードで繰り返し試します。使用すべき設定はどれですか。",
    choices: [
      "フローを承認プロセスへ変換して申請履歴だけ確認する",
      "直ちに有効化して通常保存からしか試験できない状態にする",
      "デバッグのロールバックモードを有効にして実行する",
      "失敗を見えなくするためすべての障害パスを削除する"
    ],
    answers: [2],
    explanation: "デバッグ時のロールバックモードを使うと、フローの実行経路や値を確認しつつ、テスト中に行われたデータ変更を確定せずに戻せます。\n        ※ 承認プロセスへの変換はデバッグ手段ではなく、元の自動化の動作確認にもなりません。\n        ※ 本番レコードだけで試すと不要な更新や通知が確定するおそれがあり、検証方法として不適切です。\n        ※ 障害パスを削除すると障害時の設計を確認できず、デバッグの安全性も高まりません。"
  },
  {
    id: 327,
    category: "自動化",
    source: "新方式対策 高難度再改訂 ID327",
    question: "有効なフローの新バージョンで割引条件を修正して保存し、デバッグでは新ロジックを確認しました。しかし通常の新規商談では以前の条件が動きます。バージョンを削除せず切替状況を調べる場合、最初に確認すべきものはどれですか。",
    choices: [
      "新旧バージョンの表示ラベルが異なるかどうか",
      "フロー所有者の氏名が前回保存時から変わったかどうか",
      "旧バージョンの作成日時と表示ラベルを変更し通常実行が新しい方を自動選択するかどうか",
      "修正したフローバージョンが現在の有効バージョンになっているか"
    ],
    answers: [3],
    explanation: "フローは保存しただけでは新バージョンへ切り替わりません。新規実行で修正版を使うには、そのバージョンを有効化して有効バージョンにする必要があります。\n        ※ 表示ラベルの違いは有効バージョンの選択を決めません。\n        ※ フロー所有者の姓は、どのバージョンが実行されるかに影響しません。\n        ※ 旧版の作成日時を削除する操作はなく、新版を有効化することが必要です。"
  },
  {
    id: 328,
    category: "自動化",
    source: "新方式対策 高難度再改訂 ID328",
    question: "毎晩午前2時に、最終活動日から90日を超えた取引先をその時点の全データから検索し、休眠候補へ更新します。個々の取引先が変更された瞬間や利用者ログインには依存せず、管理者が開始日時と頻度を管理します。適切なフロー種別はどれですか。",
    choices: [
      "指定時刻に対象レコード集合を処理するスケジュールトリガーフロー",
      "利用者の入力と次へボタンを必要とする画面フロー",
      "利用者ごとのログイン開始時に実行するログインフロー",
      "取引先が保存された場合だけ動く保存前レコードトリガーフロー"
    ],
    answers: [0],
    explanation: "スケジュールトリガーフローは指定した頻度と時刻に開始し、条件に合うレコードを定期的に処理できます。更新イベントがなくても経過日数に基づく夜間処理を実行できます。\n        ※ 画面フローは利用者による起動と操作を前提とし、無人の夜間処理には適しません。\n        ※ ログインフローはユーザー認証時に実行され、全取引先を定期処理する用途ではありません。\n        ※ レコードトリガーフローは保存イベントが必要なため、更新されていない休眠候補を日付経過だけで検出できません。"
  },
  {
    id: 329,
    category: "自動化",
    source: "新方式対策 高難度再改訂 ID329",
    question: "営業担当者が規定を超える値引きを申請し、営業部長が承認または却下します。申請中は所有者を含む通常利用者が金額と値引率を変更できず、判断結果と承認履歴を商談に残します。単なる保存時検証ではなく人の判断を管理する中心機能はどれですか。",
    choices: [
      "ケース割り当てルールと未処理レコード用キュー",
      "承認者、承認履歴、申請中ロックを持つ承認プロセス",
      "保存前フローで申請状態を再現し同一商談を検出する重複ルールで申請中の編集も止める",
      "商談アクセスを増やす共有ルールと公開グループ"
    ],
    answers: [1],
    explanation: "承認プロセスは申請条件、承認者、承認時と却下時の処理を定義でき、申請中のレコードをロックして無断変更を防止できます。\n        ※ ケース割り当てルールとキューはケースの振り分けに使い、商談の値引き承認には適しません。\n        ※ 保存前フローは項目更新に使えますが、承認者の判断や申請状態の管理を提供しません。重複ルールも目的が異なります。\n        ※ 共有ルールはレコードアクセスを拡張する機能で、値引きの承認経路や申請中ロックを実現しません。"
  },
  {
    id: 330,
    category: "自動化",
    source: "新方式対策 高難度再改訂 ID330",
    question: "複数のフローは、承認完了時に同じ差出人、同じメールテンプレート、同じ受信者規則で営業担当者へ通知します。本文や差出人を各フローへ複製せず、テンプレート変更を一か所から反映します。再利用する構成はどれですか。",
    choices: [
      "各フローのメールアクションへ同じ本文と差出人を個別入力する",
      "各フロー所有者の個人署名を共通テンプレートとして複製する",
      "共通テンプレートと受信者設定を持つメールアラートを呼び出す",
      "毎日のレポート購読を承認イベントの代わりに使用する"
    ],
    answers: [2],
    explanation: "メールアラートへテンプレート、受信者、差出人などを定義してフローから呼び出すと、通知内容を共通管理しやすくなります。\n        ※ 各フローへの本文の直接入力は変更箇所を増やし、内容の不一致を生みやすくなります。\n        ※ 個人署名は自動通知の共通設定ではなく、承認完了を契機に送信する仕組みにもなりません。\n        ※ レポート購読はレポート結果を定期配信する機能で、承認完了イベントの通知には使いません。"
  },
  {
    id: 331,
    category: "自動化",
    source: "新方式対策 高難度再改訂 ID331",
    question: "商談を成立へ変更する保存では契約開始日を必須にします。提案中や交渉中では空欄を許可し、画面、API、データローダーのどの経路でも条件違反なら同じメッセージで保存を拒否します。最も直接的な機能はどれですか。",
    choices: [
      "保存後に不足値を検出するスケジュールトリガーフロー",
      "商談を参照できる利用者を変更する共有ルール",
      "新規レコードの所有者を決める割り当てルール",
      "フェーズと契約開始日の組み合わせを評価する入力規則"
    ],
    answers: [3],
    explanation: "入力規則は保存時に条件を評価し、条件に違反するレコードの保存を止めて利用者へエラーメッセージを表示できます。\n        ※ スケジュールトリガーフローは後から定期実行されるため、不完全なレコードの保存をその場で拒否できません。\n        ※ 共有ルールはレコードへのアクセスを拡張する機能で、入力値の妥当性を制御しません。\n        ※ 割り当てルールはリードやケースの所有者を振り分ける機能で、商談の入力必須条件を検証しません。"
  },
  {
    id: 332,
    category: "自動化",
    source: "新方式対策 高難度再改訂 ID332",
    question: "各商談で金額と確度から加重金額を表示します。どちらかの値が変われば参照時に常に再計算され、過去値の固定保存、ワークフロー、データベースへの追加更新は必要ありません。適切な機能はどれですか。",
    choices: [
      "同じレコードの項目から値を動的算出する数式項目",
      "複数利用者が引き取るまで商談を所有するキュー",
      "人の判断と申請履歴を管理する承認プロセス",
      "一定時間後にレコードを再割り当てするエスカレーションルール"
    ],
    answers: [0],
    explanation: "数式項目は参照する値から表示時に結果を計算するため、元項目の変更を自動的に反映し、計算値を更新する自動化を別途用意する必要がありません。\n        ※ キューはレコードの作業待ちと所有を管理し、計算値を作成しません。\n        ※ 承認プロセスは承認判断を管理する機能で、常時再計算される項目を提供しません。\n        ※ エスカレーションルールはケースを時間条件に基づいて引き上げる機能です。"
  },
  {
    id: 333,
    category: "自動化",
    source: "新方式対策 高難度再改訂 ID333",
    question: "商談の保存が正常に確定した後、外部分析サービスへ内容を通知します。外部応答が遅い場合でも営業担当者の保存画面を待たせず、元トランザクションがロールバックした商談は送信対象にしません。適切な実行経路はどれですか。",
    choices: [
      "データベース保存前に外部処理を待つ保存前フローの即時パス",
      "コミット後に別処理として開始する保存後フローの非同期パス",
      "利用者が外部応答を確認するまで閉じられない画面フロー",
      "商談が却下された場合だけ動く承認プロセスの最終却下アクション"
    ],
    answers: [1],
    explanation: "保存後フローの非同期パスは元のレコード保存トランザクションがコミットされた後に別処理として実行され、遅延し得る外部連携を保存処理から分離できます。\n        ※ 保存前フローはレコード保存の途中で実行され、外部連携を保存完了後へ分離する要件に合いません。\n        ※ 確認画面は利用者との対話に使うもので、バックグラウンドの非同期連携を保証しません。\n        ※ 最終却下アクションは承認申請が却下されたときの処理で、通常の商談保存後連携には適用できません。"
  },
  {
    id: 334,
    category: "自動化",
    source: "新方式対策 高難度再改訂 ID334",
    question: "取引先レコードページのアクションから画面フローを起動します。利用者に取引先を再選択させず、起点レコードのIDをフローへ自動受け渡しして関連データを取得します。フロー側で規約に沿って準備するリソースはどれですか。",
    choices: [
      "特定取引先IDを固定値として保存したテキスト定数",
      "実行日を返して起点取引先を推測する数式リソース",
      "入力を許可したテキスト変数recordId",
      "処理件数だけを呼出し元へ返す出力専用数値変数"
    ],
    answers: [2],
    explanation: "レコードページから起動したフローでは、入力を許可した recordId 変数を用意すると、現在表示しているレコードのIDを受け取って後続処理に利用できます。\n        ※ 固定定数では起動した取引先ごとに異なるレコードIDを取得できません。\n        ※ 現在日付の数式はレコードIDを表さず、対象取引先の特定には使えません。\n        ※ 出力専用変数は起動元から値を受け取れず、取引先IDの受け皿になりません。"
  },
  {
    id: 335,
    category: "自動化",
    source: "新方式対策 高難度再改訂 ID335",
    question: "画面フローの選択欄には、現在有効で在庫対象となる製品を実行時のデータから表示します。製品の追加や無効化をフロー版の更新なしで候補へ反映し、選択した製品レコードのIDを後続処理へ渡します。使うべきリソースはどれですか。",
    choices: [
      "承認処理の過去の判断を表示する承認履歴",
      "管理者が製品名を一件ずつ固定入力する通常の選択肢セット",
      "組織階層ごとの設定値を返す階層カスタム設定",
      "条件に一致する最新レコードから候補を作るレコード選択肢セット"
    ],
    answers: [3],
    explanation: "レコード選択肢セットは指定オブジェクトから条件に合うレコードを取得し、実行時のデータを画面コンポーネントの選択肢として表示できます。\n        ※ 承認履歴は申請と判断の履歴であり、製品選択肢のデータ源にはなりません。\n        ※ 固定選択肢では製品の有効状態や新規追加が自動反映されず、最新データという要件に合いません。\n        ※ 階層カスタム設定は組織やユーザー別の設定値を保持する機能で、製品レコード一覧の動的選択肢ではありません。"
  },
  {
    id: 336,
    category: "自動化",
    source: "新方式対策 高難度再改訂 ID336",
    question: "取得済みのケースコレクションから、優先度が高かつ状況が未完了の要素だけを新しいコレクションへ絞り、元のコレクションは後続の監査処理でも使用します。ループやデータベース再取得を使わず実現する要素はどれですか。",
    choices: [
      "条件でコレクション要素を選別するコレクション検索条件",
      "利用者へケースを選択させる画面要素",
      "指定時刻までフローを待機させる一時停止要素",
      "別の自動起動フローへ元コレクション全件を渡し呼出し先のループで一件ずつ判定するサブフロー要素"
    ],
    answers: [0],
    explanation: "コレクション検索条件を使うと、既に取得したコレクションへ条件を適用し、合致するレコードだけを別コレクションとして後続処理に渡せます。\n        ※ 画面要素は利用者へ情報を表示したり入力を受けたりするもので、コレクションを自動抽出しません。\n        ※ 一時停止要素はフローインタビューを待機させるためのもので、レコードの絞り込みには使いません。\n        ※ サブフローは別フローを呼び出す要素ですが、それだけでコレクションを条件抽出する機能ではありません。"
  },
  {
    id: 337,
    category: "自動化",
    source: "新方式対策 高難度再改訂 ID337",
    question: "既存ワークフロールールのメール通知をレコードトリガーフローへ移します。移行中に本番で同じ保存からメールが二通送られる期間を作らず、問題発生時に比較できるよう旧定義はすぐ削除しません。実施すべき手順を2つ選びなさい。",
    choices: [
      "切替時点で元のワークフロールールを無効化して二重実行を止める",
      "新フローを試験せず先に旧ワークフロールールを完全削除する",
      "旧ルールと新フローを同じ条件で恒久的に同時稼働させる",
      "代表条件と例外条件で新フローを検証してから有効化する"
    ],
    answers: [0, 3],
    explanation: "移行後は同等の条件と処理をテストし、切替時に新しいフローだけが有効になるよう元の自動化を停止します。これにより処理漏れと二重実行の両方を抑えられます。\n        ※ 検証前に元のルールを削除すると、差異が見つかった場合に処理停止や復旧困難を招きます。\n        ※ 両方を同時稼働させると同じ条件でメール処理が二重に実行されるおそれがあります。"
  },
  {
    id: 338,
    category: "自動化",
    source: "新方式対策 高難度再改訂 ID338",
    question: "複雑な税額計算は既存Apexクラスに実装済みで、複数の業務から試験されています。管理者はフローで入力収集、分岐、レコード更新を保守し、税計算部分だけを再利用します。Apexを数式へ書き換えず連携する方法はどれですか。",
    choices: [
      "Apex計算をレポートの行レベル数式へ自動変換する",
      "呼び出し可能として公開されたApexアクションをフローから実行する",
      "Apexソースを文字列としてフローの数式リソースへ貼り付ける",
      "フローを廃止して税額をすべて利用者の手入力へ戻す"
    ],
    answers: [1],
    explanation: "必要なApexロジックを呼び出し可能なアクションとして公開すれば、フローから入出力を渡して実行し、宣言的な分岐や更新と組み合わせられます。\n        ※ 行レベル数式はレポート結果を計算する機能で、Apex処理やレコード更新を実行できません。\n        ※ フローの数式欄ではApexコードを実行できません。\n        ※ 手作業への置換は自動化と保守性の要件を満たしません。"
  },
  {
    id: 339,
    category: "Agentforce",
    source: "新方式対策 高難度再改訂 ID339",
    question: "顧客向けサービスエージェントの製品回答は、承認済みで現在公開中のナレッジ記事だけを根拠にします。質問に関連する本文断片を検索してプロンプトへ渡し、記事の追加や改訂を指示文の手修正なしで反映します。構成すべきものはどれですか。",
    choices: [
      "全記事のURLと公開日時をサブエージェントの指示へ固定文字列として列挙し改訂ごとに手動更新する",
      "記事タイトルだけを一つの固定プロンプトテンプレートへ埋め込む",
      "承認済みコンテンツを索引化して検索に使うAgentforceデータライブラリ",
      "顧客のケース検索結果だけを製品仕様の回答根拠として使用する"
    ],
    answers: [2],
    explanation: "Agentforceデータライブラリで承認されたナレッジを検索対象にすると、関連情報を取得して回答を組織の信頼できるコンテンツへグラウンディングできます。\n        ※ URLを指示へ列挙しても、記事本文が検索用インデックスへ取り込まれず、関連箇所を取得して回答へ根拠付けできません。\n        ※ 記事タイトルだけでは本文の最新情報を取得できず、質問に関連する内容を検索して回答する構成になりません。\n        ※ ケース検索の結果は顧客状況の把握には使えますが、承認済み製品ナレッジの本文を回答根拠として提供しません。"
  },
  {
    id: 340,
    category: "Agentforce",
    source: "新方式対策 高難度再改訂 ID340",
    question: "サービスエージェントは意図どおりケース照会アクションを選びますが、実行時にオブジェクトアクセスエラーになります。同じ入力で基盤フローを管理者としてデバッグすると成功し、分類精度にも問題はありません。最初に確認すべきものはどれですか。",
    choices: [
      "指示へ権限検査を省略するよう記載して実行コンテキストを上書きする",
      "管理者権限のプレビューが成功することだけを本番確認とする",
      "サブエージェントの分類説明へケース参照という単語を追加する",
      "エージェント利用者のフロー実行権限とケースおよび項目権限"
    ],
    answers: [3],
    explanation: "エージェントアクションは基盤となるフローやApexの実行権限と、参照または更新するオブジェクトや項目へのアクセスを必要とします。実行主体へ最小権限を付与して確認します。\n        ※ 自然言語の指示でSalesforceの権限検査を省略することはできず、そのような回避を前提にすべきではありません。\n        ※ 管理者権限での成功だけでは実際の実行ユーザーの不足権限を検出できません。対象と同じ権限条件で確認する必要があります。\n        ※ 分類説明はアクションを選ぶ手掛かりですが、フロー実行権限やケースへの参照権限を付与しません。"
  },
  {
    id: 341,
    category: "Agentforce",
    source: "新方式対策 高難度再改訂 ID341",
    question: "生成AIへCRMデータを渡す構成をセキュリティレビューします。モデル回答の業務上の正しさを無条件に保証したり不足権限を付与したりするのではなく、送信データと生成結果に対する保護機構を確認します。Einstein Trust Layerの対策を2つ選びなさい。",
    choices: [
      "生成された業務判断の事実性をすべて自動保証する",
      "生成結果に含まれる有害な内容を検出する",
      "送信前に機密データを検出してマスキングする",
      "回答に必要なCRM権限を実行利用者へ自動追加する"
    ],
    answers: [1, 2],
    explanation: "Einstein Trust Layerには機密データのマスキングや有害性の検出などが含まれ、生成AI利用時の情報保護と安全な応答を支援します。\n        ※ 有害性検出やグラウンディングはリスクを下げますが、生成回答の業務上の正確性を常に保証するものではなく、検証が必要です。\n        ※ Trust Layerは利用者やエージェントへ不足権限を追加しません。オブジェクト、項目、レコード、基盤アクションの権限は別途設計します。"
  },
  {
    id: 342,
    category: "Agentforce",
    source: "新方式対策 高難度再改訂 ID342",
    question: "本番公開前に、数百件の代表発話を複数回実行し、期待するサブエージェント、アクション順序、回答要点と実結果をまとめて比較します。生成結果の揺らぎも評価し、更新アクションが本番顧客データへ触れない環境で回帰試験します。適切な機能はどれですか。",
    choices: [
      "サンドボックスで期待値付き試験を一括実行するAgentforce Testing Center",
      "Agentforce Builderの会話プレビューで代表発話を一件ずつ手動実行し最初の成功結果だけを合格とする方法",
      "公開後の利用状況だけを集計するAgentforce Analytics",
      "基盤フローだけを単体確認して分類と最終回答を評価しないフローデバッグ"
    ],
    answers: [0],
    explanation: "Agentforce Testing Centerではテスト発話と期待結果を使ってエージェントを一括評価し、トピック分類やアクション選択の結果を公開前に確認できます。\n        ※ 会話プレビューは個別シナリオの調査に有効ですが、多数の発話を期待結果と一括比較する要件にはTesting Centerが適します。\n        ※ Analyticsは公開後の利用傾向やセッション分析に有効ですが、本番公開前のテストケース一括評価とは目的が異なります。\n        ※ フローデバッグは基盤処理を確認できますが、発話のトピック分類からアクション選択までをまとめて評価しません。"
  },
  {
    id: 343,
    category: "Agentforce",
    source: "新方式対策 高難度再改訂 ID343",
    question: "顧客向けエージェントは会話の途中で本人確認を完了します。その結果を後続ターンでも保持し、確認済みかつ返金期限内の場合だけ返金アクションを選択候補にします。指示文へのお願いだけに依存せず実行可能性を制御する設計を2つ選びなさい。",
    choices: [
      "確認状態と期限を評価して返金アクションを利用可能にするフィルター",
      "本人確認結果を後続判断で参照できる会話コンテキストへ保持する設定",
      "返金フローが読む全データの共有設定を公開参照更新へ広げる",
      "本人確認してから返金するよう指示へ記載するだけで技術的制御を省略する"
    ],
    answers: [0, 1],
    explanation: "本人確認の結果を信頼できる会話コンテキストとして保持し、その値を条件にしたフィルターで返金アクションを制限すると、高リスク処理の実行境界を強制できます。\n        ※ データアクセスを広げても利用者本人であることは確認できず、最小権限の原則にも反します。\n        ※ 案内を指示へ書くだけでは、確認結果を機械的に保持して返金アクションの利用可否へ強制できません。"
  },
  {
    id: 344,
    category: "Agentforce",
    source: "新方式対策 高難度再改訂 ID344",
    question: "注文状況を教えてという発話が、注文変更サブエージェントへ誤って分類されます。分類後に各アクションを直接テストすると正しく動き、二つのサブエージェントが似た責任範囲の説明を持つことが分かりました。最初に行う改善はどれですか。",
    choices: [
      "状況照会アクションの出力表示形式だけを変更する",
      "二つの分類説明とスコープへ対象依頼と除外境界を明確に記述して再テストする",
      "変更アクションの入力パラメーター名だけを長くする",
      "二つを一つへ統合して照会と変更の全アクションを常に候補にし実行後の結果から処理種別を判定する"
    ],
    answers: [1],
    explanation: "トピック選択の誤りには、各トピックを選ぶ条件と対象外の境界が区別できるよう分類説明とスコープを修正し、代表発話で再検証するのが適切です。\n        ※ アクション出力の表示方法を変えても、誤ったトピックが選択される分類問題は解消しません。\n        ※ アクションの入力指示はトピック選択後の実行に関係し、どのトピックへ分類するかという境界を直接改善しません。\n        ※ トピックを統合して変更アクションまで広く公開すると、読み取り依頼と更新依頼の境界が弱まり、不要な操作リスクが増えます。"
  },
  {
    id: 345,
    category: "Agentforce",
    source: "新方式対策 高難度再改訂 ID345",
    question: "会話プレビューでは正しい顧客照会サブエージェントと照会アクションが選ばれています。しかし表示される契約番号と更新日は別顧客の値で、基盤処理の単体試験でも同じ出力になります。分類説明を直す前に優先して調査すべき箇所はどれですか。",
    choices: [
      "既に正しく選択されるサブエージェントの分類説明だけ",
      "データ取得と無関係なエージェントの歓迎メッセージ",
      "アクションの入力対応、出力対応、基盤フローまたはAPI処理",
      "この照会アクションが参照していないデータライブラリを全件再索引化して契約値も置き換える"
    ],
    answers: [2],
    explanation: "トピックとアクションの選択が正しいなら、次は渡された入力値、実行権限、基盤となるフローやApexの検索条件と出力を追跡し、誤ったデータの発生箇所を切り分けます。\n        ※ 分類説明はどのトピックを選ぶかに影響しますが、既に正しく選ばれたアクションの入力値や処理結果は修正しません。\n        ※ 歓迎メッセージは会話開始時の案内であり、アクションへ渡す値や基盤処理の検索条件を変更しません。\n        ※ ナレッジ検索が原因でない顧客情報アクションに対して再インデックスしても、入力割り当てや基盤処理の誤りは解消しません。"
  },
  {
    id: 346,
    category: "Agentforce",
    source: "新方式対策 高難度再改訂 ID346",
    question: "顧客が契約解約の法的妥当性や訴訟見通しを質問した場合、サービスエージェントは法的結論を生成せず、会話と顧客情報を専門担当者へ引き継ぎます。一般的な契約状況照会は引き続き自動対応します。最も適切な設定はどれですか。",
    choices: [
      "契約変更アクションを追加して法的相談でも自動解約まで実行する",
      "契約サブエージェントのスコープをすべての法的判断へ拡大する",
      "法的結論を必ず生成するプロンプトテンプレートを追加し信頼度が低い場合だけ担当者へ通知する",
      "法的判断の禁止と条件を示す指示および人へのエスカレーションアクション"
    ],
    answers: [3],
    explanation: "扱ってはいけない法的判断をトピック指示で明示し、該当時に専門担当者へ接続するエスカレーションアクションを利用できるようにすると、ガードレールと実際の引継ぎを両方実装できます。\n        ※ 契約変更アクションの追加はエージェントが実行できる高リスク操作を増やし、専門担当者への引継ぎを実現しません。\n        ※ スコープを広げると対象外にすべき法的判断までエージェントの対応範囲へ入り、要件と逆になります。\n        ※ 法的判断を生成させると、人へ引き継ぐというガードレールに反し、正確性と責任の境界も曖昧になります。"
  },
{
    id: 347,
    category: "設定とセットアップ",
    source: "新方式対策 追加問題 ID347",
    question: "法務部と調達部のユーザーは、共有設定や共有ルールによって多数の契約を参照できます。各ユーザーには、自分の部門と契約の部門が一致する契約だけを表示し、それ以外の契約は非表示にします。既存の共有モデルは維持する必要があります。最も適切な設定はどれですか。",
    choices: ["部門別の条件ベース共有ルールを追加する", "部門を照合する契約の制限ルールを作成する", "契約タブへ部門別の公開リストビューを作成する", "契約の組織の共有設定を非公開へ変更する"],
    answers: [1],
    explanation: `制限ルールは、組織の共有設定や共有ルールなどで既に参照できるレコードを、指定したレコード条件でさらに絞り込みます。対象ユーザーを指定し、契約の部門と現在のユーザーの部門を照合することで要件を満たせます。
        ※ 条件ベース共有ルールはレコードアクセスを追加する機能であり、既に参照できる契約を利用者別に非表示にはできません。
        ※ リストビューは画面に表示する結果を絞るだけで、検索、レポート、関連リストなど別の経路からのアクセスを制限しません。
        ※ 組織の共有設定を非公開にすると全利用者へ影響し、部門が一致する契約だけを利用者ごとに残す処理も単独では実現できません。`
  },
  {
    id: 348,
    category: "設定とセットアップ",
    source: "新方式対策 追加問題 ID348",
    question: "ユーザーの部門が営業へ変更されたとき、営業用の権限セットグループと商談審査キューを付与し、以前のサービス用権限セットグループを取り外します。新規ユーザーと異動者の両方へ自動適用する、最も保守しやすい機能はどれですか。",
    choices: ["ユーザーを起点にする承認プロセス", "部門ごとに複製したユーザープロファイル", "作成と更新で実行するユーザーアクセスポリシー", "営業レコードを部門別に公開する条件ベース共有ルール"],
    answers: [2],
    explanation: `有効なユーザーアクセスポリシーは、ユーザーレコードの作成または更新を契機に条件を評価し、権限セットグループ、キュー、公開グループなどを付与または削除できます。部門変更を一つの管理対象として扱えるため、異動時の付け外しにも適しています。
        ※ 承認プロセスはレコードに対する承認経路を管理しますが、ユーザーの所属条件に応じて複数のアクセス機構を継続的に付け替える機能ではありません。
        ※ 部門ごとにプロファイルを複製すると構成が増え、キュー所属や権限セットグループの削除まで一元的に自動化できません。
        ※ 共有ルールは業務レコードへのアクセスを拡張しますが、ユーザーへ権限セットグループやキュー所属を割り当てません。`
  },
  {
    id: 349,
    category: "設定とセットアップ",
    source: "新方式対策 追加問題 ID349",
    question: "退職者を無効化しようとしたところ、そのユーザーがユーザーオブジェクトの階層項目で参照されているため保存できませんでした。参照先を変更するまでの間、ログインを直ちに停止する方法はどれですか。",
    choices: ["対象ユーザーを凍結する", "対象ユーザーのロールを空欄にする", "対象ユーザーのパスワードを期限切れにする", "対象ユーザーの所有レコードだけを移管する"],
    answers: [0],
    explanation: `ユーザーの凍結は、無効化を妨げる参照や設定を解消している間も、そのアカウントからのログインを直ちに停止できます。凍結ではライセンスは解放されないため、依存関係を解消した後にユーザーを無効化します。
        ※ ロールを外してもログイン資格は残り、ユーザーが所有するレコードへのアクセス構造が変わるだけです。
        ※ パスワード操作だけでは既存の認証経路を確実に停止する方法にならず、無効化を妨げている階層項目も解消しません。
        ※ 所有レコードの移管は退職処理の一部になり得ますが、ユーザーのログインをその場で禁止する操作ではありません。`
  },
  {
    id: 350,
    category: "設定とセットアップ",
    source: "新方式対策 追加問題 ID350",
    question: "財務担当者は社内VPNの送信元アドレスからだけSalesforceへログインできます。範囲外からは本人確認を追加してもログインを拒否する必要があります。管理者が設定すべきものはどれですか。",
    choices: ["組織のネットワークアクセスにある信頼済みIP範囲", "セッションをログイン元のIPへ固定するセッション設定", "財務担当者のプロファイルに設定するログイン時間", "財務担当者のプロファイルに設定するログインIP範囲"],
    answers: [3],
    explanation: `プロファイルのログインIP範囲は、そのプロファイルのユーザーがログインできる接続元を制限します。範囲外からのログインは本人確認で通過させず、拒否する要件に合います。
        ※ 組織の信頼済みIP範囲は範囲内で本人確認要求を減らしますが、範囲外のユーザーも追加確認に成功すればログインできます。
        ※ セッションをIPへ固定する設定は開始済みセッションの接続元変化を扱うもので、許可されたログイン元の範囲を定義する設定ではありません。
        ※ ログイン時間は曜日と時刻を制御しますが、社内VPNかどうかという送信元アドレスは評価しません。`
  },
  {
    id: 351,
    category: "設定とセットアップ",
    source: "新方式対策 追加問題 ID351",
    question: "あるユーザーだけがケースの機密区分項目を編集できます。プロファイル、複数の権限セット、権限セットグループのどれが編集権限を付与しているかを最短で特定する方法はどれですか。",
    choices: ["ケースの共有設定でユーザーのロールだけを確認する", "設定変更履歴から項目値の変更者だけを検索する", "ケースページレイアウトの割り当てだけを比較する", "ユーザーアクセス概要で権限の付与元を表示する"],
    answers: [3],
    explanation: `ユーザーアクセス概要には、そのユーザーの主要な権限と割り当てが集約されます。対象権限の付与元を表示すると、どのプロファイル、権限セット、権限セットグループが権限を与えているかを追跡できます。
        ※ 共有設定とロールは主にレコード単位の参照範囲を決めるため、項目の編集権限を付与した構成要素は特定できません。
        ※ 設定変更履歴は管理設定の変更を監査する機能で、現在のユーザー権限を付与元別に合算して表示しません。
        ※ ページレイアウトは画面上の編集状態に影響しますが、権限セットによる項目レベルセキュリティの付与元を示しません。`
  },
  {
    id: 352,
    category: "設定とセットアップ",
    source: "新方式対策 追加問題 ID352",
    question: "監査調査カスタムオブジェクトの組織の共有設定は非公開です。所有者の上位ロールにいる役員にも自動的には見せず、監査グループには既存の共有ルールで参照させます。変更すべき設定はどれですか。",
    choices: ["カスタムオブジェクトの階層を使用したアクセス許可を無効にする", "役員をロール階層から外して公開グループだけに追加する", "共有ルールに役員をアクセス拒否の宛先として追加する", "機密項目を全プロファイルのページレイアウトから削除する"],
    answers: [0],
    explanation: `カスタムオブジェクトでは、階層を使用したアクセス許可を無効にできます。これにより上位ロールへの自動的なレコードアクセス継承を止めつつ、監査グループへ明示した共有ルールは維持できます。
        ※ ロールはレコードアクセス以外にもレポートや共有先で利用されるため、役員を階層から外すことは要件に対して過剰です。
        ※ 共有ルールはアクセスを付与する仕組みであり、特定ユーザーへのアクセス拒否ルールとしては作成できません。
        ※ ページレイアウトから項目を外してもレコードへのアクセスは残り、レポートやAPIからの参照を防ぐセキュリティ設定にもなりません。`
  },
  {
    id: 353,
    category: "設定とセットアップ",
    source: "新方式対策 追加問題 ID353",
    question: "権限セットグループ内で請求書の削除権限をミュートしました。しかし、グループを割り当てた一部のユーザーは引き続き請求書を削除できます。最初に確認すべき原因はどれですか。",
    choices: ["権限セットグループの再計算が完了していない", "ロール階層から削除権限が継承されている", "プロファイルか別の権限セットが削除権限を付与している", "請求書の組織の共有設定が公開になっている"],
    answers: [2],
    explanation: `ミュート権限セットが抑制できるのは、同じ権限セットグループから付与される権限です。プロファイルやグループ外の権限セットが削除権限を付与していれば、その権限は有効なままなので、ユーザーアクセス概要などで別の付与元を確認します。
        ※ 再計算中は反映待ちになる場合がありますが、一部ユーザーだけ継続して削除できるなら、まず各ユーザーの別の権限付与元を比較すべきです。
        ※ ロール階層はレコードアクセスを上位へ拡張しますが、オブジェクトの削除権限そのものを付与しません。
        ※ 組織の共有設定が公開でも、オブジェクトレベルの削除権限がなければレコードを削除できません。`
  },
  {
    id: 354,
    category: "設定とセットアップ",
    source: "新方式対策 追加問題 ID354",
    question: "内部監査ユーザーには、所有者や共有に関係なくすべての請求書レコードを参照させます。ただし請求書の編集や削除、他オブジェクトへの広範なアクセスは許可しません。最小権限となる設定はどれですか。",
    choices: ["請求書に対するすべてのレコードの変更権限", "請求書に対するすべてのレコードの参照権限", "組織全体に対するすべてのデータの参照権限", "請求書の組織の共有設定を公開参照更新に変更する"],
    answers: [1],
    explanation: `請求書オブジェクトのすべてのレコードの参照権限は、共有設定を無視してそのオブジェクトの全レコードを参照させます。編集や削除は追加せず、他オブジェクトにも波及しないため要件に対する最小権限です。
        ※ すべてのレコードの変更権限は参照だけでなく編集や削除も可能にするため、監査担当者へ過剰な権限を与えます。
        ※ すべてのデータの参照権限は組織内の多数のオブジェクトへ及び、請求書だけという範囲を超えます。
        ※ 組織の共有設定を公開参照更新にすると全ユーザーの編集範囲を拡大し、監査ユーザーだけに限定できません。`
  },
  {
    id: 355,
    category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
    source: "新方式対策 追加問題 ID355",
    question: "既にデータがある明細カスタムオブジェクトへ親請求書との主従関係を追加します。既存明細を削除せず、すべての明細に正しい親を設定してから主従関係へ移行する手順はどれですか。",
    choices: ["親が空の既存明細を残したまま主従関係を直接作成して後から更新する", "参照関係を作成して全件へ親を設定した後に主従関係へ変換する", "外部ID項目を作成して親レコード名を保存する", "階層関係を作成して請求書レコードへ割り当てる"],
    answers: [1],
    explanation: `既存レコードがある詳細オブジェクトでは、まず任意入力の参照関係を作成し、すべての既存レコードへ有効な親IDを設定します。空値がなくなった後に、その関係を主従関係へ変換することでデータを保持できます。
        ※ 主従関係の詳細側では親が必須になるため、親が未設定の既存レコードがある状態では直接作成できません。
        ※ 外部IDはデータ連携の照合に利用できますが、それだけでは親子関係や主従関係を構成しません。
        ※ 階層関係はユーザーオブジェクトで利用する特殊な関係であり、請求書と明細の関係には使用できません。`
  },
  {
    id: 356,
    category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
    source: "新方式対策 追加問題 ID356",
    question: "直販商談と代理店商談では、使用するフェーズ値と入力画面が異なります。同じ営業プロファイルのユーザーが両方を作成できるようにします。必要な構成はどれですか。",
    choices: ["二つのページレイアウトだけを作成してユーザーごとに切り替える", "一つのレコードタイプでフェーズの全値を表示して入力規則で制御する", "二つの権限セットでフェーズ値とページレイアウトを割り当てる", "営業プロセスとレコードタイプを分けてページレイアウトを割り当てる"],
    answers: [3],
    explanation: `商談の営業プロセスは利用可能なフェーズ値を定義し、レコードタイプは営業プロセスと選択リスト値を利用者へ提供します。さらにプロファイルとレコードタイプの組み合わせへページレイアウトを割り当てることで、同じユーザーが二つの処理を使い分けられます。
        ※ ページレイアウトだけでは商談ごとに利用可能なフェーズ値を別の集合へ制限できず、同じプロファイル内で作成時に処理を選べません。
        ※ 一つのレコードタイプへ全フェーズを表示すると不要な値も選択でき、入力規則による事後拒否が増えて操作性も低下します。
        ※ 権限セットはレコードタイプへのアクセスを追加できますが、営業プロセスを定義したりページレイアウト割り当ての軸になったりしません。`
  },
  {
    id: 357,
    category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
    source: "新方式対策 追加問題 ID357",
    question: "取引先レコードページに、優先度が高い未解決ケースだけを5件表示し、同じページの別の場所には最近解決したケースを表示します。利用者が固定条件を解除できない構成はどれですか。",
    choices: ["ページレイアウトに同じケース関連リストを二回追加する", "ケースの公開リストビューを二つ作り取引先ページへ別々に埋め込む", "条件の異なる動的関連リスト単一コンポーネントを二つ配置する", "取引先のコンパクトレイアウトへケース項目を追加する"],
    answers: [2],
    explanation: `動的関連リスト単一コンポーネントでは、関連レコードの固定フィルター、並び順、表示件数、列をLightningアプリケーションビルダーで設定できます。同じ関連オブジェクトについて条件の異なるコンポーネントを複数配置できます。
        ※ ページレイアウト上の標準関連リストを重複配置しても、それぞれに異なる固定フィルターを管理者が設定する構成にはなりません。
        ※ 公開リストビューはオブジェクト全体を対象とし、現在の取引先との関連をページコンポーネントとして自動的に限定する方法ではありません。
        ※ コンパクトレイアウトはレコードの主要項目を強調表示するためのもので、関連ケースを条件別に一覧表示しません。`
  },
  {
    id: 358,
    category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
    source: "新方式対策 追加問題 ID358",
    question: "営業担当者は商談を開いた直後に、金額、完了予定日、競合状況を強調表示パネルで確認したいと考えています。関連する参照項目へマウスを合わせたときのカードにも主要項目を表示します。設定すべきものはどれですか。",
    choices: ["商談のコンパクトレイアウト", "商談の検索レイアウト", "商談のページレイアウト関連リスト", "商談のリストビュー表示項目"],
    answers: [0],
    explanation: `コンパクトレイアウトはLightning Experienceの強調表示パネルや参照項目のプレビューカードなどに表示する主要項目を定義します。必要に応じてレコードタイプごとに異なるコンパクトレイアウトも割り当てられます。
        ※ 検索レイアウトは検索結果や参照検索画面などの列を制御し、レコードヘッダーの主要項目を決めません。
        ※ ページレイアウトの関連リストは子レコード一覧を制御する領域であり、強調表示パネルの項目源ではありません。
        ※ リストビューの表示項目は一覧画面の列を定義し、レコードページや参照カードの主要項目には反映されません。`
  },
  {
    id: 359,
    category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
    source: "新方式対策 追加問題 ID359",
    question: "営業アプリ内の法人顧客レコードだけに新しい取引先Lightningページを表示します。同じプロファイルでも、サービスアプリや個人顧客レコードでは現在のページを維持します。どの割り当てを使用しますか。",
    choices: ["組織のデフォルトページとしてすべての取引先へ有効化する", "法人顧客のページレイアウトだけを営業プロファイルへ割り当てる", "営業アプリのナビゲーション項目へ新しいページを追加する", "アプリケーションとレコードタイプとプロファイルを組み合わせて有効化する"],
    answers: [3],
    explanation: `Lightningレコードページは、有効化時にアプリケーション、レコードタイプ、プロファイルの組み合わせへ割り当てられます。営業アプリ、法人顧客レコードタイプ、対象プロファイルを指定すれば、他のアプリやレコードタイプのページを維持できます。
        ※ 組織のデフォルトにすると対象オブジェクトの広い範囲へ適用され、営業アプリと法人顧客だけという条件を満たしません。
        ※ ページレイアウトは項目、関連リスト、アクションを制御しますが、アプリごとのLightningページ全体を選択しません。
        ※ ナビゲーション項目は利用できるタブを定義するもので、レコードを開いた際のページ割り当てにはなりません。`
  },
  {
    id: 360,
    category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
    source: "新方式対策 追加問題 ID360",
    question: "一人の技術者が複数のプロジェクトへ参加し、一つのプロジェクトにも複数の技術者が参加します。参加ごとに役割、配賦率、開始日を保存し、両側の親で参加件数を集計します。適切なデータモデルはどれですか。",
    choices: ["技術者にプロジェクトへの複数選択リストを作成する", "参加カスタムオブジェクトへ二つの主従関係を作成する", "プロジェクトから技術者への参照項目を一つ作成する", "技術者とプロジェクトへ同じ一意の外部IDを設定する"],
    answers: [1],
    explanation: `参加カスタムオブジェクトを連結オブジェクトとし、技術者とプロジェクトへの二つの主従関係を作成すると多対多関係を表現できます。役割などは参加レコードへ保存でき、両親側で積み上げ集計も利用できます。
        ※ 複数選択リストはレコード間の関係を作らず、参加ごとの属性や参照整合性を管理できません。
        ※ 一つの参照項目では各プロジェクトに一人の技術者しか直接関連付けられず、多対多関係を表現できません。
        ※ 外部IDは外部データとの照合キーであり、技術者とプロジェクトの参加関係や集計を構成しません。`
  },
  {
    id: 361,
    category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
    source: "新方式対策 追加問題 ID361",
    question: "人事ケースの給与項目は人事担当者以外からすべてのアクセス経路で隠します。一方、エスカレーション理由項目はケース状況がエスカレーション済みのときだけページに表示します。必要な設定を2つ選びなさい。",
    choices: ["給与項目に項目レベルセキュリティを設定する", "エスカレーション理由へ動的フォームの表示条件を設定する", "給与項目を人事用以外のページレイアウトから外すだけにする", "ケース所有者を人事キューへ変更する共有ルールを作成する"],
    answers: [0,1],
    explanation: `項目レベルセキュリティはレコードページだけでなく、レポート、検索、APIなどを含む項目アクセスの境界になります。動的フォームの表示条件は、レコードの状況に応じてエスカレーション理由をページ上で出し分ける用途に適しています。
        ※ ページレイアウトから給与項目を外すだけでは、項目レベルセキュリティが許可されている利用者がレポートやAPIなどから参照できる可能性が残ります。
        ※ 共有ルールはレコードへのアクセスを追加する機能で、給与項目の秘匿や状況に応じた画面表示を制御しません。`
  },
  {
    id: 362,
    category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
    source: "新方式対策 追加問題 ID362",
    question: "プロジェクトと経費は主従関係です。プロジェクトに承認済み経費の合計を保持し、新しい承認済み経費によって予算を超える場合は明細の保存を拒否します。宣言的な構成として最も適切なものはどれですか。",
    choices: ["プロジェクトの数式項目だけで全経費を動的に検索する", "経費の自動採番項目とプロジェクトの重複ルールを組み合わせる", "条件付き積み上げ集計と親項目を参照する経費の入力規則を使う", "経費の共有ルールとプロジェクトのコンパクトレイアウトを使う"],
    answers: [2],
    explanation: `プロジェクト側の積み上げ集計で承認済み経費だけを合計できます。経費側の入力規則では、保存前の親合計に今回の承認済み金額を加えて予算と比較し、超過する明細を拒否できます。
        ※ 数式項目は任意の子レコード集合を検索して集計できないため、親に経費合計を作成できません。
        ※ 自動採番と重複ルールは識別子や重複を管理する機能であり、予算合計や上限を検証しません。
        ※ 共有ルールとコンパクトレイアウトはアクセスと表示を制御しますが、子金額の集計や保存拒否には使用しません。`
  },
  {
    id: 363,
    category: "セールス&マーケティングアプリケーション",
    source: "新方式対策 追加問題 ID363",
    question: "リードの関心製品カスタム項目を、取引開始時に新規取引先責任者と新規商談の両方へ引き継ぎます。利用者に再入力させないために管理者が行う設定はどれですか。",
    choices: ["リードのカスタム項目の対応付けを設定する", "リード割り当てルールへ二つの更新処理を追加する", "商談の主キャンペーンソースへ関心製品を保存する", "取引先責任者と商談の数式からリードを参照する"],
    answers: [0],
    explanation: `リードのカスタム項目は、取引開始時に取引先、取引先責任者、商談の対応するカスタム項目へマッピングできます。Lightning Experienceでは一つのリード項目を複数の変換先オブジェクトへ対応付けられます。
        ※ リード割り当てルールはリード所有者を決定する機能で、取引開始後に作成されるレコードへの項目変換を定義しません。
        ※ 主キャンペーンソースは商談へ影響した主要キャンペーンを関連付ける項目で、製品関心情報の変換先ではありません。
        ※ 取引開始後の取引先責任者や商談から元のリードを一般的な数式関係として参照することはできません。`
  },
  {
    id: 364,
    category: "セールス&マーケティングアプリケーション",
    source: "新方式対策 追加問題 ID364",
    question: "有効な製品を標準価格100ドルで販売しています。教育機関向け商談では同じ製品を85ドルの定価で選択でき、一般商談の標準価格は維持します。必要な設定はどれですか。",
    choices: ["標準価格を85ドルへ変更して一般商談だけ値引きを取り消す", "教育機関用に同じ商品コードの製品レコードを複製する", "有効な標準価格を保ち教育機関用価格表へ85ドルの価格表エントリを作る", "商談の通貨を変更して換算後の金額が85ドルになるよう調整する"],
    answers: [2],
    explanation: `カスタム価格表は、地域や顧客区分ごとに同じ製品へ異なる定価を設定するための機能です。製品に有効な標準価格表エントリを保持したうえで、教育機関用価格表へ85ドルの価格表エントリを作成します。
        ※ 標準価格を変更すると一般商談を含む基準価格へ影響し、教育機関だけ別価格にする要件を満たしません。
        ※ 製品を複製すると在庫、レポート、商品コードの管理が分断され、同じ製品に市場別価格を持たせる標準構成を利用できません。
        ※ 通貨換算は通貨間の価値を扱う機能であり、顧客区分ごとの任意の定価を管理する代わりにはなりません。`
  },
  {
    id: 365,
    category: "セールス&マーケティングアプリケーション",
    source: "新方式対策 追加問題 ID365",
    question: "営業マネージャーは、部下の商談から積み上がった達成予測が5000万円でも、判断を加えて4700万円として上位へ報告します。元の商談金額や通常レポートは変更したくありません。使用すべき機能はどれですか。",
    choices: ["商談金額を一括更新して予測値へ合わせる", "商談分割の合計率を94パーセントへ変更する", "売上予測カテゴリを達成予測からパイプラインへ移す", "共同売上予測でマネージャー調整を入力する"],
    answers: [3],
    explanation: `共同売上予測の調整は、マネージャーの判断を売上予測へ追加するための機能です。調整後の値は予測階層へ反映されますが、基礎となる商談の金額や未調整の積み上げを変更せず、通常の商談レポートにも調整値を保存しません。
        ※ 商談金額を変更すると営業レコードそのものが変わり、契約見込額や通常レポートにも不要な影響が出ます。
        ※ 商談分割はチームメンバーへ売上クレジットを配分する機能で、マネージャー判断による予測総額の調整には使いません。
        ※ 予測カテゴリを変更すると商談の予測上の位置付けを変えてしまい、元の分類を保ったまま判断額を追加する要件に合いません。`
  },
  {
    id: 366,
    category: "セールス&マーケティングアプリケーション",
    source: "新方式対策 追加問題 ID366",
    question: "イベントキャンペーンへ追加したメンバーは最初に招待済みとなり、登録済みと参加済みを反応としてキャンペーンの反応数へ集計します。管理者が設定すべきものはどれですか。",
    choices: ["キャンペーン自体の状況項目へ招待済みと参加済みの選択肢を新しく追加する", "キャンペーンメンバー状況で既定値と反応として扱う値を設定する", "キャンペーン階層で登録済みキャンペーンを子として追加する", "取引先責任者の役割へ登録済みと参加済みを追加する"],
    answers: [1],
    explanation: `キャンペーンメンバー状況では、メンバー追加時に使う既定の状況と、反応として集計する状況をキャンペーンごとに設定できます。招待済みを既定にし、登録済みと参加済みに反応の指定を行います。
        ※ キャンペーン自体の状況は企画中、進行中、完了などキャンペーンの進行を表し、個々のメンバーの反応段階ではありません。
        ※ キャンペーン階層は複数キャンペーンを親子で集計する仕組みで、メンバー追加時の既定状況を定義しません。
        ※ 取引先責任者の役割は商談における顧客側関係者の役割であり、キャンペーンへの反応を集計しません。`
  },
  {
    id: 367,
    category: "セールス&マーケティングアプリケーション",
    source: "新方式対策 追加問題 ID367",
    question: "大型商談では、社内の技術担当と法務担当へ商談アクセスと担当役割を与えます。成立時には所有者70パーセント、技術担当20パーセント、法務担当10パーセントとして売上クレジットを記録します。必要な機能を2つ選びなさい。",
    choices: ["取引先チーム", "売上予測のマネージャー調整", "商談チーム", "商談の売上分割"],
    answers: [2,3],
    explanation: `商談チームは商談へ協力する社内ユーザー、役割、アクセスレベルを管理します。商談の売上分割はチームメンバー間の売上クレジットを割合で記録し、合計100パーセントとなる配分を管理できます。
        ※ 取引先チームは取引先全体を担当する社内ユーザーを管理しますが、個別商談の協力者と売上クレジットの配分を同時には表しません。
        ※ 売上予測の調整は予測額へ管理者判断を加える機能で、商談成立への各担当者の貢献割合を記録しません。`
  },
  {
    id: 368,
    category: "サービス&サポートアプリケーション",
    source: "新方式対策 追加問題 ID368",
    question: "同じエンタイトルメントプロセス内で、ケース解決時間は平日の午前9時から午後5時だけを計測します。ただし重大ケースの初回応答時間は夜間と休日も含めて計測します。営業時間に関する設定を2つ選びなさい。",
    choices: ["エンタイトルメントプロセスへ平日の営業時間を設定する", "ケースへ24時間の営業時間を設定して全体へ継承する", "初回応答マイルストーンへ24時間の営業時間を設定する", "解決時間マイルストーンへ24時間の営業時間を設定する"],
    answers: [0,2],
    explanation: `エンタイトルメントプロセスへ平日の営業時間を設定すると、独自設定のない解決時間マイルストーンがそれを継承します。初回応答マイルストーンだけに24時間の営業時間を設定すると、マイルストーン側の設定がプロセス側より優先されます。
        ※ ケースの営業時間はエンタイトルメントプロセスやマイルストーンより優先順位が低く、同じプロセス内で二つの計測条件を分けられません。
        ※ 解決時間マイルストーンを24時間にすると夜間と休日も解決時間へ算入され、平日営業時間だけという要件に反します。`
  },
  {
    id: 369,
    category: "サービス&サポートアプリケーション",
    source: "新方式対策 追加問題 ID369",
    question: "ケース割り当てルールの最初に製品がソフトウェアという条件があり、その後に製品がソフトウェアかつ契約種別が最上位という条件があります。最上位契約のケースが一般キューへ送られる原因と修正はどれですか。",
    choices: ["最初に一致した項目で処理が止まるため最上位契約の項目を上へ移す", "最後に一致した項目が優先されるため一般条件を最下部から削除する", "両方の項目が実行されるため二つのキューを同じ公開グループにする", "割り当てルールは契約種別を評価できないため保存後フローへ置き換える"],
    answers: [0],
    explanation: `割り当てルールは項目を順番に評価し、最初に一致した項目の割り当てを適用して処理を終了します。範囲の狭い最上位契約の条件を、一般的なソフトウェア条件より上に配置します。
        ※ 最後の一致が優先されるのではないため、現在の順序では後続の最上位契約条件まで評価されません。
        ※ 一つのケースへ二つのルール項目を連続適用する動作ではなく、公開グループもキュー選択の優先順位を変更しません。
        ※ 契約種別をケース上の評価可能な項目として用意すれば割り当て条件に利用でき、必ずフローへ置き換える必要はありません。`
  },
  {
    id: 370,
    category: "サービス&サポートアプリケーション",
    source: "新方式対策 追加問題 ID370",
    question: "二人の新任担当者はケースキューのメンバーですが、Omni-Channelをオンラインにできず、作業も配信されません。同じキューの既存担当者には正常に配信され、サービスチャネルとルーティング設定は動作しています。確認すべき設定を2つ選びなさい。",
    choices: ["ケース割り当てルールの項目順序", "新任担当者が利用できるプレゼンス状況", "キューのメール通知テンプレート", "新任担当者へ割り当てたプレゼンス設定と処理容量"],
    answers: [1,3],
    explanation: `担当者がOmni-Channelで作業を受けるには、オンラインにするためのプレゼンス状況へアクセスでき、作業を受け入れられる容量を持つプレゼンス設定が割り当てられている必要があります。既存担当者には配信されるため、新任担当者固有のこの二点を優先して確認します。
        ※ ケース割り当てルールはケースをキューへ入れるところまでを制御します。既に対象キューへ入り他の担当者へ配信されるなら、今回の個人差の主因ではありません。
        ※ キューのメール通知は所有者変更時の通知方法であり、Omni-Channelのオンライン可否や容量計算を設定しません。`
  },
  {
    id: 371,
    category: "サービス&サポートアプリケーション",
    source: "新方式対策 追加問題 ID371",
    question: "ナレッジ記事が地域グループの欧州と製品グループのルーターに分類されています。利用者は欧州を参照できますが、製品グループではスイッチだけを参照できます。この利用者の記事表示はどうなりますか。",
    choices: ["欧州が一致するため記事全体を参照できる", "どちらか一つのグループが一致すれば本文だけ参照できる", "製品グループの許可も必要なため記事を参照できない", "記事所有者と同じロールであればカテゴリ設定を無視できる"],
    answers: [2],
    explanation: `複数のデータカテゴリグループで分類された記事を参照するには、利用者が各グループで記事に付いたカテゴリの少なくとも一つを参照できる必要があります。欧州は一致してもルーターを参照できないため、この記事は表示されません。
        ※ 一つのカテゴリグループだけが一致しても、記事に分類がある他のグループの可視性要件は満たされません。
        ※ 本文だけを部分表示する動作ではなく、データカテゴリ可視性により記事レコードの表示可否が決まります。
        ※ 記事所有者とのロール関係だけでデータカテゴリ可視性が無視されることはなく、適切なカテゴリ権限が必要です。`
  },
  {
    id: 372,
    category: "サービス&サポートアプリケーション",
    source: "新方式対策 追加問題 ID372",
    question: "営業時間は平日の午前9時から午後5時で、月曜日は祝日です。金曜日の午後4時30分に作成された未解決ケースを、営業時間で2時間経過した時点にエスカレーションします。予定時刻はいつですか。",
    choices: ["火曜日の午前9時30分", "月曜日の午前10時30分", "月曜日の午後6時30分", "火曜日の午前10時30分"],
    answers: [3],
    explanation: `金曜日は午後4時30分から午後5時までの30分が計測されます。月曜日は祝日のため計測されず、残り1時間30分を火曜日の午前9時から加算するので、火曜日の午前10時30分にエスカレーションします。
        ※ 火曜日の午前9時30分では合計1時間しか営業時間が経過しておらず、2時間の条件を満たしません。
        ※ 月曜日は営業時間に関連付けられた祝日のため、エスカレーション時間の計算から除外されます。
        ※ 営業時間外の経過時間は加算されないため、単純に作成時刻へ暦時間を足して月曜日の夕方にする計算ではありません。`
  },
  {
    id: 373,
    category: "生産性向上とコラボレーション",
    source: "新方式対策 追加問題 ID373",
    question: "営業担当者は一つの訪問記録を取引先と二つの商談に関連付け、画像と書式付き本文を保存し、後から以前の版へ戻せるようにします。最も適切な機能はどれですか。",
    choices: ["従来のメモと添付ファイル", "拡張メモ", "活動履歴のコメント", "Chatterのブックマーク"],
    answers: [1],
    explanation: `拡張メモはリッチテキストや画像を扱い、一つのメモを複数レコードへ関連付けられます。Lightning Experienceでは自動保存と以前のバージョンへの復元にも対応するため、訪問記録を一つに保てます。
        ※ 従来のメモは親レコードを中心とした旧機能で、拡張メモの複数レコード関連付けやLightningの版管理を提供しません。
        ※ 活動履歴はタスクや行動などを時系列で表示しますが、一つの書式付き文書を複数レコードへ関連付けて版管理する機能ではありません。
        ※ Chatterのブックマークは投稿を後から見つけるための個人操作で、訪問記録の文書や版を管理しません。`
  },
  {
    id: 374,
    category: "生産性向上とコラボレーション",
    source: "新方式対策 追加問題 ID374",
    question: "営業マネージャーは、自分が追跡している商談のフェーズと金額が変わったとき、Chatterのフォロー中フィードで更新を確認します。必要な条件を2つ選びなさい。",
    choices: ["商談でフィード追跡を有効にして対象項目を選ぶ", "商談の項目履歴管理だけを有効にする", "商談レポートを毎日購読してフィードへ転送する", "利用者が商談をフォローし、そのレコードを参照できる状態にする"],
    answers: [0,3],
    explanation: `商談オブジェクトでフィード追跡を有効にし、フェーズと金額を追跡対象にします。利用者が対象商談をフォローし、引き続きレコードアクセスを持っていれば、追跡項目の変更がフォロー中フィードへ表示されます。
        ※ 項目履歴管理は監査用の履歴関連リストやレポートへ変更を残しますが、それだけではChatterフィードの更新を生成しません。
        ※ レポート購読は指定時刻や条件でメールなどを配信する機能で、レコードのフィード追跡を代替しません。`
  },
  {
    id: 375,
    category: "生産性向上とコラボレーション",
    source: "新方式対策 追加問題 ID375",
    question: "サービス担当者には共有フォルダー内のクイックテキストが見えますが、メール作成時だけ表示され、Messagingの会話では候補に現れません。最初に修正すべき設定はどれですか。",
    choices: ["クイックテキストを公開グループの所有に変更する", "メールテンプレートをMessagingチャネルへ変換する", "クイックテキストへMessagingチャネルを追加する", "担当者の既定アプリをサービスコンソールへ変更する"],
    answers: [2],
    explanation: `クイックテキストは、設定されたチャネルでのみ利用できます。フォルダーへアクセスできても、Emailだけが選択されているメッセージはMessagingでは表示されないため、Messagingチャネルを追加します。
        ※ フォルダー共有はクイックテキストを誰が参照できるかを制御しますが、既に見えている利用者について利用可能チャネルを増やしません。
        ※ メールテンプレートとクイックテキストは別の機能であり、テンプレートの変換で既存クイックテキストのチャネルは変わりません。
        ※ 既定アプリを変えるだけでは、クイックテキストレコードに設定されたチャネル制限は解除されません。`
  },
  {
    id: 376,
    category: "生産性向上とコラボレーション",
    source: "新方式対策 追加問題 ID376",
    question: "ケースの状況を完了へ更新し、顧客へメールを送信して保存まで実行するマクロを作成します。作成者と実行者に追加で必要となる権限はどれですか。",
    choices: ["取り消せないマクロを管理する権限", "すべてのデータを変更する権限", "メールテンプレートを管理する権限", "ケース割り当てルールを管理する権限"],
    answers: [0],
    explanation: `送信や保存を行うSubmit Action命令を含むマクロは取り消せないマクロです。この種のマクロを作成、編集、実行する利用者には、取り消せないマクロを管理する権限が必要です。対象ケースやメールに対する通常のアクセスも別途必要です。
        ※ すべてのデータを変更する権限は組織全体へ及ぶ強力な権限であり、取り消せないマクロを扱うための専用要件を置き換えません。
        ※ 既存メールテンプレートを利用するだけなら、テンプレート自体を組織全体で管理する権限を必ず付与する必要はありません。
        ※ ケース割り当てルールの管理権限は所有者振り分けの設定用で、マクロの送信や保存命令の許可には関係しません。`
  },
  {
    id: 377,
    category: "生産性向上とコラボレーション",
    source: "新方式対策 追加問題 ID377",
    question: "承認済み提案書を取引先と商談の両方から参照し、内容を更新したときも一つのファイルとして管理します。後で商談との関連だけを外しても取引先側のファイルは残す必要があります。適切な方法はどれですか。",
    choices: ["同じ添付ファイルを取引先と商談へ別ファイルとしてそれぞれアップロードする", "提案書の本文を二つの拡張メモへ貼り付けて同期する", "取引先のファイルを削除して商談へ最新版を再登録する", "一つのSalesforceファイルを両レコードへ関連付ける"],
    answers: [3],
    explanation: `Salesforceファイルは一つのコンテンツを複数レコードへ関連付けられます。同じファイルへ新しいバージョンを追加すれば各関連先から最新版を参照でき、商談でレコードから削除を選んでも取引先側の関連やファイル本体は残ります。
        ※ 別々にアップロードすると独立したファイルになり、更新のたびに二つのコピーを同期する必要があります。
        ※ 拡張メモは文書メモに適していますが、承認済み提案書ファイルの版をそのまま一元管理する方法ではありません。
        ※ ファイル本体を削除すると他の関連先からも利用できなくなるため、一つのレコードとの関連だけを外す要件に反します。`
  },
  {
    id: 378,
    category: "データ管理&分析",
    source: "新方式対策 追加問題 ID378",
    question: "商談レポートは地域、営業担当者の順でグループ化されています。各担当者の商談金額合計を、その担当者が属する地域の小計に対する割合として表示します。前の担当者との比較ではなく、地域小計を分母にする機能はどれですか。",
    choices: ["PARENTGROUPVALを使うカスタム集計数式", "PREVGROUPVALを使う前グループ比較のカスタム集計数式", "地域の金額帯を作成するレポートのバケット項目", "各商談で比率を求めるレポートの行レベル数式"],
    answers: [0],
    explanation: `PARENTGROUPVALは現在のグループから親グループの集計値を参照します。担当者別の金額合計を地域小計で割るカスタム集計数式を担当者グループへ表示すると、地域内での構成比を計算できます。
        ※ PREVGROUPVALは直前のグループや期間の集計値を参照するため、親となる地域小計を分母にする機能ではありません。
        ※ バケット項目は値を範囲やカテゴリへ分類しますが、グループ小計を参照した割合を計算しません。
        ※ 行レベル数式は個々の商談行を評価するため、担当者集計から地域小計を参照する計算には適しません。`
  },
  {
    id: 379,
    category: "データ管理&分析",
    source: "新方式対策 追加問題 ID379",
    question: "取引先ごとに、未完了商談の金額合計と未解決ケース件数を別々のレポートタイプから並べ、金額を件数で割った指標も表示します。最も適切なレポート構成はどれですか。",
    choices: ["商談レポートへ取引先別ケース件数を参照する行レベル数式を追加する", "取引先レポートへ二つのバケット項目を追加する", "二つのダッシュボードを取引先名で同時に絞り込む", "取引先でグループ化した結合レポートとクロスブロック数式を使う"],
    answers: [3],
    explanation: `結合レポートでは共通する取引先で商談ブロックとケースブロックをグループ化できます。クロスブロックカスタム集計数式を使うと、一方のブロックの商談金額合計を他方のケース件数で割る計算ができます。
        ※ 商談レポートの行レベル数式は個々の商談行を計算し、別レポートタイプのケース件数を参照できません。
        ※ バケット項目は値の分類に使う機能で、異なる関連オブジェクトの集計値を計算しません。
        ※ ダッシュボードは複数の集計を可視化できますが、二つのコンポーネント間の値を行ごとに割る数式を提供しません。`
  },
  {
    id: 380,
    category: "データ管理&分析",
    source: "新方式対策 追加問題 ID380",
    question: "全営業担当者が同じダッシュボードを開き、それぞれ自分に共有された商談だけを確認します。担当者別にダッシュボードを複製せず、定期メール配信は必要ありません。使用すべき設定はどれですか。",
    choices: ["営業部長を固定実行ユーザーにしたダッシュボード", "ログインユーザーとして表示する動的ダッシュボード", "担当者名を固定したダッシュボード検索条件", "公開フォルダーに保存したレポートスナップショット"],
    answers: [1],
    explanation: `動的ダッシュボードをログインユーザーとして表示すると、同じ定義を開いた各利用者に、その利用者がアクセスできるデータだけを表示できます。利用者ごとの複製が不要で、手動表示という要件にも適合します。
        ※ 固定実行ユーザーを営業部長にすると、閲覧者は営業部長のアクセス範囲に基づく同じデータを見ることになります。
        ※ 担当者名の固定検索条件では利用者ごとに自動的に値が変わらず、手動変更や複数ダッシュボードが必要になります。
        ※ レポートスナップショットは指定時点のレポート結果をカスタムオブジェクトへ保存する機能で、閲覧者ごとの現在データ表示には使いません。`
  },
  {
    id: 381,
    category: "データ管理&分析",
    source: "新方式対策 追加問題 ID381",
    question: "月末時点の地域別パイプライン金額を履歴として保存し、後から推移をレポートします。レポートスナップショットを構成する際に必要なものを2つ選びなさい。",
    choices: ["保存先として共有レポートフォルダーを指定する", "履歴を格納するカスタムオブジェクトと互換性のある項目を用意する", "集計元レポートの抽出階層を選び集計項目を保存先へ対応付ける", "実行ユーザーをログインユーザーにする動的ダッシュボードを作成する"],
    answers: [1,2],
    explanation: `レポートスナップショットは実行結果をカスタムオブジェクトへ新しいレコードとして保存します。保存先に互換性のある項目を用意し、サマリーレポートでは地域などの抽出階層を選んで、その階層の集計項目を保存先へ対応付けます。
        ※ レポートフォルダーは元レポートを保存し共有する場所であり、月次結果レコードの保存先にはなりません。
        ※ 動的ダッシュボードは閲覧者のアクセス範囲で現在値を表示する機能で、月末値を履歴データとして蓄積しません。`
  },
  {
    id: 382,
    category: "データ管理&分析",
    source: "新方式対策 追加問題 ID382",
    question: "昨日誤って削除した数千件の取引先責任者を、ごみ箱の保持期間内に一括復元します。削除済みレコードのIDを取得して復元処理へ渡す最も適切な方法はどれですか。",
    choices: ["通常のデータエクスポートで削除済みレコードを抽出してInsertする", "データインポートウィザードで同じメールアドレスのレコードを追加する", "データローダーのExport AllでIDを取得してWorkbenchでUndeleteする", "重複ジョブで削除済みレコードセットを作成してMergeする"],
    answers: [2],
    explanation: `データローダーのExport Allは削除済みレコードを含めて抽出でき、IsDeletedなどで対象を絞ってIDを取得できます。そのID一覧をWorkbenchのUndelete操作へ渡せば、ごみ箱の保持期間内に一括復元できます。
        ※ 設定画面の定期データエクスポートにはごみ箱内データが含まれず、Insertすると元レコードの復元ではなく新規レコードになります。
        ※ データインポートウィザードで追加すると新しいIDが作成され、元レコードの関係や履歴を復元できません。
        ※ 重複ジョブは有効なデータ内の重複候補を検出する機能で、ごみ箱のレコードを復元する操作を提供しません。`
  },
  {
    id: 383,
    category: "データ管理&分析",
    source: "新方式対策 追加問題 ID383",
    question: "カスタムオブジェクトの重複候補を既存データ全体から検出するため重複ジョブを実行しました。結果画面で標準取引先と同じように候補を比較して統合できません。正しい説明はどれですか。",
    choices: ["重複ジョブは新規保存時だけ動作し既存レコードを検査しない", "カスタムオブジェクトでは一致ルールを作成できない", "結果の公開リストビューを共有すれば候補レコードが自動的に統合される", "カスタムオブジェクトは重複検出できるが比較と統合には対応しない"],
    answers: [3],
    explanation: `重複ジョブはカスタムオブジェクトでも一致ルールに基づいて既存レコードを走査し、重複レコードセットを作成できます。ただしカスタムオブジェクトの候補を標準画面で比較して統合する機能はサポートされません。
        ※ 保存時だけでなく、重複ジョブは既存データを一括走査するために使用できます。
        ※ カスタム一致ルールはカスタムオブジェクトにも作成でき、重複ジョブの検出条件として利用できます。
        ※ 結果のリストビューは候補を一覧化しますが、レコードの統合処理を自動的に実行しません。`
  },
  {
    id: 384,
    category: "データ管理&分析",
    source: "新方式対策 追加問題 ID384",
    question: "外部商品システムから毎晩同じ商品コードを含むファイルを受け取ります。初回は製品を作成し、翌日以降は同じコードの製品を更新し、Salesforce内でコードの重複も禁止します。必要な設定を2つ選びなさい。",
    choices: ["商品コード項目を外部IDかつ一意に設定する", "商品コードを照合項目としてUpsertを実行する", "製品名を照合して毎回Insertを実行する", "Salesforce IDが空の行だけをUpdateで処理する"],
    answers: [0,1],
    explanation: `商品コードを一意の外部IDにすると、外部システムのキーとして照合でき、Salesforce内で同じコードの重複も防げます。その項目を指定したUpsertは一致する製品を更新し、一致しないコードを新規作成します。
        ※ 製品名は変更や表記差が起こり得る業務名称で、安定した外部キーではありません。Insertを繰り返すと重複製品も作成されます。
        ※ Updateは既存のSalesforce IDなどによる対象特定が必要で、IDが空の新規行を作成する処理にはなりません。`
  },
  {
    id: 385,
    category: "データ管理&分析",
    source: "新方式対策 追加問題 ID385",
    question: "すべての取引先を一覧にし、現在未解決ケースがある取引先と一件もない取引先を同じレポートで比較します。レポートの基礎データ集合を定義する方法はどれですか。",
    choices: ["取引先を主としてケースの有無を含むカスタムレポートタイプを作る", "ケースを主とする標準レポートへ取引先単位のクロス集計を追加する", "取引先の共有設定を公開にしてケースレポートを実行する", "ケースがない取引先へ空のケースレコードを一件ずつ作成する"],
    answers: [0],
    explanation: `取引先を主オブジェクトにしたカスタムレポートタイプで、関連ケースが存在する場合も存在しない場合も取引先を含める関係を選択します。その上でケース状況を利用して未解決の有無を分析できます。
        ※ ケースを主にするとケースが一件もない取引先は元のデータ集合に現れず、集計を追加しても復元できません。
        ※ 共有設定は利用者が参照できるレコード範囲を変えますが、ケースのない取引先をケース中心のレポートへ追加しません。
        ※ 分析のために架空のケースを作ると業務データを汚し、ケース件数やサービス指標も不正確になります。`
  },
  {
    id: 386,
    category: "データ管理&分析",
    source: "新方式対策 追加問題 ID386",
    question: "現在進行中の商談が一件もない取引先だけを抽出します。成立済みや不成立の商談が存在する取引先は、進行中商談がなければ結果へ含めます。使用すべきレポート条件はどれですか。",
    choices: ["取引先に商談ありを指定して成立フラグを真で絞る", "取引先に商談なしを指定して商談の完了フラグを偽で絞る", "取引先ごとの進行中商談件数がゼロという行レベル数式列を作る", "商談レポートを完了フラグが偽以外という条件で絞る"],
    answers: [1],
    explanation: `取引先に対する商談なしのクロス条件へ、商談の完了フラグが偽というサブ条件を設定します。これにより進行中商談が存在しない取引先を抽出し、完了商談だけを持つ取引先も結果へ含められます。
        ※ 商談ありの条件では進行中商談を持つ取引先を抽出することになり、求める集合と逆になります。
        ※ 行レベル数式はレポートに存在する各行を評価しますが、関連商談が存在しないことを取引先行から検索する機能ではありません。
        ※ 商談を主とするレポートでは商談がない取引先を表示できず、完了商談だけの取引先を意図どおり判定できません。`
  },
  {
    id: 387,
    category: "自動化",
    source: "新方式対策 追加問題 ID387",
    question: "商談を成立へ変更する際、参照関係で紐づく導入チェックレコードを確認します。未完了レコードが一件でもあれば、商談の変更を取り消し、利用者へ具体的なエラーを表示します。商談側に集計用項目はありません。最も適切な実装はどれですか。",
    choices: ["保存前フローで関連レコードを取得してフェーズを元へ戻す", "保存後フローのスケジュール済みパスで警告通知を送信する", "保存後フローで関連レコードを取得してカスタムエラーを使う", "入力規則で参照関係の子レコードを直接検索して保存を拒否する"],
    answers: [2],
    explanation: `保存後のレコードトリガーフローで関連レコードを検索し、未完了レコードが見つかった経路でカスタムエラーを実行します。カスタムエラーはトリガーとなった変更をロールバックし、利用者へ原因を示すメッセージを表示できます。
        ※ フェーズを元へ戻すだけでは保存処理を明確なエラーとして拒否できず、利用者へ修正理由を直接伝える構成にもなりません。
        ※ スケジュール済みパスは保存後の将来時点で実行されるため、不正な変更を保存時点で取り消せません。
        ※ 入力規則の数式は参照関係の子レコード集合を直接検索できず、集計項目がない今回の条件を評価できません。`
  },
  {
    id: 388,
    category: "自動化",
    source: "新方式対策 追加問題 ID388",
    question: "取引先の保存後フローAが関連する審査サマリーレコードを作成し、同じ保存後フローBがそのレコードを取得して審査タスクを作成します。実行順が一定せず結果が変わります。宣言的に順序を管理する方法はどれですか。",
    choices: ["両フローへ異なるトリガー順序値を設定する", "フロー名の先頭へ実行したい番号だけを付ける", "フローAを保存前に変更して審査サマリーも作成する", "フローBを毎晩のスケジュールトリガーフローへ変更する"],
    answers: [0],
    explanation: `同じオブジェクトで同じ種類のレコードトリガーフローにはトリガー順序値を設定できます。Flow Trigger Explorerから順序を管理し、フローAの値をフローBより小さくすると同じ保存後区分内で先に実行できます。
        ※ API名のアルファベット順が使われるのは同じ順序値など特定の場合であり、名前だけに依存した順序制御は明示性と保守性が低くなります。
        ※ 保存前フローは同じレコードの高速更新には適しますが、関連タスクを作成できないため、処理をそのまま移せません。
        ※ 夜間処理へ変更すると保存直後に審査タスクを作る要件を満たさず、順序問題のために不要な遅延を導入します。`
  },
  {
    id: 389,
    category: "自動化",
    source: "新方式対策 追加問題 ID389",
    question: "契約終了日の30日前に更新タスクを作るスケジュール済みパスがあります。終了日を将来の別日に変更した場合と、契約を解約済みに変更して開始条件を満たさなくした場合の動作はどれですか。",
    choices: ["元の予定は残り、新しい終了日にも二つ目の処理が追加される", "終了日変更では再予約され、開始条件を外れると保留中の処理は取り消される", "一度予約された処理はフローを無効化するまで変更も取消しもできない", "終了日変更では取消されるが、開始条件を外れても元の処理は必ず実行される"],
    answers: [1],
    explanation: `時刻源となる将来の日付が変更され、条件を満たしたままであればスケジュール済みパスは新しい時刻へ再予約されます。レコード更新によって開始条件が偽になれば、まだ実行されていない保留中の処理は取り消されます。
        ※ 日付変更時に古い予定と新しい予定を無条件に二重保持する動作ではなく、現在の条件と時刻源に基づいて予定が管理されます。
        ※ 保留処理はレコード更新やフローの有効状態の影響を受けるため、一度予約したら変更不能ということはありません。
        ※ 開始条件を満たさなくなったレコードへ古い処理を必ず実行すると、解約済み契約にも更新タスクを作ることになり要件に反します。`
  },
  {
    id: 390,
    category: "自動化",
    source: "新方式対策 追加問題 ID390",
    question: "レコードトリガーフローをデバッグすると成功しますが、サンドボックスで実際に保存すると別の自動化との組み合わせで失敗します。デバッグ実行に関する正しい説明はどれですか。",
    choices: ["デバッグでは有効な全フローとApexが本番と同じ順序で実行される", "デバッグで作成したレコードは終了後も確認用として保存される", "ロールバックを解除すると他の全レコードトリガーフローも検証できる", "レコードトリガーフローのデバッグはロールバックされ対象フローだけを実行する"],
    answers: [3],
    explanation: `レコードトリガーフローのデバッグは常にロールバックモードで行われ、データベース変更は残りません。またデバッグ対象のフローだけが実行されるため、他のトリガーフローやプロセスとの相互作用はサンドボックスで実保存して確認する必要があります。
        ※ デバッグは本番の注文実行全体を完全再現せず、他のレコードトリガー自動化が実行されないことがあります。
        ※ デバッグ中の作成や更新は終了時にロールバックされるため、検証用レコードとして永続化されません。
        ※ レコードトリガーフローではロールバックを解除する選択はできず、それによって他の自動化を一括実行することもできません。`
  },
  {
    id: 391,
    category: "自動化",
    source: "新方式対策 追加問題 ID391",
    question: "画面フローで数量と単価を入力すると、次へ進む前に同じ画面上の見積金額を即時更新します。利用者に再計算ボタンを押させず、画面も増やしません。使用すべき機能はどれですか。",
    choices: ["リアクティブな画面コンポーネントと数式", "入力中の値を保存してから起動する保存後レコードトリガーフロー", "スケジュール済みパスと数式項目", "承認プロセスの初回申請アクション"],
    answers: [0],
    explanation: `画面フローのリアクティブ機能では、対応する入力コンポーネントの値が変わったときに、同じ画面上の数式や表示コンポーネントをリアルタイムで更新できます。画面遷移や保存を挟まず見積金額を示せます。
        ※ レコードトリガーフローはレコードの保存を契機にバックグラウンドで動作し、編集中の同じ画面を即時更新しません。
        ※ スケジュール済みパスは将来時点の処理であり、入力中の画面に対するリアルタイム計算には使いません。
        ※ 承認プロセスは承認経路と判断を管理する機能で、画面上の入力値に反応する計算を提供しません。`
  },
  {
    id: 392,
    category: "自動化",
    source: "新方式対策 追加問題 ID392",
    question: "フローで取得した注文明細コレクションから取消済みを除外し、残った各明細を請求明細レコードの構造へ対応付けます。ループ内で一件ずつ代入しない構成はどれですか。",
    choices: ["Transform要素だけで取消済みの除外と並べ替えまで行う", "元コレクションをレコード選択肢セットへ変換して保存する", "コレクション検索条件で絞った後にTransform要素で項目を対応付ける", "各明細から画面フローを起動して請求明細を一件ずつ作る"],
    answers: [2],
    explanation: `Transform要素はコレクションの各項目を別のデータ構造へまとめて対応付けられますが、コレクションの絞り込みや並べ替えは行いません。先にコレクション検索条件で取消済みを除外し、その結果をTransformで請求明細構造へ変換します。
        ※ Transform要素の変換内ではコレクションのフィルターや並べ替えを実行できないため、除外処理を別要素で行う必要があります。
        ※ レコード選択肢セットは画面にレコード候補を表示するためのリソースで、コレクションを別オブジェクト構造へ一括変換しません。
        ※ 明細ごとに画面フローを起動すると利用者操作とトランザクションが増え、一括変換という要件に反します。`
  },
  {
    id: 393,
    category: "自動化",
    source: "新方式対策 追加問題 ID393",
    question: "既存のClassic承認プロセスへ、高額商談を保存後フローから自動申請します。申請者と対象プロセスを指定し、承認履歴へ申請を作成するために使用するアクションはどれですか。",
    choices: ["フロー承認プロセスを呼び出す承認を要求アクション", "レコードをロックするコアアクション", "承認作業項目を更新するレビューアクション", "Classic承認用の承認申請アクション"],
    answers: [3],
    explanation: `承認申請アクションは一件のSalesforceレコードを既存のClassic承認プロセスへ提出します。レコードID、承認プロセス名またはID、申請者IDなどを渡し、承認申請を作成できます。
        ※ 承認を要求アクションは有効なフロー承認プロセスを非同期で呼び出す機能で、Classic承認プロセスへの申請には使用しません。
        ※ レコードのロックは承認中の編集制御に利用できますが、それだけでは承認申請や作業項目を作成しません。
        ※ レビューアクションは既に存在する承認作業項目を承認または却下する用途で、新しい申請を開始する機能ではありません。`
  },
  {
    id: 394,
    category: "自動化",
    source: "新方式対策 追加問題 ID394",
    question: "夜間に実行するフローが外部アクションまたはレコード更新で失敗した場合、後続の通常処理へ進めず、運用チームが対象レコードと失敗理由を調査できるようにします。実装すべき内容を2つ選びなさい。",
    choices: ["失敗する可能性がある要素をすべてループ内へ移動する", "管理者のデバッグ画面を本番障害の履歴として利用する", "失敗し得る要素から障害パスを接続する", "障害メッセージと対象IDを記録して運用チームへ通知する"],
    answers: [2,3],
    explanation: `データ操作や外部アクションなど失敗し得る要素へ障害パスを接続すると、通常経路と障害処理を分離できます。障害パスで障害メッセージ、対象レコードID、実行時刻などを記録し通知すれば、夜間処理でも原因を追跡できます。
        ※ ループ内への移動は障害処理を追加せず、データ操作回数を増やして別の制限に達しやすくする可能性があります。
        ※ デバッグ画面は設計時の実行確認であり、無人で行われる本番フローの障害を継続保存する監視台帳にはなりません。`
  },
  {
    id: 395,
    category: "自動化",
    source: "新方式対策 追加問題 ID395",
    question: "スケジュールトリガーフローで数千件の期限切れケースを取得し、各ケースの状況と処理日を変更します。データ操作回数を抑える設計はどれですか。",
    choices: ["ループの各周回で現在のケースを個別更新する", "ループで値を設定したコレクションを終了後に一括更新する", "ケースごとに別の画面フローを起動して保存する", "ループの各周回で条件に合う期限切れケース全体をもう一度取得する"],
    answers: [1],
    explanation: `取得したケースをループで処理するときは、各レコードの値を設定して更新用コレクションへ集め、ループ終了後に一回のレコード更新へ渡します。これによりデータ操作回数を抑え、大量レコードへ対応しやすくなります。
        ※ ループ内で個別更新すると周回数に応じてデータ操作が増え、ガバナ制限や処理時間の問題を起こしやすくなります。
        ※ 画面フローは利用者との対話用であり、夜間の大量処理をケースごとに分割する用途には適しません。
        ※ 同じ対象集合を各周回で再取得するとクエリ回数と処理量が増え、一貫したスナップショットも扱いにくくなります。`
  },
  {
    id: 396,
    category: "Agentforce",
    source: "新方式対策 追加問題 ID396",
    question: "注文取消アクションは注文レコードを更新します。トピック指示に実行前の確認を記載しましたが、テストでは確認なしに実行される場合があります。利用者の明示的な承認なしにはアクションを開始できないようにする設定はどれですか。",
    choices: ["アクション出力を会話に表示する設定を有効にする", "アクション入力を利用者から収集する設定にする", "カスタムアクションで利用者の確認を必須にする", "トピック指示に確認文を追加して推論へ判断を任せる"],
    answers: [2],
    explanation: `カスタムアクションの利用者確認を必須にする設定では、レコードを変更するアクションの実行前に利用者へ確認を要求できます。自然言語の指示だけに依存せず、アクションの実行条件として確認を強制できます。
        ※ 会話への表示設定はアクションの出力方法を制御し、実行前の承認を要求しません。
        ※ 利用者からの入力収集は不足するパラメーターを取得しますが、その値の入力が処理実行への同意を意味するとは限りません。
        ※ トピック指示は推論を導く情報ですが、確認を必須とするアクション設定と同じ強制力を持ちません。`
  },
  {
    id: 397,
    category: "Agentforce",
    source: "新方式対策 追加問題 ID397",
    question: "信用審査アクションは、エージェントが後続判断に使う内部スコアと、顧客へ説明する審査結果を返します。内部スコアは推論には含めますが、そのまま会話へ表示してはいけません。内部スコア出力の設定を2つ選びなさい。",
    choices: ["エージェントコンテキストへ含める設定を有効にする", "利用者の確認を必須にする設定を有効にする", "会話に表示する設定を無効にする", "利用者からデータを収集する設定を有効にする"],
    answers: [0,2],
    explanation: `出力をエージェントコンテキストへ含めると、推論エンジンは内部スコアを後続の判断に利用できます。その出力の会話への表示を無効にすれば、値を直接顧客へ提示せず、別の審査結果を使って自然な回答を構成できます。
        ※ 利用者確認は変更系アクションの実行前に同意を求める設定で、戻り値を推論だけに利用する可視性制御ではありません。
        ※ 利用者からデータを収集する設定はアクション入力に関するもので、アクションが返した内部出力の表示範囲を制御しません。`
  },
  {
    id: 398,
    category: "Agentforce",
    source: "新方式対策 追加問題 ID398",
    question: "返品作成アクションは、本人確認済みで返品期限内の場合だけエージェントが利用できる必要があります。利用者が指示を誘導しても条件外では実行候補に現れないようにする設計はどれですか。",
    choices: ["確認状態と期限を評価するアクション利用条件を設定する", "トピック指示に本人確認済みかつ期限内の場合だけ使うと詳しく記載する", "返品アクションの出力を会話へ表示しないようにする", "返品フローをシステム管理者の権限で常に実行する"],
    answers: [0],
    explanation: `アクションの利用条件で本人確認状態と返品期限を評価し、条件外では推論エンジンからアクション自体を利用不能にします。高リスク操作の境界は、指示だけでなく利用可能性を制御する条件として実装するのが適切です。
        ※ トピック指示は判断を導きますが、利用可能なアクションを推論が選択する余地を完全には排除しないため、強制条件の代わりになりません。
        ※ 出力を会話へ表示しない設定は実行結果の見せ方だけを変え、条件外でのアクション実行を防ぎません。
        ※ 強い実行権限を与えるとアクセス範囲が広がるだけで、本人確認や期限という業務条件を強制できません。`
  },
  {
    id: 399,
    category: "Agentforce",
    source: "新方式対策 追加問題 ID399",
    question: "注文検索アクションには注文番号が必要です。会話に注文番号がない場合はエージェントが利用者へ質問し、値を取得するまでアクションを実行してはいけません。入力パラメーターに設定すべき内容を2つ選びなさい。",
    choices: ["出力を会話に表示する設定", "入力を必須にする設定", "出力をエージェントコンテキストへ含める設定", "利用者から入力値を収集する設定"],
    answers: [1,3],
    explanation: `注文番号の入力を必須にすると、値がない状態ではアクションを実行できません。利用者から入力値を収集する設定を併用すると、会話から値を得られない場合にエージェントが利用者へ注文番号を尋ねられます。
        ※ 出力を会話へ表示する設定は検索後の結果をどう見せるかに関係し、実行前の注文番号を収集しません。
        ※ 出力をエージェントコンテキストへ含める設定は戻り値を後続推論へ利用するもので、必須入力の欠落を解決しません。`
  },
  {
    id: 400,
    category: "Agentforce",
    source: "新方式対策 追加問題 ID400",
    question: "注文状況を参照するアクションと配送先を変更するアクションの名前と説明が似ており、参照依頼でも変更アクションが選ばれます。トピック分類は正しく、各基盤フローも単体では正常です。最初に行う改善はどれですか。",
    choices: ["二つのアクションを一つの管理者権限フローへ統合する", "各アクションの目的と使用条件と入力指示を明確に分けて再テストする", "トピックの対象範囲をすべての注文関連依頼へ拡大する", "変更アクションの全出力を会話へ直接表示する"],
    answers: [1],
    explanation: `推論エンジンはアクション名、説明、入力指示、トピック指示、会話コンテキストを使って利用するアクションを選びます。参照と更新の目的、使う場面、必要入力を重ならない表現で明確にし、代表発話で選択結果を再テストします。
        ※ 二つの処理を一つへ統合すると参照と更新の境界が曖昧になり、不要な更新処理を選ぶリスクをさらに高めます。
        ※ トピックは既に正しく選ばれているため、対象範囲を広げてもトピック内のアクション選択の曖昧さは解消しません。
        ※ 出力の表示設定はアクション実行後の応答に影響しますが、どちらのアクションを選ぶかという事前判断を改善しません。`
  },
{
    id: 401,
    category: "設定とセットアップ",
    source: "新方式対策 高難度追加問題 ID401",
    question: "サービス担当者は共有モデル上すべてのケースを参照できます。通常は自分の地域だけをリストビューとレポートの既定範囲に表示したい一方、応援対応時には検索して他地域のケースも開ける必要があります。レコードアクセス自体は狭めません。最も適切な設定はどれですか。",
    choices: [
      "地域別のスコーピングルールを作成し範囲フィルターを既定で適用する",
      "地域別の制限ルールを作成し検索を含む他地域レコードへのアクセスを除外する",
      "地域別の公開リストビューを作成しレポートとSOQLにも同じ条件を継承させる",
      "地域別の条件ベース共有ルールを作成し既存アクセスを地域内レコードへ縮小する"
    ],
    answers: [0],
    explanation: `スコーピングルールは、利用者が既に参照できるレコードを失わせず、リストビュー、レポート、SOQLで通常注目する範囲を絞る機能です。利用者は必要に応じて範囲外を検索したり、スコープを使わない表示へ切り替えたりできるため、日常の集中と応援対応の両方を満たします。
        ※ 制限ルールは共有設定で得た参照範囲を恒久的にさらに狭めます。他地域のケースを検索して開く要件に反します。
        ※ リストビューの条件はそのビューだけに作用します。レポートやSOQLへ自動継承されず、利用者が別のビューを選べば既定の集中範囲にもなりません。
        ※ 共有ルールはアクセスを追加する機能です。既に参照できるレコードを地域内だけへ縮小したり、表示上のスコープを設定したりはできません。`
  },
  {
    id: 402,
    category: "設定とセットアップ",
    source: "新方式対策 高難度追加問題 ID402",
    question: "内部ユーザーのケース共有は公開参照更新のまま維持します。ロールを持たない高ボリュームのExperience Cloud利用者には、自分の利用者レコードに結び付く取引先のケースだけを参照させます。利用者ごとの個別共有は避けます。適切な構成はどれですか。",
    choices: [
      "内部アクセスを非公開へ下げて外部利用者を取引先所有者の配下ロールへ置く",
      "外部アクセスを非公開にし利用者の取引先とケースの取引先を対応付ける共有セットを使う",
      "ケースの参照権限を付与し取引先IDを使うリストビューを各利用者へ配布する",
      "外部アクセスを公開参照にし別取引先のケースを利用者別の制限ルールで一件ずつ除外する"
    ],
    answers: [1],
    explanation: `外部組織の共有設定を非公開にすると、内部の公開参照更新を変えずに外部利用者の基準アクセスだけを厳しくできます。共有セットは高ボリューム外部利用者の取引先または取引先責任者と、対象レコード側の対応項目を照合してアクセスを付与できるため、利用者ごとの共有行を作らず要件を満たします。
        ※ 高ボリューム外部利用者はロールを持たない設計です。内部共有を非公開へ下げると全社員へ不要な影響も及びます。
        ※ オブジェクト参照権限とリストビューは、開けるレコード範囲を取引先単位で保護しません。URL、検索、APIなど別経路からの参照を防げません。
        ※ 外部アクセスを公開参照にすると全ケースが基準アクセスになります。利用者ごとの関係を大量の制限条件で後から閉じる設計は目的と拡張性の両方に合いません。`
  },
  {
    id: 403,
    category: "設定とセットアップ",
    source: "新方式対策 高難度追加問題 ID403",
    question: "財務担当者は通常レポートを参照できますが、エクスポートは既存の本人確認手順によって高保証セッションになった後、そのログインセッション中だけ許可します。翌日の再ログインでは再度確認が必要です。必要な構成を2つ選びなさい。",
    choices: [
      "セッションの有効化を必要とする権限セットへレポートエクスポート権限を分離する",
      "本人確認後にセッションベース権限セットを有効化する画面フローを実行させる",
      "権限セットグループへ恒久的に権限を追加しログイン時間で使用時間帯だけを制限する",
      "組織の信頼済みIP範囲へ接続元を追加しエクスポート権限を自動付与する"
    ],
    answers: [0, 1],
    explanation: `セッションベース権限セットでは、権限セットを利用者へ割り当てておいても、有効化アクションが実行された現在のセッションだけ権限が有効になります。エクスポート権限をその権限セットへ分離し、既存の高保証確認が成功した経路の後で画面フローから有効化すれば、再ログイン時には自動で失効します。
        ※ 権限セットグループへの通常の割り当てはセッションをまたいで残ります。ログイン時間はログイン可能な曜日と時刻を制御するもので、利用中の特定権限だけを一時化しません。
        ※ 信頼済みIP範囲は本人確認要求を軽減するためのネットワーク設定です。接続元に応じてレポートエクスポート権限を付与する仕組みではありません。`
  },
  {
    id: 404,
    category: "設定とセットアップ",
    source: "新方式対策 高難度追加問題 ID404",
    question: "請求担当者用の権限セットグループで請求書の削除権限をミュートしました。しかし全担当者が共通で使う基準プロファイルにも削除権限があり、利用者は削除を続けられます。例外の監督者だけには削除を許可します。最小権限へ直す方法はどれですか。",
    choices: [
      "グループを再計算してプロファイル由来の削除権限もミュート結果へ取り込む",
      "同じグループへ二つ目のミュート権限セットを加えて削除拒否を重ねて適用する",
      "基準プロファイルから削除を外し監督者だけへ独立した権限セットで付与する",
      "請求書の組織の共有設定を非公開にして所有者以外の削除操作を一律に止める"
    ],
    answers: [2],
    explanation: `ミュート権限セットが打ち消せるのは、同じ権限セットグループ内の権限セットから集約された権限です。プロファイルやグループ外の権限セットが与えた権限は減算できません。削除を基準プロファイルから外し、職務上必要な監督者だけへタスク単位の権限セットで追加するのが最小権限です。
        ※ 再計算はグループ構成の変更を反映しますが、プロファイルの権限をグループ由来へ変換したり取り消したりしません。
        ※ ミュート設定を重ねても対象範囲はグループ内のままです。権限は拒否より付与が加算されるため、プロファイルの削除権限が残ります。
        ※ 組織の共有設定はレコード単位の参照と更新範囲を決めます。所有レコードへの削除を含むオブジェクト権限そのものを取り消しません。`
  },
  {
    id: 405,
    category: "設定とセットアップ",
    source: "新方式対策 高難度追加問題 ID405",
    question: "東日本の運用責任者に、東日本ロール以下の利用者だけの作成、パスワードリセット、ロック解除を任せます。割り当て可能なプロファイルと権限セットも指定済みのものに限定し、権限定義そのものの編集は許可しません。最も適切な構成はどれですか。",
    choices: [
      "運用責任者を東日本ロールの最上位へ置きすべてのユーザー管理権限を付与する",
      "東日本利用者をキューへ登録し運用責任者をそのキューのマネージャーに指定する",
      "公開グループへ東日本利用者を集め権限セット割り当て権限だけを直接付与する",
      "リセット権限を付けた委任管理者へ管理対象ロールと割り当て可能項目を限定する"
    ],
    answers: [3],
    explanation: `委任管理では、管理対象とするロールおよび下位ロール、割り当て可能なプロファイル、権限セット、権限セットグループを明示して、限定的なユーザー管理を委任できます。パスワードリセットとロック解除には対応するシステム権限も必要なため、それだけを運用責任者へ付けたうえで委任範囲を限定します。委任管理者は権限セット自体を変更できず、要件に一致します。
        ※ ロール階層は主にレコードアクセスを扱います。広範なユーザー管理権限を直接付けると東日本以外にも操作範囲が及び、委任範囲を強制できません。
        ※ キューは作業レコードの所有と分配に使います。キューマネージャーという設定で利用者アカウントを管理することはできません。
        ※ 公開グループは共有先をまとめる機能です。割り当て権限を直接与えるだけでは対象利用者や割り当て可能な権限セットを東日本用に制限できません。`
  },
  {
    id: 406,
    category: "設定とセットアップ",
    source: "新方式対策 高難度追加問題 ID406",
    question: "審査案件カスタムオブジェクトは非公開です。審査要否が真の案件は常に審査公開グループへ参照共有し、担当変更で所有者が替わってもアクセスを維持します。所有者が案件ごとに手動共有する運用は認めません。最適な方法はどれですか。",
    choices: [
      "審査要否を条件とする共有ルールで審査公開グループへ参照権限を付与する",
      "案件作成時に所有者が審査担当者を選んで手動共有行を追加する運用にする",
      "審査公開グループを取引先チームの既定メンバーとして全案件へ自動追加する",
      "審査担当者を所有者より上位のロールへ置き階層で全案件を参照可能にする"
    ],
    answers: [0],
    explanation: `条件ベース共有ルールは所有者ではなくレコード項目を評価し、審査要否が真である限り公開グループへアクセスを付与します。所有者の変更時にも共有条件が再評価されるため、担当変更と独立して一貫したアクセスを維持できます。
        ※ 手動共有は案件ごとの判断に適しますが、操作漏れが生じ、所有者変更に伴って手動共有が失われる場合もあるため永続的な要件に合いません。
        ※ 取引先チームは取引先と関連レコード向けの機能で、任意の審査案件カスタムオブジェクトへ条件付きで適用する共有機構ではありません。
        ※ 上位ロールへ置くと審査要否が偽の案件も階層アクセスの対象になります。条件を満たす案件だけという境界を表現できません。`
  },
  {
    id: 407,
    category: "設定とセットアップ",
    source: "新方式対策 高難度追加問題 ID407",
    question: "同じ契約オブジェクトに、地域で絞る制限ルールと機密区分で絞る制限ルールを有効化しました。ある利用者は両方のユーザー条件を満たします。この設計について正しい説明を2つ選びなさい。",
    choices: [
      "二つのレコード条件は自動的に論理積で評価され両方を満たす契約だけが残る",
      "二つのレコード条件は自動的に論理和で評価されどちらかを満たす契約が残る",
      "Salesforceは重複適用を検証せず該当する有効ルールの一つだけが観測される",
      "一つの利用者へ同一オブジェクトの有効な制限またはスコーピングルールが一つだけ該当するよう直す"
    ],
    answers: [2, 3],
    explanation: `同一オブジェクトで一人の利用者が複数の制限ルールまたはスコーピングルールのユーザー条件を満たす構成は避ける必要があります。Salesforceは重複を保存時に検証せず、複数が該当しても一つだけが観測されます。ユーザー条件を排他的にするか、必要な条件を一つのルールへ統合します。
        ※ 複数ルールが自動で論理積になる保証はありません。両方で絞られる前提は、機密契約を意図せず表示する危険があります。
        ※ 複数ルールが自動で論理和になる保証もありません。どちらか一方の範囲を足し合わせる共有ルールのような動作ではありません。`
  },
  {
    id: 408,
    category: "設定とセットアップ",
    source: "新方式対策 高難度追加問題 ID408",
    question: "既存のユーザーライセンスでは含まれない有償機能を使う権限セットを作成しました。対象者へ割り当てると必要なライセンスがないというエラーになります。対象機能の権利は購入済みで、他の権限は増やしません。必要な対応はどれですか。",
    choices: [
      "対象者のプロファイルをシステム管理者から複製したプロファイルへ変更する",
      "対応する権限セットライセンスと機能権限を含む権限セットの両方を割り当てる",
      "権限セットグループでライセンス対象オブジェクトをミュートしてから割り当てる",
      "対象機能のレコードを所有するキューへ利用者を追加してライセンス確認を回避する"
    ],
    answers: [1],
    explanation: `権限セットライセンスはユーザーライセンスの機能上限を拡張する権利を与え、権限セットはその上限内で実際に使える権限を付与します。対象機能を使うには原則として両方が必要です。購入済みの権限セットライセンスを利用者へ割り当てたうえで、必要最小限の機能権限を持つ権限セットを割り当てます。
        ※ 高権限プロファイルを複製しても、ライセンスで許可されていない機能を利用可能にはできず、不要な権限も増えます。
        ※ ライセンス対象権限をミュートすると割り当てエラーを避けられる場合があっても、目的の有償機能自体を使えなくするため要件を満たしません。
        ※ キューはレコード所有と作業分配の仕組みです。機能ライセンスや権限セットの割り当て検証には影響しません。`
  },
  {
    id: 409,
    category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
    source: "新方式対策 高難度追加問題 ID409",
    question: "請求書には取引先の現在の信用ランクを常に表示します。同時に、請求書が承認された時点の信用ランクも監査用に固定保存し、後で取引先のランクが変わっても過去値を変えません。最も適切なデータ設計はどれですか。",
    choices: [
      "現在値用と承認時点用の二つのクロスオブジェクト数式項目を請求書に作成する",
      "取引先の項目履歴を有効化し請求書には一つの信用ランク数式だけを配置する",
      "現在値はクロスオブジェクト数式で表示し承認時に別の保存項目へ値をコピーする",
      "請求書を主オブジェクトにした積み上げ集計で取引先の信用ランクを二回集計する"
    ],
    answers: [2],
    explanation: `クロスオブジェクト数式は参照先の現在値を保存時ではなく表示時に評価するため、現在ランクの表示に適します。承認時点の値は通常項目へフローなどでコピーして永続化します。現在値と時点値を異なる性質の項目へ分けることで、更新追従と監査スナップショットを同時に満たせます。
        ※ 二つとも数式にすると、取引先のランク変更後に承認時点用の表示も新しい値へ変わり、履歴証跡になりません。
        ※ 項目履歴から変更履歴は調査できますが、各請求書の承認時点値を直接保持しません。請求書単位の参照やレポートも複雑になります。
        ※ 積み上げ集計は主従関係の明細値を件数や合計などへ集約する機能です。親のテキスト値を子へ複製したり時点保存したりできません。`
  },
  {
    id: 410,
    category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
    source: "新方式対策 高難度追加問題 ID410",
    question: "障害レコードの調査メモは、標準編集画面を使う重大障害レコードタイプの利用者だけ入力必須にします。連携APIは重大障害でも調査メモを空のまま作成でき、通常障害レコードタイプにも必須化しません。最小構成はどれですか。",
    choices: [
      "調査メモを項目定義で必須にしてすべての保存経路で空値を拒否する",
      "重大障害を条件にした入力規則を作成してAPIを含む全利用者へ適用する",
      "調査メモを動的フォームで条件表示するだけにして入力必須は設定しない",
      "重大障害に割り当てるページレイアウト上だけ調査メモを必須にする"
    ],
    answers: [3],
    explanation: `ページレイアウト上の必須設定は、そのレイアウトを使う標準ユーザーインターフェースでの入力だけを要求し、API更新には適用されません。重大障害レコードタイプと対象プロファイルへ専用レイアウトを割り当てれば、通常障害と連携を妨げずに画面利用者だけへ必須化できます。
        ※ 項目定義の必須設定は普遍的な必須となり、API、インポート、自動化を含むすべての保存経路で値を要求するため連携要件に反します。
        ※ 入力規則も通常はAPIを含む保存処理へ適用されます。連携用の明示的な除外を追加しない選択肢なので、空値作成を許す要件を満たしません。
        ※ 条件表示は項目をいつ見せるかを制御しますが、値の入力を強制しません。表示されたまま空で保存できてしまいます。`
  },
  {
    id: 411,
    category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
    source: "新方式対策 高難度追加問題 ID411",
    question: "既存データの親参照をすべて補完してから、参照関係を主従関係へ変換します。変換後は親プロジェクトの共有とライフサイクルに明細を従わせます。運用へ生じる正しい動作を2つ選びなさい。",
    choices: [
      "明細は独立した所有者を持たず親レコードを通じて共有アクセスが決まる",
      "明細の親は設定を追加しなくても保存後にいつでも別の親へ変更できる",
      "親を削除すると関連する明細も削除され親を復元すれば明細も復元される",
      "明細の組織の共有設定は親と無関係に非公開または公開参照へ変更できる"
    ],
    answers: [0, 2],
    explanation: `主従関係の明細は独立した所有者を持たず、共有アクセスは親へのアクセスと関係項目の共有設定から決まります。また親を削除すると明細も連鎖削除され、通常は親を復元すると関連明細も復元されます。所有権、共有、削除の単位が親へ統合されることは、参照関係から変換する前に理解すべき重要な副作用です。
        ※ 主従関係では既定で親変更が禁止されています。明細の親変更を許すには関係項目で再親設定を許可する必要があります。
        ※ 明細側の組織の共有設定は親による制御となり、独立した非公開や公開参照として管理できません。共有の基準は親側です。`
  },
  {
    id: 412,
    category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
    source: "新方式対策 高難度追加問題 ID412",
    question: "参加割当はプロジェクトと技術者を結ぶジャンクションオブジェクトです。最初にプロジェクトへの主従関係、次に技術者への主従関係を作成しました。この構成の所有権と削除動作を正しく説明しているものはどれですか。",
    choices: [
      "所有者値はプロジェクトから継承し技術者またはプロジェクトの削除で参加割当も削除される",
      "所有者値は最後に更新した親から継承し片方の親削除時は関係項目だけを空にして参加割当を残す",
      "参加割当は独立した所有者を持ち技術者に参加割当がある間は技術者を削除できない",
      "二番目の技術者が常に所有権を決めプロジェクトを削除しても参加割当は維持される"
    ],
    answers: [0],
    explanation: `ジャンクションオブジェクトでは最初に作成した主従関係が主関係になり、非表示の所有者値や区分は主側であるプロジェクトから継承されます。一方、参加割当は両方の親に対する明細なので、どちらの親を削除しても対応する参加割当は連鎖削除されます。
        ※ 所有権を決める親は更新順では変わりません。主従関係の親削除では参照項目を空にするのではなく明細が削除されます。
        ※ 主従関係の明細には独立した所有者項目がありません。通常の参照関係の削除制限とも動作が異なります。
        ※ 二番目に作成した関係は副関係です。主側を削除すると副側が残っていてもジャンクションレコードは削除されます。`
  },
  {
    id: 413,
    category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
    source: "新方式対策 高難度追加問題 ID413",
    question: "同じプロファイルの利用者がサービスアプリと監査アプリで同じケースオブジェクトを作成します。サービスアプリでは問い合わせ、監査アプリでは内部調査を自動的な既定レコードタイプにしたいという要望です。標準のレコードタイプ動作として正しい説明はどれですか。",
    choices: [
      "アプリごとのLightningページ割り当てが作成時の既定レコードタイプも上書きする",
      "既定レコードタイプはプロファイルと利用者設定に基づきアプリ別には切り替わらない",
      "アプリごとのコンパクトレイアウト割り当てで作成時のレコードタイプを固定できる",
      "サポートプロセスが開いているアプリを判定して対応するレコードタイプを選択する"
    ],
    answers: [1],
    explanation: `利用可能なレコードタイプとプロファイル側の既定値、利用者のレコードタイプ選択設定によって作成時の動作が決まります。Lightningアプリは同じ利用者の既定レコードタイプをアプリごとに切り替えません。必要なら利用者に選択させるか、レコードタイプを明示するクイックアクションやフローをアプリごとに配置します。
        ※ Lightningページの割り当ては表示するページ構成を決めます。新規作成時の既定レコードタイプを暗黙に変更しません。
        ※ コンパクトレイアウトは強調表示やモバイルのプレビュー項目を制御します。レコード作成の種類選択には関与しません。
        ※ サポートプロセスはケース状況値の集合をレコードタイプへ関連付けます。利用中のアプリを判定してレコードタイプを選ぶ機能ではありません。`
  },
  {
    id: 414,
    category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
    source: "新方式対策 高難度追加問題 ID414",
    question: "Salesforce Connectで参照する外部注文にはSalesforceの取引先IDがなく、顧客コードだけがあります。取引先には同じ値を持つ一意の外部ID項目があります。外部データを複製せず取引先の関連リストへ注文を表示する関係はどれですか。",
    choices: [
      "外部注文の顧客コードを取引先IDとして扱い標準の参照関係で18桁IDへ自動変換する",
      "取引先を子にして外部注文を親にする外部参照関係",
      "外部注文を子にして取引先の一意な外部IDと照合する間接参照関係",
      "取引先を主にして外部注文を明細にする主従関係"
    ],
    answers: [2],
    explanation: `間接参照関係は、子が外部オブジェクト、親が標準またはカスタムオブジェクトで、外部データにSalesforce IDがない場合に使用します。外部注文の顧客コードと取引先の一意かつ外部IDとして定義した項目を照合し、外部データを保存し直さず関係を表示できます。
        ※ 標準の参照関係で標準またはカスタム親を指す場合は、外部側に18桁のSalesforceレコードIDが必要です。顧客コードをそのままAccountIdとしては扱えません。
        ※ 外部参照関係は親側が外部オブジェクトである関係です。今回はSalesforce取引先を親として外部注文を子にするため方向が逆です。
        ※ 外部オブジェクトを通常の主従関係の明細として構成し、Salesforce側へ所有権や連鎖削除を持たせることはできません。`
  },
  {
    id: 415,
    category: "オブジェクトマネージャーとLightningアプリケーションビルダー",
    source: "新方式対策 高難度追加問題 ID415",
    question: "障害オブジェクトについて、診断コンポーネントはサービスアプリだけに表示します。一方、ハードウェアとソフトウェアのレコードタイプでは、標準編集画面の必須項目とアクション一覧をすべてのアプリで変えます。必要な設定を2つ選びなさい。",
    choices: [
      "診断コンポーネントを置いたページを組織の既定ページにして全アプリへ配布する",
      "診断コンポーネントを置いたLightningページをサービスアプリへ割り当てる",
      "レコードタイプごとのコンパクトレイアウトだけで必須項目とアクションを定義する",
      "レコードタイプとプロファイルの組み合わせごとにページレイアウトを割り当てる"
    ],
    answers: [1, 3],
    explanation: `Lightningレコードページのアプリ割り当ては、診断コンポーネントなどページ構成をサービスアプリだけに出す目的に適します。標準編集画面の項目必須設定とSalesforceモバイルおよびLightning Experienceのアクションはページレイアウトが制御するため、レコードタイプとプロファイルに応じて割り当てます。
        ※ 組織の既定ページにするとサービス以外のアプリにも診断コンポーネントが表示され、アプリ限定要件を破ります。
        ※ コンパクトレイアウトは強調表示パネルやプレビュー項目を決めます。標準編集画面の必須項目やアクション一覧は管理しません。`
  },
  {
    id: 416,
    category: "セールス&マーケティングアプリケーション",
    source: "新方式対策 高難度追加問題 ID416",
    question: "複数通貨を使用しています。ユーロ商談で有効な製品と有効な法人向け価格表を選択しましたが、製品候補が空です。この製品には米ドルの標準価格と法人向け価格だけがあり、商談にはまだ商品がありません。必要な修正はどれですか。",
    choices: [
      "商談所有者の個人通貨を米ドルへ変更してユーロ商談を再表示する",
      "製品の検索レイアウトへ通貨項目を追加して米ドル価格を選択可能にする",
      "商談レコードタイプへ法人向け価格表を割り当てて通貨照合を無効にする",
      "ユーロの標準価格を用意し法人向け価格表にも有効なユーロ価格を追加する"
    ],
    answers: [3],
    explanation: `複数通貨組織では、商談へ追加できる価格表エントリの通貨が商談通貨と一致する必要があります。カスタム価格表へ製品を追加する前提となる標準価格も含め、ユーロの有効な価格を用意し、選択済みの法人向け価格表へユーロの有効な価格表エントリを作成します。
        ※ 個人通貨は利用者への換算表示などに影響しますが、商談通貨と価格表エントリ通貨の一致要件を変えません。
        ※ 検索レイアウトは候補の列表示を変えるだけです。ユーロ商談で米ドルの価格表エントリを選択可能にはしません。
        ※ レコードタイプは価格表エントリの通貨照合を無効にできません。商談へ選択した価格表と商談通貨に有効な製品価格が必要です。`
  },
  {
    id: 417,
    category: "セールス&マーケティングアプリケーション",
    source: "新方式対策 高難度追加問題 ID417",
    question: "一つの商談にウェビナー、展示会、メール施策が影響しています。主キャンペーンソースは展示会のまま維持しつつ、三施策へ40、35、25パーセントの売上貢献を記録し、モデル別にレポートします。使用すべき機能はどれですか。",
    choices: [
      "ロックされていないカスタムモデルを使うカスタマイズ可能なキャンペーンインフルエンス",
      "三つのキャンペーンを商談の主キャンペーンソース項目へ同時に保存する設定",
      "キャンペーンメンバー状況の反応済みフラグを割合として合計する積み上げ集計",
      "商談取引先責任者の役割を三件作り各役割へキャンペーン別の売上分割率を直接設定する方法"
    ],
    answers: [0],
    explanation: `カスタマイズ可能なキャンペーンインフルエンスのカスタムモデルでは、商談と複数キャンペーンのインフルエンスレコードへ貢献率と売上配分を記録し、モデル単位で分析できます。主キャンペーンソースモデルは一施策へ100パーセントを割り当てるため、展示会を主として残しながら別のカスタムモデルで三施策を配分します。
        ※ 主キャンペーンソース項目に保持できるキャンペーンは一つだけで、複数の割合を同時保存するデータ構造ではありません。
        ※ キャンペーンメンバー状況は接触者の反応を分類します。商談売上の貢献率をモデル別に配分する項目ではありません。
        ※ 商談取引先責任者の役割は商談に関与する顧客側の人物を示します。キャンペーンへのマーケティング貢献配分には使用しません。`
  },
  {
    id: 418,
    category: "セールス&マーケティングアプリケーション",
    source: "新方式対策 高難度追加問題 ID418",
    question: "新しい商談フェーズの法務審査を確度70パーセントのままレポートに表示しつつ、共同売上予測では最善達成予測として集計します。他フェーズの確度や予測区分は変えません。管理者が行う設定はどれですか。",
    choices: [
      "法務審査フェーズの確度を最善達成予測の既定値へ変更して予測を再計算する",
      "法務審査フェーズを最善達成予測の売上予測分類へ対応付け確度は維持する",
      "法務審査専用の営業プロセスを作成して売上予測分類を商談所有者に選ばせる",
      "営業マネージャーの売上予測調整で法務審査の全商談を毎月手動加算する"
    ],
    answers: [1],
    explanation: `商談フェーズには確度と売上予測分類を別々に対応付けられます。法務審査の予測分類だけを最善達成予測へ設定すれば、共同売上予測での集計区分を変えながら、確度70パーセントを確率分析やレポート用に維持できます。
        ※ 確度を変更する必要はなく、変更すると期待売上など確度を使う分析まで変わります。予測分類と確度を同一視した誤答です。
        ※ 営業プロセスはレコードタイプで利用できるフェーズ値を定義します。利用者が商談ごとに予測分類を選ぶ仕組みではありません。
        ※ 売上予測調整はマネージャーの判断を予測へ反映する機能です。恒常的なフェーズ分類の誤設定を毎月手作業で補う方法ではありません。`
  },
  {
    id: 419,
    category: "セールス&マーケティングアプリケーション",
    source: "新方式対策 高難度追加問題 ID419",
    question: "Web-to-Leadから届くリードを、企業規模と国でキューへ割り当て、希望言語に応じた自動返信を送ります。どの条件にも該当しない場合だけ既定所有者と既定返信を使います。正しく構成する内容を2つ選びなさい。",
    choices: [
      "具体的な条件を一般条件より前に置いた有効なリード割り当てルールをWeb-to-Leadで使用する",
      "自動返信を送った後のワークフロー項目更新だけでキュー所有者を決定する",
      "既定リード所有者を設定すれば有効な割り当てルールの一致結果も常に上書きされる",
      "言語別エントリを既定エントリより前に置いた有効なリード自動レスポンスルールを使う"
    ],
    answers: [0, 3],
    explanation: `割り当てルールと自動レスポンスルールは別々に最初の一致エントリを使用します。割り当てでは規模と国の具体的なエントリを一般条件より前へ置き、Web-to-Leadで有効なルールを使用します。返信では言語別エントリを先にし、最後に既定相当の条件を置くことで所有者とメールを独立して正しく決められます。
        ※ 返信後のワークフローで所有者を決めると、割り当て通知やキュー処理の時点とずれます。標準の割り当てルールを使わない理由もありません。
        ※ 既定リード所有者は割り当てルールが所有者を決めなかった場合のフォールバックです。一致したルール結果を常に上書きしません。`
  },
  {
    id: 420,
    category: "セールス&マーケティングアプリケーション",
    source: "新方式対策 高難度追加問題 ID420",
    question: "一つの取引先を製品地域と地理地域の複数チームが担当します。利用者は一つのロールにとどめ、取引先所有者を変更せず、担当テリトリーに基づく取引先アクセスとテリトリー売上予測を実現します。最適な方法はどれですか。",
    choices: [
      "利用者へ担当数と同じ数のロールを割り当てロール階層ごとに売上予測する",
      "取引先を地域別キューで所有し担当変更のたびにキュー間で所有権を移す",
      "有効なテリトリーモデルへ取引先と利用者を割り当ててアクセスを付与する",
      "既定取引先チームへ全地域担当者を登録し個別取引先で不要メンバーを削除する"
    ],
    answers: [2],
    explanation: `Enterprise Territory Managementでは、一つの取引先を複数テリトリーへ割り当て、利用者も複数テリトリーに所属できます。テリトリー階層によるレコードアクセスとテリトリー売上予測を利用でき、取引先所有者や利用者の単一ロールを変更する必要はありません。
        ※ 一人の利用者が持てるロールは一つです。ロール階層は地理と製品の重なりを持つマトリクス担当を直接表現できません。
        ※ 取引先は標準のキュー所有対象ではなく、所有権移動は複数チームの同時担当やテリトリー予測にも適しません。
        ※ 取引先チームは案件ごとの共同作業には使えますが、大量取引先の規則的な複数地域割り当てとテリトリー予測を自動管理しません。`
  },
  {
    id: 421,
    category: "サービス&サポートアプリケーション",
    source: "新方式対策 高難度追加問題 ID421",
    question: "同じサポートキューへ英語とフランス語、複数製品のケースが入ります。フランス語かつ分析製品のケースは、両方の能力を持ち現在のキャパシティに空きがある担当者だけへ自動配信します。最適なOmni-Channel構成はどれですか。",
    choices: [
      "キューの全メンバーへ同時通知し最初に承諾した担当者を所有者にする",
      "ケース割り当てルールで担当者名を一件ずつ条件分岐して直接所有者にする",
      "プレゼンス状況名へ言語と製品を含め担当者自身に状況を選択させる",
      "動的な必要スキルと担当者スキルを照合するスキルベースルーティングを使う"
    ],
    answers: [3],
    explanation: `スキルベースルーティングは、作業項目に必要な動的スキルをルールまたはOmni-Channelフローで付加し、すべての必要スキルを持つ担当者のうち利用可能なキャパシティがある人へ配信します。言語と製品の二条件を人員変更に耐える形で表現できます。
        ※ キューメンバーであることだけではフランス語と製品知識を区別できず、資格のない担当者にも通知されます。
        ※ 割り当てルールへ個人名を並べると勤務状況や現在のキャパシティを評価できず、人員変更の保守負担も高くなります。
        ※ プレゼンス状況は担当者が作業を受けられる状態やチャネルを示します。案件ごとの言語と製品スキルの組み合わせを保証しません。`
  },
  {
    id: 422,
    category: "サービス&サポートアプリケーション",
    source: "新方式対策 高難度追加問題 ID422",
    question: "重大ケースでは、所有者を変更せず法務、製品責任者、顧客担当へケース単位のアクセスと役割を与えます。同じ三役を多数の重大ケースへ一操作で繰り返し追加します。最も適切な機能はどれですか。",
    choices: [
      "役割とアクセスレベルを定義した定義済みケースチームをケースへ追加する",
      "三役をケースキューへ追加して重大ケースの所有権をそのキューへ移す",
      "三役の公開グループへ全ケースを共有し役割名はChatter投稿へ記録する",
      "重大ケースの取引先チームへ三役を登録してケースにも自動継承させる"
    ],
    answers: [0],
    explanation: `ケースチームはケース所有者を変えずに、案件ごとの共同作業者、役割、ケースアクセスレベルを保持します。定義済みケースチームを用意すれば、繰り返し使う三役と各役割を多数のケースへ一操作で追加できます。
        ※ キューは共有作業の所有者候補をまとめますが、個別ケースに三人の役割を保持する機能ではありません。所有者を変えない要件にも反します。
        ※ 公開グループ共有はアクセスを一括付与できますが、ケースごとの参加者や業務上の役割を記録せず、対象も全ケースへ広がります。
        ※ 取引先チームは取引先中心の営業協業機能です。任意のケースへケースチームの役割とアクセスを自動継承する代替ではありません。`
  },
  {
    id: 423,
    category: "サービス&サポートアプリケーション",
    source: "新方式対策 高難度追加問題 ID423",
    question: "プレミアムケースが未解決の間、担当者は24営業時間ごとに顧客へ進捗連絡します。早く連絡を完了しても次回期限を前倒しせず、前回の目標日時を起点に次の24時間枠を開始します。設定すべきマイルストーン再発種別はどれですか。",
    choices: [
      "再発なしを選び完了するたびに担当者が新しいマイルストーンを手動作成する",
      "順次再発を選び前回の目標日時を基準に次の発生を連続して作成する",
      "独立再発を選び連絡完了時刻を常に次のマイルストーン開始時刻にする",
      "ケースエスカレーションを24時間ごとに繰り返してマイルストーンを置き換える"
    ],
    answers: [1],
    explanation: `順次再発マイルストーンは、条件を満たす間、前回の発生に続けて次の発生を作ります。前回を目標日時より早く完了した場合、次回の開始は前回の目標日時となるため、担当者が早く連絡しても24時間のサービス周期が前倒しされません。
        ※ 再発なしは初回応答や解決時間のように一度だけ測る用途です。ケースが継続しても連絡期限を自動で繰り返せません。
        ※ 独立再発は条件が再度一致した時点を前回期限と独立して開始に使います。固定された連続周期を維持する要件とは異なります。
        ※ エスカレーションルールは期限超過時の所有者変更や通知を行う機能で、完了履歴を持つ反復SLAマイルストーンの代替ではありません。`
  },
  {
    id: 424,
    category: "サービス&サポートアプリケーション",
    source: "新方式対策 高難度追加問題 ID424",
    question: "Web-to-Caseのケースは製品別キューへ正しく割り当てられますが、フランス語の顧客にも先頭にある一般英語メールが送信されます。割り当てルールの製品条件は正しいままです。最初に修正すべき設定はどれですか。",
    choices: [
      "ケース割り当てルールのフランス製品エントリを英語製品エントリより上へ移す",
      "フランス語テンプレートをキューのメールアドレスへ直接設定して所有者通知に使う",
      "ケース自動レスポンスルールで言語別エントリを一般エントリより前へ移す",
      "Web-to-Caseの既定ケース所有者をフランス語担当者へ変更して返信言語を継承する"
    ],
    answers: [2],
    explanation: `ケースの割り当てと顧客への自動返信は別のルールで処理されます。自動レスポンスルールは最初に一致したエントリのテンプレートを使うため、無条件または広い一般英語条件が先にあるとフランス語条件へ到達しません。言語別の具体的エントリを一般エントリより前へ置きます。
        ※ 割り当ては既に正しく、割り当てルールの順序を変えても自動返信ルールが選ぶテンプレートは変わりません。
        ※ キューのメールアドレスは所有者通知や送信元に関係します。顧客の言語条件に応じた自動レスポンステンプレート選択を制御しません。
        ※ 既定ケース所有者は割り当てルールで所有者が決まらない場合の受け皿です。顧客への返信言語を所有者から自動継承しません。`
  },
  {
    id: 425,
    category: "サービス&サポートアプリケーション",
    source: "新方式対策 高難度追加問題 ID425",
    question: "Experience Cloud利用者にはKnowledgeオブジェクトの参照権限があります。製品グループと地域グループの両方で分類された記事を顧客サイトに表示するため、記事と利用者について満たす必要がある条件を2つ選びなさい。",
    choices: [
      "記事を外部利用者が参加する非公開Chatterグループへ投稿してレコード共有を継承させる",
      "記事を公開済みにして顧客チャネルで参照可能に設定する",
      "利用者が記事に設定された各カテゴリグループで少なくとも一つの該当カテゴリを参照できるようにする",
      "記事をKnowledgeキューへ割り当てキューメンバーに外部利用者を追加する"
    ],
    answers: [1, 2],
    explanation: `外部顧客が記事を見るには、記事が公開済みで顧客チャネルに公開されていることが必要です。さらに複数のデータカテゴリグループで分類されている場合、利用者は各グループについて記事に割り当てられたカテゴリの少なくとも一つを参照できなければなりません。オブジェクト参照権限だけではこの二層を通過できません。
        ※ Chatterグループへの投稿はKnowledge記事の公開状態、対象チャネル、データカテゴリ可視性を変更せず、リンク先アクセスも付与しません。
        ※ キューはKnowledge記事バージョンを作業対象として保持できますが、顧客チャネルでの公開や外部利用者のカテゴリ可視性を代替しません。`
  },
  {
    id: 426,
    category: "生産性向上とコラボレーション",
    source: "新方式対策 高難度追加問題 ID426",
    question: "営業担当者は一つの顧客会議を一件の商談に関連付け、出席した三人の取引先責任者すべての活動履歴にも同じ会議を表示します。活動を三件へ複製せず、主担当者以外も関連先として保持します。使用すべき設定はどれですか。",
    choices: [
      "商談取引先責任者の役割を三人へ設定して会議を商談だけに関連付ける",
      "公開カレンダーへ会議を作成して三人へカレンダー共有権限を付与する",
      "三人をSalesforce利用者として会議の割り当て先へ同時に設定する",
      "共有活動を有効化して一つの行動を商談と複数の取引先責任者へ関連付ける"
    ],
    answers: [3],
    explanation: `共有活動を有効化すると、一つのToDoまたは行動を一件の関連先レコードと複数の取引先責任者へ関連付けられます。会議は商談を関連先として保持しつつ、最大50人の取引先責任者との関係を持てるため、活動を複製せず各人物の活動履歴に同じ会議を表示できます。
        ※ 商談取引先責任者の役割は商談への人物の関与を示しますが、その商談に関連するすべての活動を各人物の活動履歴へ自動関連付けしません。
        ※ 公開カレンダー共有は予定表の閲覧範囲を制御します。外部顧客である取引先責任者レコードとの活動関係を作りません。
        ※ 行動の割り当て先は活動を担当するSalesforce利用者です。顧客の取引先責任者を複数の所有者として設定する機能ではありません。`
  },
  {
    id: 427,
    category: "生産性向上とコラボレーション",
    source: "新方式対策 高難度追加問題 ID427",
    question: "非公開Chatterグループの全メンバーは案件相談の投稿を読めますが、投稿内の非公開商談リンクを開けるのは一部だけです。グループ外には商談を公開せず、全メンバーがリンク先を読む必要があります。正しい対応はどれですか。",
    choices: [
      "Chatterグループとは別に商談をグループメンバーへレコード共有する",
      "Chatterグループを公開へ変更して投稿に含まれる商談の共有設定も自動的に公開する",
      "商談をフォローするよう全メンバーへ依頼してフォロー関係から参照権限を継承させる",
      "商談名をファイルへ書き出してグループへ添付し元レコードのアクセス制御を解除する"
    ],
    answers: [0],
    explanation: `Chatterグループの可視性は投稿、コメント、グループファイルなどへのアクセスを制御しますが、投稿からリンクされたCRMレコードの共有を変更しません。商談の非公開を維持しながら全メンバーに開かせるには、公開グループや商談チームなど適切なレコード共有を別途付与します。
        ※ グループを公開にすると投稿の閲覧者が増えるだけで、商談の組織の共有設定や共有行は変わりません。機密投稿まで広げる副作用もあります。
        ※ レコードのフォローは更新をフィードで受け取る機能です。参照権限がないレコードをフォローしてアクセスを得ることはできません。
        ※ ファイルへ情報を複製すると元商談の最新性、監査、項目セキュリティが失われます。元レコードを開く要件の解決にもなりません。`
  },
  {
    id: 428,
    category: "生産性向上とコラボレーション",
    source: "新方式対策 高難度追加問題 ID428",
    question: "取引先の契約更新クイックアクションはLightningデスクトップに表示されますが、Salesforceモバイルの取引先アクションバーにはありません。利用者の権限とアクション自体のモバイル対応は確認済みです。最初に確認する場所はどれですか。",
    choices: [
      "取引先のコンパクトレイアウトで契約更新アクションを強調表示項目として追加する",
      "対象ページレイアウトのモバイルおよびLightningアクション欄を確認する",
      "モバイルナビゲーションメニューへ契約更新アクションを独立したタブとして追加する",
      "取引先検索レイアウトの検索結果列へ契約更新アクションのAPI名を追加する"
    ],
    answers: [1],
    explanation: `Salesforceモバイルのレコードアクションバーは、ページレイアウトにあるSalesforceモバイルおよびLightning Experienceのアクション欄から派生します。定義済みアクションを上書きしたレイアウトでアクションが欠けていないか、対象レコードタイプとプロファイルにそのレイアウトが割り当てられているかを確認します。
        ※ コンパクトレイアウトは強調表示パネルとプレビュー項目を制御し、アクションバーへクイックアクションを追加しません。
        ※ モバイルナビゲーションはアプリ内の項目やタブの順序を決めます。レコード固有のクイックアクションの表示場所ではありません。
        ※ 検索レイアウトは検索結果に表示するレコード項目を制御します。アクションのAPI名を列として追加することはできません。`
  },
  {
    id: 429,
    category: "生産性向上とコラボレーション",
    source: "新方式対策 高難度追加問題 ID429",
    question: "モバイル利用者は保守契約レコードを検索した直後、期限、サービスレベル、更新責任者をプレビューで確認したいと考えています。詳細タブの項目順と編集画面は現在のまま維持します。変更すべきものはどれですか。",
    choices: [
      "モバイル利用者向けプロファイルの項目レベルセキュリティで三項目を編集可能にする",
      "ページレイアウトの先頭セクションへ三項目を移動して詳細画面を再配置する",
      "対象レコードタイプへ割り当てた主コンパクトレイアウトへ三項目を配置する",
      "検索レイアウトだけへ三項目を追加して強調表示パネルにも自動継承させる"
    ],
    answers: [2],
    explanation: `コンパクトレイアウトは、SalesforceモバイルのレコードプレビューやLightningの強調表示領域へ出す主要項目を定義します。対象レコードタイプの主コンパクトレイアウトへ三項目を配置すれば、詳細タブのページレイアウトや編集画面を並べ替えずに即時確認できます。
        ※ 項目レベルセキュリティは参照または編集可否を決めます。既に参照可能な項目をプレビューの主要項目として選ぶ機能ではありません。
        ※ ページレイアウトを移動すると詳細画面の順序も変わり、維持要件に反します。プレビューの項目選択を直接制御するのはコンパクトレイアウトです。
        ※ 検索レイアウトは検索結果一覧の列を決めますが、レコードプレビューや強調表示パネルの項目へ自動継承されません。`
  },
  {
    id: 430,
    category: "生産性向上とコラボレーション",
    source: "新方式対策 高難度追加問題 ID430",
    question: "管理者はAgentExchangeで見つけた請求照会サブエージェントとアクションを導入し、既存エージェントへ追加します。導入速度を高めながら、本番データと権限への予期しない影響を避けるために行うことを2つ選びなさい。",
    choices: [
      "発行元、含まれるアクション、必要製品、権限など資産とパッケージの詳細を確認する",
      "先にサンドボックスへ導入し最小権限で代表発話と更新系アクションを検証する",
      "AgentExchange掲載済みなら組織固有の依存関係や権限レビューを省略して本番へ直接入れる",
      "導入時に全利用者へアクセスを付与し動作確認後に不要な権限だけを手作業で探す"
    ],
    answers: [0, 1],
    explanation: `AgentExchangeは事前構築された資産を迅速に導入する手段ですが、組織固有の適合性まで自動保証するものではありません。発行元、構成要素、必要製品、ライセンス、権限を確認し、サンドボックスで最小権限のエージェント利用者を使って選択、出力、データ更新、副作用を検証してから本番へ展開します。
        ※ AgentExchange掲載済みでも、既存自動化との競合、組織固有の依存関係、必要権限、業務上のガードレールは導入先で確認が必要です。本番への直接導入は避けます。
        ※ 最初に全利用者へ広いアクセスを与える方法は最小権限に反し、更新系アクションの影響範囲を拡大します。検証後に権限源を追う運用も監査性が低くなります。`
  },
  {
    id: 431,
    category: "データ管理&分析",
    source: "新方式対策 高難度追加問題 ID431",
    question: "外部請求システムから請求書をData LoaderでUpsertします。ファイルには取引先のSalesforce IDがなく顧客コードだけがあります。取引先の顧客コード項目は一意の外部IDです。請求書の取引先参照を正しく設定する方法はどれですか。",
    choices: [
      "顧客コードを請求書の取引先ID列へそのまま割り当て18桁IDとして解釈させる",
      "請求書を先に取引先なしで登録し数式項目で顧客コードから取引先を検索する",
      "顧客コードと取引先名を結合した値を請求書所有者の外部IDとして割り当てる",
      "取引先参照の関係外部ID項目を選びファイルの顧客コード列を対応付ける"
    ],
    answers: [3],
    explanation: `Data Loaderでは、子レコードの参照先をSalesforce IDの代わりに親の外部IDで解決できます。請求書の取引先関係に表示される取引先の顧客コード外部ID項目をマッピング先として選び、CSVの顧客コードを対応付けます。これにより親IDを事前抽出せず関係を設定できます。
        ※ AccountIdなど通常の参照ID項目はSalesforceレコードIDを要求します。業務上の顧客コードを18桁IDとして自動解釈しません。
        ※ 数式項目は任意の値でレコードを検索して参照関係を後付けする機能ではありません。親なし請求書も一時的なデータ不整合になります。
        ※ 所有者の外部IDは請求書の所有権に関係し、取引先参照を解決しません。項目を結合しても親レコードとの関係は作られません。`
  },
  {
    id: 432,
    category: "データ管理&分析",
    source: "新方式対策 高難度追加問題 ID432",
    question: "移行検証で作成した数百万件の一時レコードを削除します。削除後にごみ箱の容量を消費させず、利用者が復元できない状態にします。事前バックアップと少量テストは完了しています。最も適切な方法はどれですか。",
    choices: [
      "必要権限を限定付与しBulk APIを使うData Loaderの物理削除を実行する",
      "Data Loaderの通常削除を実行して各利用者に自分のごみ箱を空にしてもらう",
      "Export Allを実行すれば抽出済みレコードがSalesforceから自動的に除去される",
      "リストビューの一括削除を繰り返し組織のごみ箱保持期間が切れるまで待つ"
    ],
    answers: [0],
    explanation: `物理削除はレコードをごみ箱へ送らず直ちに削除するため、大量の一時データを復元不能にし、ごみ箱容量も消費させない要件に合います。Bulk API Hard Delete権限は強力なので、専用の最小権限利用者へ一時的に付与し、バックアップと少量テスト後に対象IDを厳密に指定します。
        ※ 通常削除は組織のごみ箱へ移動し、容量と保持期間の対象になります。各利用者の個人ごみ箱だけでは組織全体の削除済みデータを確実に除去できません。
        ※ Export Allは削除済みを含むデータを抽出できる操作であり、抽出元レコードを削除する処理ではありません。
        ※ リストビューの一括削除は大量データに非効率で、保持期間中は復元可能かつごみ箱を消費するため要件を満たしません。`
  },
  {
    id: 433,
    category: "データ管理&分析",
    source: "新方式対策 高難度追加問題 ID433",
    question: "重複ルールは共有をバイパスして一致候補を検索する設定です。しかし東地域だけを既定表示するスコーピングルールが適用された利用者には、西地域にある同一メールの取引先が重複候補として出ません。最も適切な説明はどれですか。",
    choices: [
      "一致ルールは新規作成時には動かず夜間の重複ジョブだけが既存レコードを比較する",
      "スコーピングルールは共有バイパスを有効にした重複検索でも候補集合を制限する",
      "共有バイパスはシステム管理者の作成操作だけに有効で一般利用者には常に無効になる",
      "スコーピングルールはリストビューにしか作用しないためメール項目の大文字小文字が原因である"
    ],
    answers: [1],
    explanation: `スコーピングルールが有効な組織では、重複ルールで共有をバイパスする設定を使っても、重複候補は利用者のスコープによって制限されます。共有バイパスとスコープは別の評価層なので、西地域のレコードが候補に現れない動作は仕様上起こり得ます。
        ※ 一致ルールと重複ルールはレコードの作成や編集時にも評価できます。夜間の重複ジョブだけに限定される機能ではありません。
        ※ 共有バイパスは重複ルールの比較範囲に関する設定で、一般利用者だから一律無効になるという説明ではありません。
        ※ スコーピングルールはリストビューだけでなくレポートやSOQLなどにも作用し、重複候補にも影響します。提示情報だけで大文字小文字を原因とは断定できません。`
  },
  {
    id: 434,
    category: "データ管理&分析",
    source: "新方式対策 高難度追加問題 ID434",
    question: "商談レポートを所有者でグループ化し、各所有者について金額が1000万円以上の商談件数を全商談件数で割った割合を表示します。オブジェクトへ項目は追加せず、各明細行も残します。適切なレポート構成はどれですか。",
    choices: [
      "金額を二つのバケットへ分類しバケット名をPARENTGROUPVALで件数へ変換する",
      "クロスブロック数式で高額商談ブロックの金額合計を全商談の行数で割る",
      "行レベル数式で高額なら一を返して集計し所有者の行数で割る集計数式を使う",
      "レポートスナップショットで高額商談だけを保存し元レポート件数と手作業で比較する"
    ],
    answers: [2],
    explanation: `行レベル数式で各商談を評価し、金額が基準以上なら1、それ以外なら0を返します。その列を所有者グループで合計し、集計数式で所有者グループのRowCountで割れば、明細を保持したまま高額商談の件数割合を計算できます。オブジェクト項目も不要です。
        ※ バケットは金額帯の分類には使えますが、テキストのバケット名をPARENTGROUPVALで条件付き件数へ変換することはできません。
        ※ 求めるのは件数割合であり金額合計ではありません。 joined reportを作る必要もなく、ブロック間のフィルター差で分母がずれる危険があります。
        ※ レポートスナップショットは時点データを保存する機能です。現在のグループ内比率を対話的に計算するための最小構成ではありません。`
  },
  {
    id: 435,
    category: "データ管理&分析",
    source: "新方式対策 高難度追加問題 ID435",
    question: "全取引先を一行集合の基礎にし、ケースがない取引先も残します。ケースがある場合はケース情報と、そのケースの取引先責任者のメールを同じレポートタイプで選択可能にします。カスタムレポートタイプで必要な設定を2つ選びなさい。",
    choices: [
      "取引先には必ず一件以上のケースが必要という関係を選択する",
      "ケースを主オブジェクトにして取引先がないケースも含める関係を選択する",
      "取引先を主オブジェクトにしてケースの有無を問わない関係を選択する",
      "レポートタイプのレイアウトでケースの取引先責任者参照をたどる関連項目を追加する"
    ],
    answers: [2, 3],
    explanation: `全取引先を残すには取引先を主オブジェクトとし、取引先にケースがあってもなくてもよい外部結合型の関係を選びます。さらにカスタムレポートタイプのレイアウトで、ケースの取引先責任者参照を経由したメール項目を関連参照項目として追加すれば、一つのレポートタイプで必要な列を提供できます。
        ※ 取引先にケースが必須の関係は内部結合になり、ケースが一件もない取引先をレポートの基礎集合から除外します。
        ※ ケースを主にするとケースが存在する行から始まるため、ケースのない取引先を表現できません。主オブジェクトの選択が要件と逆です。`
  },
  {
    id: 436,
    category: "データ管理&分析",
    source: "新方式対策 高難度追加問題 ID436",
    question: "joined reportの一つ目のブロックに商談金額、二つ目に未解決ケース件数があります。取引先ごとの金額をケース件数で割るクロスブロック数式を表示したいのですが、現在は各ブロックが別々の項目でグループ化されています。最初に必要な変更はどれですか。",
    choices: [
      "商談ブロックへ行レベル数式を追加しケース件数を商談行ごとに複製する",
      "両ブロックを同じカスタムレポートタイプへ変更して個別フィルターを削除する",
      "取引先名をバケット項目へ変換して各ブロック内だけで独立して集計する",
      "両ブロックに共通する取引先項目でブロック横断グループを設定する"
    ],
    answers: [3],
    explanation: `クロスブロック数式を取引先単位で意味のある値として評価するには、両ブロックを共通項目で横断グループ化する必要があります。商談とケースが共有する取引先項目をGroup Across Blocksへ設定し、そのグループで各ブロックの集計値を参照して割り算します。
        ※ 行レベル数式は一つのブロック内の各レコードを評価し、別レポートタイプのケース件数を商談行へ取得できません。
        ※ joined reportは異なる関連レポートタイプを並べるための機能です。同じレポートタイプへ変更する必要はなく、ブロック別フィルターも利用できます。
        ※ ブロックごとに独立したバケットで分類しても、同じ取引先の集計をブロック間で対応付ける共通グループにはなりません。`
  },
  {
    id: 437,
    category: "データ管理&分析",
    source: "新方式対策 高難度追加問題 ID437",
    question: "人事担当者は従業員オブジェクトのすべてのレコードを参照でき、給与レポートフォルダーにも編集者アクセスがあります。しかし管理者が作ったレポートで給与項目を列へ追加できず、保存済みレポートでも値が見えません。最初に直すべきものはどれですか。",
    choices: [
      "給与項目の参照権限を人事担当者用の権限セットで付与する",
      "従業員ページレイアウトへ給与項目を置いてレポートビルダーへ継承させる",
      "レポートフォルダーのアクセスを管理へ上げて項目レベル制限を上書きする",
      "従業員のすべてのレコードを変更する権限を与えて給与列を編集可能にする"
    ],
    answers: [0],
    explanation: `レポートはレコード共有だけでなく項目レベルセキュリティも尊重します。全レコード参照とフォルダー編集権限があっても、給与項目への参照権限がなければ列として選択または表示できません。人事担当者へ給与項目の参照だけを権限セットで追加するのが最小権限です。
        ※ ページレイアウトへ項目を配置しても項目レベルセキュリティは付与されません。レポートビルダーの列可用性もレイアウトから継承しません。
        ※ レポートフォルダー権限はレポート定義の参照や編集を制御します。基礎データの項目アクセスを上書きしません。
        ※ すべてのレコードを変更する権限はレコードレベルの編集を広げ過ぎます。給与項目の参照権限が欠けた原因を最小限に解決しません。`
  },
  {
    id: 438,
    category: "データ管理&分析",
    source: "新方式対策 高難度追加問題 ID438",
    question: "営業責任者は現在の商談フェーズと金額を、同じ商談の7日前のフェーズと金額に並べて比較し、変更量をレポートで分析します。個々の変更イベント一覧ではなく、対応する現在値と過去値を列として扱います。適切な機能はどれですか。",
    choices: [
      "項目履歴管理レポートで変更日時が7日前の履歴行だけを現在行へ結合する",
      "商談の履歴トレンドを有効化して現在値と指定した過去時点の値を比較する",
      "レポートスナップショットを今から開始して既に過ぎた7日前の値を復元する",
      "PREVGROUPVALを使って一つ前に表示された別商談の金額を過去値として参照する"
    ],
    answers: [1],
    explanation: `履歴トレンドは、商談など対応オブジェクトの選択項目について現在値と過去のスナップショット値をレポートで比較するための機能です。同じ商談のフェーズや金額が指定期間でどう変化したかを列として扱え、パイプライン変化の分析に適します。
        ※ 項目履歴管理は個々の変更イベント、変更者、変更前後値を記録します。同一商談の複数項目を一つの過去時点として現在行へ並べる用途とは異なります。
        ※ レポートスナップショットは構成後の実行時点から対象オブジェクトへ値を蓄積します。設定前の7日前へ遡って値を復元できません。
        ※ PREVGROUPVALはレポート上の前のグループ集計と比較します。同じ商談の過去時点値を取得する関数ではありません。`
  },
  {
    id: 439,
    category: "データ管理&分析",
    source: "新方式対策 高難度追加問題 ID439",
    question: "取引先レポートで、過去12か月に成立商談が一件以上あり、現在未解決ケースが一件もない取引先だけを抽出します。成立済み商談や解決済みケースの明細列は不要です。最も適切なフィルター構成はどれですか。",
    choices: [
      "取引先と商談とケースのjoined reportを作り全ブロックの行数が同じ取引先だけを残す",
      "取引先レポートへ商談成立日とケース状況の通常項目フィルターだけを直接追加する",
      "成立済み商談ありのクロスフィルターと未解決ケースなしのクロスフィルターを併用する",
      "取引先を主とするカスタムレポートタイプで商談とケースをどちらも必須関係にする"
    ],
    answers: [2],
    explanation: `取引先を主集合にし、取引先に商談ありというクロスフィルターへ成立と過去12か月のサブ条件を加えます。さらに取引先にケースなしというクロスフィルターへ未解決のサブ条件を加えると、成立実績があり、現在の未解決ケースがゼロという存在条件と不存在条件を同時に表現できます。
        ※ joined reportは複数集合を並べて比較できますが、行数一致は成立実績と未解決ケース不存在を意味せず、必要以上に複雑です。
        ※ 取引先単体レポートの通常項目フィルターでは、子レコードが一件以上存在することと条件付きの子が一件も存在しないことを直接表現できません。
        ※ 商談とケースを必須関係にするとケースがある取引先だけを残します。未解決ケースなしという要件と逆の基礎集合になります。`
  },
  {
    id: 440,
    category: "自動化",
    source: "新方式対策 高難度追加問題 ID440",
    question: "ケース保存時に件名を正規化して同じケースへ格納し、保存が入力規則を通過した後だけ関連フォローアップToDoを作成します。同じケースの再更新による再帰を避け、処理を効率化します。最適なフロー構成はどれですか。",
    choices: [
      "保存後フローで件名を更新してから同じフロー内でToDoを作成する",
      "保存前フローだけを使い件名変更と関連ToDo作成を保存前に完了する",
      "スケジュールトリガーフローで件名更新とToDo作成を翌日に一括処理する",
      "保存前フローで件名を設定し保存後フローで条件を確認してToDoを作成する"
    ],
    answers: [3],
    explanation: `同じトリガーレコードの項目更新は保存前フローで代入すると追加DMLを使わず、再保存も発生しません。関連ToDoの作成はレコードIDが確定して入力規則を通過した後に行う必要があるため、保存後フローへ分けます。各フローに厳密な開始条件を置けば再帰と重複作成も抑えられます。
        ※ 保存後に同じケースをUpdate Recordsで更新すると新たな保存処理を起こし、再帰や不要なDMLを招きます。件名だけなら保存前が適します。
        ※ 保存前フローはトリガーレコードの高速更新に特化し、関連する新規ToDoレコードを作成できません。
        ※ 翌日処理は保存直後に正規化とToDo作成が必要な要件を満たさず、失敗した入力を先に保存する設計にもなります。`
  },
  {
    id: 441,
    category: "自動化",
    source: "新方式対策 高難度追加問題 ID441",
    question: "契約が更新待ちになった24時間後、現在も更新待ちで、かつキュー登録時から契約金額が変わっていない場合だけ通知します。スケジュール済みパス内で登録時の金額と比較しようとしました。堅牢な設計はどれですか。",
    choices: [
      "即時パスで登録時金額を保存項目へ記録しスケジュール済みパスで現在値と比較する",
      "スケジュール済みパスでRecord Priorの金額を直接参照して現在値との差を判定する",
      "数式項目で24時間前の契約金額を履歴テーブルから自動取得して比較する",
      "通知直前にデバッグを実行しデバッグ時の旧値を本番フローへ引き渡す"
    ],
    answers: [0],
    explanation: `スケジュール済みパスではRecord Priorを利用できないため、キューへ入れた時点の比較基準を即時パスで通常項目へ保存します。24時間後に開始条件を再確認し、現在金額と保存した基準金額を比較すれば、後続更新の有無を明示的かつ監査可能に判定できます。
        ※ Record Priorはスケジュール済みパスの要素やその開始条件でサポートされません。直接参照する設計は保存できないか期待どおり動作しません。
        ※ 数式項目は項目履歴の任意の過去行を検索して24時間前の値を返せません。過去基準を固定するには保存項目などが必要です。
        ※ デバッグ値は一回のテスト実行用で、将来再開する本番インタビューへ状態を保存する機構ではありません。`
  },
  {
    id: 442,
    category: "自動化",
    source: "新方式対策 高難度追加問題 ID442",
    question: "レコードトリガーフローの非同期パスでSalesforceレコードを更新した後、外部サービスのコールアウトアクションを実行すると未確定作業に関するエラーになります。処理順またはトランザクション設定として有効な修正を2つ選びなさい。",
    choices: [
      "対応アクションのトランザクション制御をフローに判断させ必要時に新しいトランザクションを開始させる",
      "コールアウトへフォールトコネクタだけを追加して同じトランザクションの未確定作業を解消する",
      "同一トランザクションを維持するならSalesforceの更新より前にコールアウトを実行する",
      "アクションを常に現在のトランザクションで続行へ固定して更新結果を先に確定させる"
    ],
    answers: [0, 2],
    explanation: `非同期またはスケジュール済みパスのアクションでは、トランザクション制御をフローに判断させると、未確定の更新があるコールアウトを必要に応じて新しいトランザクションで実行できます。単一トランザクションを保つ設計なら、外部アクセスをSalesforce DMLより先へ移して未確定作業を作らない順序にします。
        ※ フォールトコネクタは発生したエラーを処理できますが、コールアウト前の未確定DMLという原因を解消しません。正常系を成功させる修正ではありません。
        ※ 常に現在のトランザクションで続行すると、DML後のコールアウトが同じ未確定作業エラーを起こします。設定名と実際の確定動作を取り違えた選択肢です。`
  },
  {
    id: 443,
    category: "自動化",
    source: "新方式対策 高難度追加問題 ID443",
    question: "監査案件に未完了の是正措置が一件でもある場合、利用者による監査案件の削除を取り消し、削除画面へ未完了措置があるという具体的なエラーを返します。入力規則では削除を検出できません。宣言的な実装はどれですか。",
    choices: [
      "削除後フローで監査案件を同じ項目値の新規レコードとして作り直す",
      "削除を契機とするレコードトリガーフローで子を取得しカスタムエラーを実行する",
      "スケジュール済みフローで削除済み案件を翌日検索してごみ箱から復元する",
      "ページレイアウトから削除ボタンを外してAPIと一括削除も同時に禁止する"
    ],
    answers: [1],
    explanation: `削除を契機とするレコードトリガーフローで関連する未完了是正措置を取得し、存在する分岐でカスタムエラーを実行します。カスタムエラーは削除を含むトリガー変更をロールバックし、レコードページへ具体的なメッセージを返せるため、入力規則では扱えない削除制御を宣言的に実装できます。
        ※ 削除後に似たレコードを作り直しても元ID、共有、履歴、関連関係は戻らず、削除そのものを取り消したことになりません。
        ※ 翌日の復元では削除直後からデータが欠落し、物理削除や関連データの状態にも対応できません。利用者へ即時エラーも返せません。
        ※ ボタン非表示は画面上の導線を減らすだけです。API、Data Loader、別画面などの削除権限を強制的に止めません。`
  },
  {
    id: 444,
    category: "自動化",
    source: "新方式対策 高難度追加問題 ID444",
    question: "画面フローで申請レコードを作成し、同じトランザクション内で明細を作成します。二つの作成要素の間に画面はありません。明細作成が失敗したら申請も保存せず、利用者へ修正画面を表示して再入力させます。必要な構成はどれですか。",
    choices: [
      "明細作成のフォールトパスからエラー画面へ直接進み申請の保存はそのまま確定する",
      "申請作成をスケジュール済みパスへ移し明細の成否と無関係に後から作成する",
      "明細作成のフォールトパスでレコード変更をロールバックしてから修正画面へ進む",
      "申請作成直後に確認画面を追加して先のトランザクションを確定してから明細を作る"
    ],
    answers: [2],
    explanation: `画面フローのフォールトパスへレコード変更をロールバック要素を置くと、現在のトランザクションで保留中の申請と明細の変更を取り消せます。その後に修正用画面へ進めば、孤立した申請を残さず利用者が入力を直せます。二つのDML間に画面がないため同じロールバック範囲です。
        ※ フォールトを画面で処理するだけでは、先に成功した申請の保留変更がトランザクション終了時に確定する場合があり、原子性を保証しません。
        ※ スケジュール済み処理へ分けると申請と明細が別時点になり、両方成功または両方取消という要件から遠ざかります。
        ※ 途中に画面を置くとそこで前のトランザクションが終了します。後の明細が失敗しても確定済みの申請を同じロールバック要素で取り消せません。`
  },
  {
    id: 445,
    category: "自動化",
    source: "新方式対策 高難度追加問題 ID445",
    question: "商談の保存前フローBは、保存後フローAが作成する審査結果レコードを参照して商談項目を設定しようとしています。両フローへトリガー順序を設定してもBでは審査結果が見つかりません。根本的な修正はどれですか。",
    choices: [
      "フローAのトリガー順序を一、フローBを二にして保存前と保存後の境界を上書きする",
      "フロー名の先頭へ番号を付けアルファベット順でAが必ず先に動くようにする",
      "フローBを非同期パスへ変更して保存前の高速項目更新をそのまま利用する",
      "必要な判定を保存前に完結させるか依存処理を保存後へまとめて実行段階をそろえる"
    ],
    answers: [3],
    explanation: `トリガー順序は同じ実行段階にある複数の保存前フロー同士、または保存後フロー同士の順序を決めます。保存前処理は常に保存後処理より先なので、保存後に作るレコードを保存前から読む依存関係は順序値で解決できません。判定材料を保存前に用意するか、関連作成と依存処理を保存後へそろえます。
        ※ 小さい順序値を付けても保存前と保存後のプラットフォーム上の実行段階は逆転しません。設定可能な範囲を超えています。
        ※ フロー名の並び順は明示的なトリガー順序の代替ではなく、保存前と保存後の実行段階の境界も変更しません。
        ※ 非同期パスは保存後フローで使用する別トランザクションの経路です。保存前の高速項目更新として同じレコードを扱う性質を維持できません。`
  },
  {
    id: 446,
    category: "自動化",
    source: "新方式対策 高難度追加問題 ID446",
    question: "既存の有効な自動起動フロー承認プロセスを使う契約について、利用者がLightningレコードページから申請理由を入力して承認を依頼します。カスタムボタンや専用画面フローは作らず、申請状況もページ上で確認しやすくします。最も直接的な構成はどれですか。",
    choices: [
      "契約レコードページへRequest Approvalを配置し承認フローを指定する",
      "承認履歴関連リストだけを追加して利用者に設定画面から申請させる",
      "動的アクションで標準編集ボタンの表示名を承認申請へ変更し保存操作を申請として扱う",
      "レコードページへレポートグラフを置き未申請契約をクリックすると自動申請する"
    ],
    answers: [0],
    explanation: `Request ApprovalコンポーネントはLightningレコードページを有効な自動起動フロー承認プロセスへ接続し、申請コメントや第一承認者などの入力を渡せます。Classic承認プロセスには使用できませんが、設問の前提ではカスタムボタンや申請専用の画面フローを保守せず、App Builderで対象ページと表示条件を構成できます。
        ※ 承認履歴関連リストは過去と現在の承認情報を表示しますが、それだけでは利用者がレコードページから新規申請する入力導線になりません。
        ※ 編集アクションの表示や名称を変えても、通常保存が承認申請APIの呼び出しへ変わることはありません。
        ※ レポートグラフは集計を可視化するコンポーネントです。クリックを契機に個別レコードを承認プロセスへ申請する標準動作はありません。`
  },
  {
    id: 447,
    category: "Agentforce",
    source: "新方式対策 高難度追加問題 ID447",
    question: "顧客向けService Agentは注文番号を正しく取得し、適切な注文照会アクションも選択しますが、実行時にオブジェクトアクセスエラーになります。チャネルは未認証利用者向けで、フロー自体は管理者のデバッグで成功します。最初に確認すべきものはどれですか。",
    choices: [
      "顧客のExperience Cloudプロファイルへ注文のすべてのレコードを変更する権限を付ける",
      "エージェント利用者へ注文の必要項目とフロー実行に必要な最小権限を付与する",
      "アクション説明へ管理者権限で注文を照会するよう自然言語の指示を追加する",
      "トピックの範囲を注文以外の全CRMオブジェクトへ広げてアクセスエラーを回避する"
    ],
    answers: [1],
    explanation: `未認証チャネルで動くService Agentは、通常エージェント利用者の実行コンテキストと権限を使います。アクション選択まで成功しているため、エージェント利用者に注文オブジェクトと必要項目の参照、個別フローの実行またはRun Flowsなど、基盤アクションが要求する最小権限があるかを確認します。
        ※ 未認証の顧客自身にはSalesforce利用者コンテキストがなく、顧客プロファイルへ広範な変更権限を付ける対処は対象も権限水準も誤っています。
        ※ 自然言語のアクション説明は権限チェックを昇格させません。管理者権限で実行するという文言を加えてもプラットフォームセキュリティは変わりません。
        ※ トピック範囲を広げると選択の曖昧さが増えるだけです。注文オブジェクトへの実行権限不足を解消しません。`
  },
  {
    id: 448,
    category: "Agentforce",
    source: "新方式対策 高難度追加問題 ID448",
    question: "エージェント更新後、百件の代表発話について期待するサブエージェント、アクション列、回答要点を繰り返し評価します。生成結果の揺らぎも考慮し、更新系アクションが本番顧客データへ影響しないようにします。適切な方法はどれですか。",
    choices: [
      "本番の会話プレビューで一件ずつ実行し一度成功した発話は以後の試験から外す",
      "基盤フローのデバッグだけを実行しサブエージェント分類と最終回答は検証しない",
      "サンドボックスのAgentforce Testing Centerで期待値付きテストを反復実行する",
      "本番のTesting CenterならCRM更新もクレジット消費も起きないため全件を直接実行する"
    ],
    answers: [2],
    explanation: `Agentforce Testing Centerは、発話ごとに期待するサブエージェント、アクション、応答内容などを定義し、非決定的なエージェント挙動をまとめて反復評価できます。テストでもアクションはCRMデータを変更し得るため、分離されたサンドボックスと専用テストデータで実行します。
        ※ 会話プレビューは個別の調査には有効ですが、百件の再現可能な回帰試験には非効率です。一度の成功だけで生成挙動の揺らぎも評価できません。
        ※ フロー単体のデバッグでは、利用者発話からの分類、アクション選択順、グラウンディング、最終応答というエージェント全体を検証できません。
        ※ Testing Centerの実行は要求やクレジットを消費し、設定されたアクションによってCRMデータも変更できます。本番が無影響という前提は危険です。`
  },
  {
    id: 449,
    category: "Agentforce",
    source: "新方式対策 高難度追加問題 ID449",
    question: "請求に関する発話が返品サブエージェントへ誤分類されることがあり、返品へ正しく分類された後も照会依頼で返品作成アクションが選ばれます。基盤フローは単体で正常です。二つの異なる選択段階を改善する設定を2つ選びなさい。",
    choices: [
      "エージェント利用者へすべての請求と返品オブジェクトの変更権限を追加する",
      "請求と返品のサブエージェントの対象範囲と境界を重ならない説明へ修正する",
      "照会と作成の全アクションを一つへ統合し実行後に結果から処理種別を判断する",
      "返品サブエージェント内で照会と作成のアクション説明と使用条件を明確に分ける"
    ],
    answers: [1, 3],
    explanation: `最初の誤りは発話をどのサブエージェントへ渡すかという分類段階なので、請求と返品の範囲、対象外、境界を区別できる説明へ直します。二つ目は返品サブエージェント内のアクション選択なので、参照と更新の目的、必要入力、使用条件、期待出力を重ならない表現へ修正します。原因層を分けることが重要です。
        ※ エージェント利用者へ請求と返品の変更権限を追加しても、分類精度やアクション選択の意味は改善しません。むしろ誤選択された更新アクションの影響を大きくします。
        ※ 照会と作成を一つに統合すると、読み取りと変更の境界がさらに曖昧になります。実行後に判断する設計では不要な更新を事前に防げません。`
  },
  {
    id: 450,
    category: "Agentforce",
    source: "新方式対策 高難度追加問題 ID450",
    question: "補助管理者にはSetup with Agentforceの利用権限とプロンプトテンプレート実行権限があります。設定内容の説明は得られますが、共有ルールの変更を依頼すると権限不足になります。機能は組織で有効化済みです。最も適切な説明と対応はどれですか。",
    choices: [
      "Setup with Agentforceを使える利用者は自動的にシステム管理者となるため製品障害として報告する",
      "プロンプトテンプレート実行権限を外して再付与すればすべての設定変更権限も再計算される",
      "共有ルールの変更指示をより強い命令文へ書き換えれば権限チェックを越えて実行できる",
      "Data 360既定データスペースへのアクセスと依頼する設定作業自体の管理権限を確認する"
    ],
    answers: [3],
    explanation: `Setup with Agentforceの利用権限とプロンプト実行権限は機能へ入るための前提ですが、依頼した設定作業の権限を昇格させません。利用者にはData 360の既定データスペースへのアクセスに加え、共有ルール変更ならManage Sharingなど、その管理操作自体に必要な権限が必要です。最小権限で作業範囲を付与します。
        ※ Setup with Agentforceを利用できることはシステム管理者化を意味しません。説明できても変更できない動作は権限分離として想定されます。
        ※ プロンプトテンプレート実行権限の再付与は、共有管理など別のシステム権限を追加または再計算しません。
        ※ 自然言語の強さはSalesforceの認可判定を回避しません。権限を越える指示を許せばセキュリティ境界が成立しなくなります。`
  },
];
